
const l = [ { 'title' :`አፌ ለምስጋና`, 'lyrics':` አፌ ለምስጋና ለውዳሴ ይከፈት * 2 ድንቅ አድርጎልኛል በአስጨነቁኝ ፊት አፌ ለምስጋና ይከፈት
 ፊቱ ተደፍቼ ነግሬው ምስጢር ፈጥኖ ፈጸመልኝ የልቤን ነገር ድንቅ ድንቅ ነገር ለኔ እየሰራ ሰገነት አቆመኝ ክብሩን እንዳወራ
 ያለምኩት እንደጉም ሲጠፋብኝ በኖ ባዶነት ሲሰማኝ ይረዳኛል ፈጥኖ የአፌን ልመና ከቶ የማይረሳ
 ልቤ ይደሰታል ስሙን እያነሳ
 ምንም በሌለበት ተስፋ ሆነኝ ጌታ ምስጋና አቀረበች ነፍሴም ተደስታ አይኔ ተመልክቷል ድንቅ ነገር ደግሞ ሽባን ሲያራምድ አልጋን አሸክሞ
 ምስጢሬን ሳወራ ገብቼ መቅደሱ ሰማኝ በፅሞና የታመነው እርሱ መጣሁኝ ደስ ብሎኝ እኔም እንደሐና በፈጣሪዬ ፊት ለማድረስ ምስጋና
 `},{ 'title' :`የብርሃን ጎርፍ ናት`, 'lyrics':` የብርሃን ጎርፍ ናት ድንግል እናታችን ከሰማይ እያበራች ደስ አለው ልባችን ፍቅርሽን ሰላምሽን ድህነት ይሁነን
 ፍጥረት በሙሉ * 2 ፊትሽ ይወድቃሉ ጸጋሽ ይድረሰን * 2 ይስጠን እያሉ
 የኔ ልብ ምን ፅድቅ አለው አንቺን ለማስተናገድ የሃጢያት ጎተራ ነው የተሞላ በስስት
 ኧረ እንዴት * 2 ድንግል ትኑርበት አትፀየፍም የኔን ልብ ታሰናዳዋለች ስለሃጢያቴ የኔ እናት ምልጃ ታቀርባለች
 ልባቸውን የዘጉ ድንግልን ለማስገባት ህሊናቸው ይመለስ እንጸልይ ለዚህ ጥፋት አምላክን ይዛ ነው የምትመጣው
 እርሷን ስንመልስ ጌታን ነው የምናስቀይመው
 
 
 
 
 `},{ 'title' :`ከጌታዬ ፍቅር የሚለየኝ ማነው`, 'lyrics':` ከጌታዬ ፍቅር የሚለየኝ ማነው * 2
 መከር ችግር ስቃይ ወይስ መራቆት ነው * 2 አንፈራም አንሰጋም አንጠራጠርም * 2
 እግዚአብሔር ከኛ ጋራ ይኖራል ለዘለዓለም * 2 የሰማይ ቤታችን አማኑኤል የሰራው * 2
 ግንቡ ንጹህ ውሃ መሰረቱ ደም ነው * 2 ሳይነጋ ተራምደን እንጓዝ በጠዋት * 2 በደሙ መስርቶ ከሰራልን ቤት * 2
 የውሃ ግድግዳ የደም መሰረት * 2 ይኸው ከዚህ አለ የአማኑኤል ቤት * 2
 `},{ 'title' :`ምን ሰማህ ዮሐንስ`, 'lyrics':` ምን ሰማህ ዮሐንስ በማህፀን ሳለህ * 2 ህጻን ሆነህ ነብይ ለክብር የተጠራህ * 2 እንደ አንበሳ ጥጃ ያዘለለ ደስታ * 2
 ምን ዓይነት ድምጽ ነው ምን አይነት ሰላምታ * 2 ከተፈጥሮ በላይ ያሰገደህ ክብር
 እንዴት ቢገባህ ነው የአምላክ እናት ፍቅር * 2 ሌላ ድምጽ አልሰማም ከእንግዲህ በኋላ ለውጦኛል እና የሰላምታ ቃሏ * 2
 በረሃ ያስገባህ ለብዙ ዘመናት
 ምን ያለ ራዕይ እንዴት ያለ ብስራት * 2 እንደ አዲስ ምስጋና ስልቱ የተዋበ ተደምጦ የማያውቅ ጭራሽ ያልታሰበ * 2
 ከሴት የተገኘ ከደቂቀ አዳም
 ድንግል ስለሆነ በሕይወቱ ፍፁም * 2 ከማህፀን ሳለ ተመርጦ በጌታ ለማዳመጥ በቃ የኪዳን ሰላምታ * 2
 
 
 
 
 
 
 
 
 
 `},{ 'title' :`አንደበትን ስጠኝ ጌታዬ`, 'lyrics':` አዳኙ ስምህን ዘወትር ልጠራበት ቅዱስ ኃያል ህያው ክብር የምልበት ከሃጢያት የራቀ ሐኬት የሌለበት
 ምስጋናህን ብቻ የምናገርበት * 2 አንደበትን ስጠኝ ጌታዬ * 4
 ሕይወት የሆነውን ቃልህን ሰባኪ ገናናነትህን ክብርህን ተራኪ ለንስሃ ህይወት በጎችህን ጠሪ
 እንደ ሐዋሪያት ፍቅርህን መስካሪ * 2 ከከሃድያን ጋር የማይተባበር
 ፆምና ጸሎትን የሚያዘወትር
 ከጽድቅ ስራ ጋር መልካም ህብረት ያለው
 በምድራዊ ምኞት የማይታለለው * 2 ፈተና ሲገጥመኝ በመከራ ጊዜ
 የሀዘን ጥላ ጋርዶን ሲከበን ትካዜ ተመስገን የሚል በችግር በደስታ
 ርቱዕ አንደበትን ፍጠርልን ጌታ * 2
 `},{ 'title' :`የጽድቅ በር ነሽ`, 'lyrics':` የጽድቅ በር ነሽ የሙሴ ጽላት አክሊለ ሰማዕታት ምዕራገ ጸሎት የጌታዬ እናት ንጹህ አክሊላችን
 ሐመልማለ ሲና እመቤታችን * 2
 እመቤታችን የእኛ ምርኩዝ ነሽ እመቤታችን ከለላም ሆንሽን
 የእሳት ሙዳይ እሳት ታቀፍሽ
 በብርሃን ተከበሽ ወርቅ ለብሰሽ
 ከሴቶች ሁሉ አብ መረጠሽ እመቤታችን ድንግል ሆይ ልጆችሽ እመቤታችን ዘውትር ይጠሩሻል
 ስምሽን ለልጅ ልጅ ያሳስቡልሻል
 በተሰጠሽ ጸጋ ባማላጅነትሽ
 ምህረትን አሰጪን ከመሃሪው ልጅሽ እመቤታችን ያልታረሰች እርሻ እመቤታችን	ዘር ያልተዘራባት
 የህይወትን ፍሬ ሰጠችን የእኛ እናት
 የታረደው መሲ እናቱን ወደዳት
 በቀኙ ቆማለች ድንግል እመቤት ናት እመቤታችን የእውነት ደመና	እመቤታችን	ዝናብ የታየባት
 
 
 
 
 ወዳናለች ድንግል የታተመች ገነት
 ክብር ለሆነችው ኑ እንዘምርላት
 ደስ ይበልሽ እንበል የብርሃን እናት
 `},{ 'title' :`አለቴ ነህ አንባዬ`, 'lyrics':` አለቴ ነህ አንባዬ ጉልበቴ ነህ ጌታዬ * 2 በተከበበ ከተማ ከቶ አትጣለኝ ለብቻዬ * 2
 እንደ ወጣ ይቅር አትበለኝ በንስሀ ቤትህ ምልሰኝ በመቅደስህ ዓለት አቁመኝ ማዕበልና ንፋስ ሳይነቅለኝ
 የነገን አላውቅም እጣዬን በቤትህ ጸንቼ መኖሬን አላምነውምና ክፉ ልቤን ስፈራው እኖራለሁ የመጪውን
 አልመካም እኔ እፈራለሁ ወድቆ ስላየሁኝ የቆመው ሰው ባልተሰበረ ልብ በመኖሬ መቆሜን አላውቅም እስከዛሬ
 በወደቀው ጨክኜ ፈርጄ የደካማው በደል አለ በጄ
 ማንም ስላልሾመኝ ፈራጅ አድርጎ ልቤን መልስልኝ ወደ በጎ
 `},{ 'title' :`ኑ በእግዚአብሔር`, 'lyrics':` ኑ በእግዚአብሔር ደስ ይበለን * 2 ለታላቁ ክብር ለዚህ ላበቃን ከሞት ወደ ሕይወት ላሸጋገረን
 ኑ በእግዚአብሔር ኑ በድንግል ደስ ይበለን * 2 የሰማዩን መንግስት እርስቱን ለሰጠን ከጨለማ አውጥቶ ብርሃንን ላሳየን ለዚህ ድንቅ ውለታው ምስጋና ያንሰዋል በእርሱ ደስ ይበለን ክብር ይገባዋል
 ከአለት ላይ የፈለቀ ውሃ ጠጥተናል ሰማያዊ መና አምላክ መግቦናል ፍቅርህ የበዛልህ ምን ልክፈልህ ጌታ ስምህን ላመስግነው ከጠዋት እስከማታ
 
 
 
 
 በቃዴስ በረሃ ምንም በሌለበት በኤርትራ ባህር ወጀብ በበዛጀት
 ለእርሱ መንገድ አለው ከቶ ምን ተስኖት ልባችሁ አይፍራ በፍጹም እመኑት
 በባርነት ሳለን በድቅድቅ ዓለም ብርሃንን አገኘን በድንግል ማርያም ያጣነውን ሰላም ዛሬ አገኘን
 እጅግ ደስ ይበለን በእመቤታችን የሐና የእያቄም የእምነታቸው ፍሬ
 `},{ 'title' :`ሰላም ለኪ`, 'lyrics':` ሰላም ለኪ ለኖህ ሐመሩ ሰላም ለኪ የአሮን በትሩ
 የቅዱስ ዳዊት መሰንቆ መዝሙሩ ሰላም ለኪ የጌዴዎን ጾምሩ
 የሰለሞን መንበረ ክብሩ ሰላም ለኪ ፍሬ ስብሐት መዝሙሩ * 2 እመ እግዚአብሔር ጸባኦት ሰላም ለኪ * 2
 ሰላም ለኪ ሰረገላው ለአሚናዳብ ሰላም ለኪ መና ያለብሽ ንጹህ መሶብ ሰላም ለኪ ያዕቆብ ያየሽ በሎዛ ሰላም ለኪ
 የይስሐቅ መዓዛ * 2
 እንዘ ንሴብሖ ለበረከትኪ ዘምስለ አምሃ እሰግድ ለኪ * 2 ሰላም ለኪ ህብስተ መና ዘ እስራኤል ሰላም ለኪ የሰማዕታት ንጹህ አክሊል ሰላም ለኪ
 እጸ እጳጦስ ዘሲና ሰላም ለኪ
 የኤልያስ መና * 2
 እንዘ ንሴብሖ ለበረከትኪ ዘምስለ አምሃ እሰግድ ለኪ * 2
 `},{ 'title' :`ባክኛለሁና`, 'lyrics':` ባክኛለሁና በስጋ ፈተና
 የዚህ ዓለም ሀዘን ጫፍ የለውምና ፈጥነሽ ወደእኔ ነይ ከትንሿ ቤቴ አጽናኚኝ እመአምላክ ድንግል እመቤቴ
 ባህሩ ትልቅ ነው	ድንግል እመቤቴ
 ትንሽ ናት መርከቤ * 2
 የመንገዴ መሪ	
 አንቺ ነሽ ወደቤ * 2
 
 
 
 
 
 በመንገዴ ስዝል	ድንግል እመቤቴ	
 ዓለም ትስቃለች * 2
 መመኪያ እመቤቱ 
 ወዴት ነች እያለች * 2
 በቀቢጸ ተስፋ	ድንግል እመቤቴ	
 እንዳልወድቅብሽ * 2
 በቀንም በሌሊት 
 ተስፋዬ	አንቺ	ነሽ * 2
 የለም ያተረፍኩት ድንግል	እመቤቴ 
 ወጥቼ ወርጄ * 2	
 ትርፌ አንቺ ብቻ	ነሽ 
 ጽዮን አማላጄ * 2	
 `},{ 'title' :`አማኑኤል ተመስገን`, 'lyrics':` አማን በአማን * 2
 አማኑኤል ተመስገን * 2
 ለዚህ ፍቅርህ ምን ልክፈል * 2
 ድብቁን ሃጢያት አንተ ብትገልጠው ይቅር ብለኸኝ ባትሸፋፍነው እንደሰው በቀል ቢኖርህ ጌታ
 ለእኔ ሃጢያትስ የለውም ቦታ በየደቂቃው ሃጢያት ስሰራ
 ስሰርቅ ስበድል አንተን ሳልፈራ አንተ ግን ፊትህ ምንም ቢቀየም በቁጣህ በትር አልገረፍከኝም
 ምህረትህን ልከህ አድነኝ ዛሬ ታክቶኛልና በሃጢያት መኖሬ ዓለም በሃጢያት እየሳበችኝ በፍቅርህ በደስታ መኖር አቃተኝ
 የሃጢያት ጉዞ ጣፋጭ ቢመስልም ውጤቱ መሮ ፍጹም አይጥምም እንደ በደሌ ስላልከፈልከኝ ተመስገን እንጂ ሌላ ምን አለኝ
 
 
 
 
 
 
 
 
 `},{ 'title' :`አድርገህልኛልና`, 'lyrics':` አድርገህልኛልና በቸርነትህ አመሰግንሃለሁ እልል እልል ለዓለመ ዓለም አማኑኤል * 2
 እገዛልሃለሁ መድሃኒዓለም * 2
 ቀኑ ጨልሞብኝ ዙሪያው ገደል ሆኖ የችግር አረንቋ ፊቴ ተደቅኖ
 እረዳት ያጣሁኝ በመሰለኝ ጊዜ ፈጽሞ አራቅክልኝ የልቤን ትካዜ
 አምላኬ ጉልበቴ ሐይሌ መመኪያዬ ጠላት ማሳፈሪያ የእምነት ጋሻዬ እንደማትተወኝ አሁን አውቂአለሁ ካለኝ ነገር ይልቅ በአንተ ታምኛለሁ
 ጥቂቷን አብዝተህ ለምትመግብ ጌታ የምመልስልህ ባላገኝ ስጦታ
 በቀንም በሌትም ለሚያበራ
 መንክር ለባህሪይው እጹብ ለአንተ ስራ አምላክ ሆይ ምስጋና ለአንተ ይገባሃል
 ለትንሿ ጎጆ በረከት ሰጥተሃል
 `},{ 'title' :`ቅያሜው ይቅርና`, 'lyrics':` ቅያሜው ይቅርና አምላክ ሆይ ታረቀን አንተ ስለራከን ሞት ነው የከበበን * 2
 እስከመቼ ድረስ ህዝብህ ተጎሳቁሎ በረከሰ መንፈስ በርኩሰት ተጥሎ ምድር እያለቀሰች ደም እየሸተታት
 እባክህ አምላኬ ኢትዮጵያን ታረቃት /ሀገሬን/
 የዘመኑ ጣዖት ገንዘብ እያሳተን
 ይህ ደካማ ስጋ አምላክን አስተወን ግብዝነት ሞልቶት ፈራሹ አካል በነፍስ በሽታ ህዝባችን ታሟል * 2
 ክንፋችን ተመትቶ መብረር አቅቶናል በመንፈስ በሽታ ህዝባችን ታውኳል ራዕይ የሌለው ተራ ሰው ስለሆን
 እባክህ ጌታችን በፍትነት ታረቀን * 2
 ጸጋህ የተለየን ባዶነት የሞላን ፍቅር የተነፈግን ሰላም የጎደለን
 
 
 
 
 ሆነን ስለቀረን እግዚአብሔር ታረቀን ጽድቅን አድለን ጽድቅ እንደተመኘን * 2
 `},{ 'title' :`ሊረዳን መጣ`, 'lyrics':` ሊረዳን መጣ ኃያል ሚካኤል ይጠብቀናል ኃያል ሚካኤል
 የሙሴ ጠባቂ	ኃያል ሚካኤል መንገድ የመራኸው 
 የኤርትራን ባህር	
 ከፍለህ ያሻገርከው ክብርህ ከመላእክት	ኃያል ሚካኤል ከፍ ከፍ ያለ ነው 
 ታላቁ አለቃ	
 ከቶ እንዳንተ ማነው	
 ከሃጢያት በረሃ
 መጠለያ ሆነን ኃያል	ሚካኤል
 
 ጠላት በመንገድ
 እንዳያስፈራራን	ላይ 
 
 `},{ 'title' :`ቋንቋዬ ነሽ ድንግል`, 'lyrics':` ቋንቋዬ ነሽ ድንግል መግባቢያዬ መልስ የማገኝብሽ ከጌታዬ * 2 ባንቺ ቀርቤአለሁ ከአምላኬ ፊት
 ቤቴ ሞልቶልኛል በበረከት * 2
 በምን ስራዬ ነው በፊቱ የቆምኩት መቼ በቅቼ ነው ስሙን የጠራሁት አስታራቂ እናት አንቺን ስለሰጠኝ
 ስለ ቃል ኪዳንሽ አቤት ልጄ በይኝ * 2
 ቅድስና ሕይወት ከኔ ተሰውሮ በውሸት በሃሜት አንደበቴ ታስሮ
 በእመ አምላክ ፍቅር አዲስ ሰው ሆኛለሁ
 እንደ መላእክቱ ይኸው እዘምራለሁ * 2 ስለ እማምላክ ብሎ ያፈረ የለም ባንቺ ያልከበረ ሰው አይገኝም
 እንደ ባለማዕረግ እኔም ሰው መባሌ
 አንቺን አግኝቼ ነው ድንግል መሰላሌ * 2
 
 
 
 
 
 
 ሰላም ለኪ ብዬ ስጀምር ሰላምታን ሐሴት ይሞላዋል መላው ሰውነቴን እንደ ቅዱስ ኤፍሬም በምስጋናሽ ልጽና
 በእጆችሽ ያለው አምላኬ ነውና * 2
 `},{ 'title' :`ስለማይነገር ስጦታው`, 'lyrics':` ስለማይነገር ስጦታው እግዚአብሔር ይመስገን ቸል ያላለን አምላክ ስንጓዝ ማዕበሉን አቋርጠን ስለማይነገር ስጦታው እግዚአብሔር ይመስገን
 የሕይወት እስትንፋስ ዘራብን ህያው እንድንሆን ይህን ያደረገ አምላካችን እግዚአብሔር ይመስገን ስለማይነገር ስጦታው እግዚአብሔር ይመስገን
 ንፋስን ገልጾ ማዕበል አቁሞ የሚያሻግር የዓለም ፈተና ቢበዛ እርሱ መጠጊያችን ስለማይነገር ስጦታው እግዚአብሔር ይመስገን
 ዳግም እንዳንሞት በሞቱ ሞትን የረታልን የምንመካበት ትንሳኤን ሰላምን የሰጠን ስለማይነገር ስጦታው እግዚአብሔር ይመስገን
 ከሲኦል እስራት ተፈተን ነፃ የወጣንበት
 መስቀሉን ለሰጠን ለአምላካችን እንዘምር በእውነት ስለማይነገር ስጦታው እግዚአብሔር ይመስገን
 `},{ 'title' :`የአዋጅ ነጋሪት ቃል`, 'lyrics':` የአዋጅ ነጋሪት ቃል በበረሃ እያለ የእግዚአብሔር መንገድ አስተካክሉ እያለ ምስክርነቱን ዮሐንስ አስረዳ
 ልባችን ለጌታ መልካም መንገድ ይሁን የደናግል መመኪያ የነብያት ገዳም
 አውደ ዓመቱን ባርኪልኝ ድንግል ማርያም * 2
 ተራራው ዝቅ ይበል ጠማማውም ይቅና ካልተስተካከለ መንገድ የለምና የእግዚአብሔርን መንገድ እንመስርት ሁላችን ማረፊያ እንዲሆነን ለመጪው ሐብታችን
 ክፋትና ተንኮል ከልባችን ይጥፋ ጽድቅና ርህራሄ በእኛ ላይ ይስፋፋ ስጋና ደምህን በክብር አግኝተናል
 
 
 
 
 ሕይወት እንደሆነን አምላክ ተማጽነናል ሁለት ልብሶች ያሉት ከማብዛት ልብሱን ለሌለው ያድለው ሁለተኛውን
 ከበደላችንም አንጻን አደራህን በክፉ እንዳንጠፋ እኛ ልጆችህ
 `},{ 'title' :`ውዳሴ ማርያም`, 'lyrics':` ውዳሴ ማርያም እጮሃለሁ ድንግል እናቴን እጣራለሁ
 እንደ አባ ኤፍሬም ነይ ባርኪኝ ወድሰኒ ልጄ በይኝ
 ውዳሴ ማርያም በሰርክ ጸሎት ላይ ውዳሴ ማርያም ዜማ ስናደርስ
 ድንግል ትመጣለች በቤተ መቅደስ
 የብርሃን ምንጣፍ ከፊቷ ተነጥፏል
 ቅዱስ ኤፍሬም ታጥቆ ያመሰግናታል ውዳሴ ማርያም አባ ህርያቆስ	ውዳሴ ማርያም ምስጋና ያደርሳል
 የቅዳሴው ዜማ ልብን ይመስጣል
 በጎ ነገር ልቤ አወጣ አያለ
 ዳዊት በገናውን እየደረደረ ውዳሴ ማርያም የንጽህናችን	ውዳሴ ማርያም መሰረት ነሽና
 አንቺን ለማመስገን ልቦናዬ ይጽና
 ተፈስሒ ድንግል ኦ ቤተልሔም
 ካንቺ ተወለደ መድሃኒዓለም ውዳሴ ማርያም ቅድሳት ሁሉ ውዳሴ ማርያም ዙሪያስን ከበዋል
 አባ ጊዮርጊስም ንኢ ድንግል ይላል
 በወርቅ ዙፋን ላይ ተቀምጠሽ ሳይሽ
 ልቤ ተሰወረ ድንግል በግርማሽ
 `},{ 'title' :`አምላክ ተክለ ሀይማኖት`, 'lyrics':` አምላከ ተክለሀይማኖት ማረን ( )
 አምላከ ቅዱሳን ታረቀን ( )
 ስለ ቃል ኪዳንህ በቁጣህ አታጥፋን ሃዋርያው ቅዱስ ተክለ ሀይማኖት የእቲሳ አንበሳ የእኔ አባት
 ቁጣውን አብርደው ተክለሀይማኖት በምልጃ ተነሳ የኔ አባት
 ቁጣውን አብርደው ተክለሀይማኖት
 
 
 
 
 ቤተሰብ ሆነሃል የእኔ አባት ከሰማይ ካህናት ተክለሀይማኖት ቤተሰብ ሆነሃል የእኔ አባት
 የስላሴን መንበር ተክለሃይማኖት ለማጠን በቅተሃል የእኔ አባት ከከርቤ ከሚአ ተክልሀይማኖት ከሰሊክም በልጧል የእኔ አባት
 የጻድቁ ጸሎት ተክልሀይማኖት በእግዚአብሔር ፊት ሸቷል ስለቃልኪዳንህ ተክለሃይማኖት አምላክ ይለመናል የእኔ አባት
 ጸሎት ሲደርስ ተክለሀይማኖት እኛን ይታረቃል የእኔ አባት ተማጽነንብሃል ተክለ ሃይማኖት ጌታ ሆይ በስሙ የእኔ አባት
 በጻድቁ ጸሎት ተክለሀይማኖት በሰባራ አጽሙ የእኔ አባት ኢትዮጵያን በሙሉ ተክለሃይማኖት አስተምሮ ሲመለስ የእኔ አባት
 አጽመ ርስቱ ሆነቸህ ተክለሀይማኖት ደብረ ሊባኖስ የእኔ አባት
 የጸድቁ መንፈስ ተክለሀይማኖት ከቅዱሳን ጋራ የእኔ አባት
 ከልባችን ገብተህ ተክለሀይማኖት ብርሀንን አበራ የእኔ አባት በጸሎት ስቁም ተክለሀይማኖት ስምህን ስጠራ የእኔ አባት
 ነፍሴ ተደሰተች ተክለሀይማኖት ሲርቀኝ መከራ የእኔ አባት
 `},{ 'title' :`እባክህ ወዴት ነህ`, 'lyrics':` ለመዳኑ ህይወት ለጽድቁ ጠርቼህ ከዓለም ለይቼ በፍቅሬ መርጬህ በረከትና ፍቅር ሰላሜን ወርውረህ ልጁ የምወድህ እባክህ ወዴት ነህ
 ይልሃል እግዚአብሔር እባክህ ወዴት ነህ ከዓለም ጉያ ውስጥ ሽብር ከተሞላው ከስንጥቅ አለቶች ጎድጓዳ ከሆነው የአራዊቱ ግርማ የአንበሶቹ ግሳት የጨለማው ክብደት የፍጥረት ማዛጋት
 
 
 
 
 ከእንዲህ ያለ ስፍራ ተወርውረህ ነወይ ቀናት ተቆጠሩ አይኖችህን ሳላይ * 2
 ከቅዳሴ የወጣ ምስጋና ስቀበል ጎላ ያለው ድምጽህ ተሰውሮብኛል
 በቅድስቱ በኩል በምትቆምበት በቅዳሴ ጊዜ
 አይኖቼ ስላጡ ፈልገው ፈልገው ይዞኛል ትካዜ * 2 ልጄ ምን በደልኩህ ምን አጎደልኩብህ ትተኸኝ የሄድከው እንደዛ ስወድህ
 ዘወትር ፊትህን ሳየው ደስ እያለኝ
 ደስታዬን በሀዘን ምነው ለወጥክብኝ * 2
 `},{ 'title' :`ግሩም ድንቅ ነህ`, 'lyrics':` ግሩም ድንቅ ነህ አምላኬ ግሩም ድንቅ ነህ ግሩም ድንቅ ነህ ጌታዬ ግሩም ድንቅ ነህ ሰው የጣለውን ከምድር ከፍ ታደርጋለህ የተረሳውን አምላኬ ታስታውሳለህ
 ከቤተሳይዳ ያነሳል በአልጋ ያለውን መተመቅ ሽቶ ረዳት ወገን ያጣውን ከሃጢያተኛ ጋር ይገባል እራት ሊበላ በቀል አያውቅም ጌታዬ ከፍቅር ሌላ
 እንደ አምላካችን ማንም የለም * 2 እንደ እግዝአብሔር ማንም የለም * 2 እንደ ፈጣሪ ማንም የለም * 2
 እንደ አማኑኤል ማንም የለም * 2
 `},{ 'title' :`እኔስ በምግባሬ`, 'lyrics':` እኔስ በምግባሬ ደካማ ሆኛለሁ * 2
 እዘኝልኝ ድንግል እለምንሻለሁ * 2
 ያንን የእሳት ባህር እንዳላይ አደራ
 ድረሽልኝ ድንግል ስምሽን ስጠራ * 2
 የዳዊት መሰንቆ የእስራኤል መና
 የናሆም መድሃኒት ንኢ በደመና * 2
 አንቺ ነሽ ጉልበቴ በደከመኝ ጊዜ
 የልቤ መጽናኛ እረዳት ምርኩዜ * 2
 
 
 
 
 አፈሳለሁ እንባ በጣም ተጨንቄ እማጸንሻለሁ በደሌን አውቄ * 2
 `},{ 'title' :`የሐሰት ዳኝነት`, 'lyrics':` እውነት ስለሆን እየሱስ ክርስቶስ ዋለ በአደባባይ ሲሰደብ ሲከሰስ የሐሰት ዳኝነት አምላክን ወቀሰው
 ሕይወት ሰጠን እንጂ ጥፋቱ ምንድን ነው ከቃሉ እብለትን ባያገኙበትም ዝምታውን አይተው አላዘኑለትም ባላወቁት መጠን ጠሉት ካለ በደል
 ጥፋቱ ምን ይሆን የሚያደርስ ከመስቀል * 2
 የልቡን ትህትና ፍቅሩን ሳያስተውሉ ቸሩ ጌታችንን አቻኩለው ሰቀሉት እሩህሩሁን ጌታ አቻኩለው ገደሉት
 ሞትን አስወጎዶ ቢሰጣቸው ህይወት * 2 ስለቸርለቱ ስድብን ከፈሉት ስለርህራሄው የእሾህ አክሊል ሰጡት ሐሞትና ከርቤ ሆምጣጤ ደባልቀው
 መራራ አስጎነጩት ጨክኖ ልባቸው * 2
 ፈውስን ለሰጣቸው ልባቸውን ሞልተው አሉት ወንበዴ ነው ስቀለው ስቀለው ከእጁ በረከትን የተሻሙ ሁሉ
 ይጮኹ ነበር ይገደል እያሉ * 2
 `},{ 'title' :`ኑ በብርሃኑ ተመላለሱ`, 'lyrics':` ኑ በብርሃኑ ተመላለሱ * 3
 የፍቅርን ሕይወት እንድትለብሱ * 2 ሁሉን በሚችል በአምላክ ጥላ በእረፍት ውሃ ስር አርፈናልና ሰላምና ፍቅር ህይወት በሚሰጥ ወደ ጌታችን እንሂድ እንሩጥ
 ምህረትና ፍርድ በእጁ የያዘው የሰላም አባት ወድሃኒዓለም ነው ህይወት የሆነን በመስቀል ውሎ ብርሃን ሰጠን ጨለማን ሽሮ
 
 
 
 
 የሚያስደነግጥ የሚያስጨንቀን ይጠፋልና እርሱን ተማጽነን በቀን ከሚበር ፍላጻ ሁሉ ይታደገናል በቅዱስ ቃሉ
 እግርህ በድንጋይ እንዳይመታ በፈተና ውስጥ እንድትበረታ መቅሰፍት ከቤትህ እንዲከለከል ይጠብቅሃል ሌሊትና ቀን
 ስሙን ያወቀ ህይወት መሆኑን ይመላለሳል ከሃይል ወደ ሃይል ረጅም እድሜ ይጠግባል እርሱ ብርሃን ይሆናል የጸጋ ልብሱ
 አቤቱ አንተ ተስፋ ነህና የምትመግብ የፍቅር መና ማዳንህ እኛን አስደስቶናል እንዲህ ያለ ክብር ከየት ይገኛል
 `},{ 'title' :`እግዚአብሔር ሆይ እርዳኝ`, 'lyrics':` እግዚአብሔር ሆይ እርዳኝ ቸርነት አድርገህ * 2 እድሜ ለንስሐ እንደ ህዝቅያስ ሰጥተህ ጠማማውን ልቤን በቃልህ አቃንተህ
 አላውቀውም ብሎ ሲጠየቅ ያመጸው
 ዶሮ እስኪጮህ ድረስ ሶስት ጊዜ የካደው የጅረት ወንዝ ነው የሰጠኸው እንባ ጴጥሮስ ተጸጽቶ ንስሐ እንዲገባ
 ጽዋው እንዳይደርሰኝ የይሁዳ እድል ልጅህ ሆኖ ውሎ ኃላ መኮብለል ጴጥሮስ እድለኛው አልቅሶ ተማረ በትዕቢቱ ይሁዳ እንደወጣ ቀረ
 ዘመኗን በሙሉ በዝሙት አቃጥላ በንስሐ ጠራት ጌታ በገሊላ ታድሳ ተነሳች በእንባዋ ብዛት
 እግሩ ስር ተደፍታ ማርያም መግደላዊት አመጸኛው ልቤ ዛሬስ መቼ ይተኛል
 በሃጢያት በዝሙት በስርቆት ይዋኛል ወደ ቀድሞ ግብሩ እንዳይመለስ ፍቅርህ በእኔ ሰርጾ ሃጢያቴን ደምስስ
 በደላችን ሁሉ ሳታስብ ትተህ በምጽአትህ ሰዓት ከጻድቃን ቆጥረህ
 
 
 
 
 ነጭ ልብስን ለብሰን ሆነን ካንተ ጋራ በሩ ሳይዘጋ አስገባን አደራ
 `},{ 'title' :`በሀዘኔ`, 'lyrics':` በሀዘኔ በጭንቀቴ መጽናኛዬ ነሽ ረዳቴ እመአምላክ አደራ ድንግል እመቤቴ * 2
 ለዓለም ተዘርግቶ እጄ ባዶ ሆኗል የራሴ ላይ አክሊል ተሽቀንጥሮ ወድቋል ከኤልዛቤል ሸሽቼ መጣሁኝ ወደ አንቺ የጎሰቆልኩትን እኔን ተመልከቺ
 የእግሬ መሰናክል ለዓለም ደስታ ነው ተስፋ ቢስ መሆኔ ለጠላቴ ድል ነው የደስታ መመንጫ የኤልሳቤጥ ዘመድ እንዳልሰናከል ምሪኝ በመንገድ
 ምድር ትለኛለች ተስፋ ቢስ ብቸኛ ሳለቅስ ሳነባ አይታኛለችና ከቤተመቅደሱ ለእኔስ ዘመድ አለኝ በሀዘኔ ሰዓት አይዞህ የምትለኝ
 ከአመድ የወደቀ ትንሽ ገንዘብ አለሽ ልብሽ እራርቶልኝ ፈልጊኝ አጥብቀሽ እምነቴ እንዳይደክም እንዳልጠፋ ልጅሽ አድጊያለሁና ከደጀ ሰላምሽ
 `},{ 'title' :`እርዳኝ ዝም አትበል`, 'lyrics':` እርዳኝ ዝም አትበል የሰራዊት ጌታ ተስፋ እንደሌለው ሰው ልቤ አያመንታ አንተን ለማመስገን የነበረኝ ብርታት ዛሬስ ተስኖኛል አቅቶኛል መትጋት
 ጨንቆኝ እጣራለሁ ጸጋ አጣ ህይወቴ እባክህ አርመኝ እርዳኝ መድሃኒቴ ልቤ ድንጋይ ሆኖ ቃልህ አልሰበረው የእጅህን ስራ ጌታዬ አስተካክለው
 የክርስትና ኑሮ ስርዓቱን አፍርሼ አለቅሳለሁ ጌታ በሃጢያት ተከስሼ ሰላምና ፍቅር ነበር ክርስትና
 እኔ ግን ተናወጽኩ አልጸናሁም ገና ስራዬና ቃልህ አልገናኝ አሉኝ
 በጠማማው ልቤ አንተን አሳዘንኩኝ ጽኑ መሰረት ነው የህይወት አለት እየተናወጽኩኝ አቃተኝ መጽናት
 በእረፍት ውሃ ዘንድ በለመለመው ሳር በጎችህን ሁሉ በፍቅር የምታኖር በህይወቴ እንዲታይ የቸርነትህ ክብር ከደጅህ ተጥዬ ለስምህ ልዘምር
 `},{ 'title' :`የስሙ ትርጓሜ`, 'lyrics':` የስሙ ትርጓሜ ማን እንደ እግዚአብሔር ነው የሰውን ወደ አምላክ የአምላክን ወደ ሰው እኛን የሚረዳን ዘወትር በምልጃው
 የመላዕክት አለቃ ቅዱስ ሚካኤል ነው
 
 
 
 
 
 ከጉድጓድ ተጥሎ ፍጹም ከሚያስፈራው ከተራቡ አናብስት ዳንኤልን ያዳንከው እኛንም ተራዳን ቸል አትበለን
 ሰይጣን በተንኮሉ ወጥመድ ሳይጥለን የክፉ ሰው ስራው ክፉ ሐሳብ ነውና
 በቅንነት መንገድ ከቶ አይሄድምና የሞቱን ደብዳቤ ለባህራን ሲሰጠው ሚካኤል አጥፍቶ በደስታ ለወጠው
 ገና ብላቴና ሳለሁ አንድ ፍሬ
 ሰው ሁሉ ሲንቀኝ ምስጋናን ጀምሬ ጸጋዬን አብዝቶ ያበቃኝ ለዚህ ክብር የሚካኤል አምላክ ይመስገን እግዚአብሔር
 `},{ 'title' :`ድንግል እመቤቴ`, 'lyrics':` ድንግል እመቤቴ የህይወቴ ረዳት የኑሮዬ ጣዕም ዋልታ መሰረት እለምንሻለሁ * 2 ፍጹም በረከት
 ትህትናሽ ሲታሰብ ድንግል እመቤቴ በሰዎች ልቦና ድንግል እመቤቴ
 ግርምትን ይፈጥራል * 2 ልብ ይመስጥና ጽዮን መጠጊያ ነሽ ድንግል እመቤቴ
 የአብርሃም ድንኳን ድንግል እመቤቴ
 የታጠረች ተክል * 2 እመብዙሃን ከሚካኤል ጋራ ድንግል እመቤቴ ፈጥነሽ ድረሽልኝ ድንግል እመቤቴ
 ቅዱስ ገብርኤል ይምጣ * 2 ክብርሽን ያብስረን ከድንግል ጋር ሆነህ ድንግል እመቤቴ
 ኡራኤል ፈጥነህ ና ድንግል እመቤቴ
 ሩፋኤል ራጉኤል * 2 ንኡ በደመና በደማችን ሰርጿል ድንግል እመቤቴ ፍቅርዋ የማርያም ድንግል እመቤቴ
 ምስክር ነን እኛ * 2 እስከ ዘለዓለም በአባቶች ፋንታ ድንግል እመቤቴ
 ልጆችሽ ስላለን ድንግል እመቤቴ
 ስምሽን ለልጅ ልጅ * 2 እንዘክራለን
 
 
 
 
 
 
 `},{ 'title' :`አልተወኝም ጌታ`, 'lyrics':` አልተወኝም ጌታ ለካስ ይወደኛል * 2 ዛሬም ስበድለው ልጄ ነሽ ይለኛል ዛሬም ስበድለው ልጄ ነህ ይለኛል
 በበደል ጉራንጉር በሃጢያት ጫካ ብጠፋበት እንኳን አልተወኝም ለካ
 ዛሬም ልጄ ብሎ ዳግም ይጠራኛል * 2
 ለካስ አልጠላኝም ጌታ ይወደኛል * 2
 ለስልጣን ለክብሬ ብዬ ስክደው ለገንዘብ አድልቼ እኔ ስረሳው
 ለእኔ ያለው ፍቅር አልቀነሰብኝም * 2
 ዛሬም ይወደኛል ጌታ አልጠላኝም * 2 ታዲያ ለዚህ ፍቅሩ ለሌለው ወሰን ከጭንጫ መቃብር ላወጣኝ እኔን
 በህይወቴ ሁሉ ፍጽም ለመራኝ * 2
 ክብርና ምስጋና አቀርባለሁኝ * 2
 `},{ 'title' :`ኪዳነ ምህረት`, 'lyrics':` ኪዳነ ምህረት እመቤት * 2
 ነይልን * 2 ካለንበት
 ከሰማያት በላይ ካለው ከማደሪያሽ * 2
 ዝማሬን ከሞላው ከዘላለም ቤትሽ
 የምድር ፍጥረታት ማርያም ማርያም ሲሉሽ * 2
 የቃል እናት እመቤቴ ነይ በሰረገላሽ * 2
 ወልዳ ያሳደገች አዝላ የተሰደደች የጌታችን እናት ድንግል ተንከራታለች
 ከእግረ መስቀሉ ከዙፋኑ ከቀኝ ቆማለች * 2
 ትላንት ዛሬም ነገም ማርልኝ እያለች * 2
 `},{ 'title' :`ጽረ አርያም`, 'lyrics':` ጽረ አርያም ጽረ አርያም * 2
 ክብርሽ ገናና ነው ለዘላለም
 
 
 
 
 
 በመላዕክት ዓለም በሶስቱ ከተማ በኤረር በኢዮር እንዲሁም በራማ ውዳሴ ቀረበ ለሰማይ ንግስት የአምላክን እናት በክብር አየናት
 በበረሃ ያሉ ዓለምን የናቁ ውዳሴሽን ደግመው ስምሽን የሰነቁ አንቺን ስንጠራ ተላት ገለል ይላል
 ማርያም በግርማሽ ከሳሻችን ያፍራል
 ከእግሮቿ በታች ጨረቃን ተጫምታ የክብርን አክሊል በራሶቿ ላይ ደፍታ በቅዱሳን ሁሉ ትመሰገናለች
 ዓለም የዳነባት ድንግል ማርያም ነች ብርሃንን ለብሳ በንጽህና አጊጣ
 ፍጥረትን ስትባርክ በክብር ተገልጣ ነፍሳት ተቀደሱ በእምነት ከበዋት ከበሮን አንስተን እንዘምርላት`},{
 },{ 'title':`የጥበብ ሰዎች መጡ`, 'lyrics':` ሰማይና መሬት የማይወስኑት ተወስኖ አየነው በጠባብ ደረት ዘጠና ዘጠኙን መላዕክትን ትቶ አገኘነው ዛሬ በበረት ተኝቶ
 የጥበብ ሰዎች መጡ * 2 ሰምተውት በዜና እያበራላቸው ኮከብ እንደፋና * 2
 ድንግል እመቤቴ ሰላምታ ይድረስሽ ለአምላክ ወገኖች መመኪያ የሆንሽ ካንቺ ተወሰደ የዓለም መድህን ኩነኔን አጥፍቶ ጽድቅን ሊያወርሰን
 ጌታችን ሲወለድ በቤተልሔም ሀዘን ተደምስሶ ሰፈነ ሰላም እንጨቶች አፈሩ ፍሬ በረከት ወንዞች ሁሉ ሆኑ ማርና ወተት
 ሰብአሰገል መጡ ሊሰግዱ በሙሉ የእስራኤል ንጉስ ወዴት ነው እያሉ እጅ መንሻውን ሰጡት እንደየስርዓቱ እጣኑን ለክህነት ወርቁን ለመንግስቱ
 
 
 
 
 
 
 
 `},{ 'title' :`ሳር ቅጠሉ ሰርዶ`, 'lyrics':` ሳር ቅጠሉ ሰርዶ ሰንበሌጥ ቄጤማው በዚያች ቀን በዚያች ወር ለምለም የነበረው በእልልታ ዘመሩ በደስታ ተሞልተው
 ጌታ መወለዱን የምስራች ሰምተው
 እልል በዬ ቤቴልሔም ሃሌ ሃሌ ሉያ * 2
 የፍቅር የሰላም ነሽና ገበያ * 2
 ያ ትሁት እረኛ የትህትና አባት ብርሃን ለበሰ በእኩለ ሌሊት
 ጥሪ ተደርጎለት ከሰማይ መላዕክት ለመመልከት በቃ የጌታውን ልደት
 እረኝነት ትንሽ የወረደ ግብር ብሎ ሰው በግምት ደንግጎ ነበር የብዙ ስው ራስ መሆኑን እረኛ ክርስቶስ ሲወለድ ተረዳነው እኛ
 የተነበዩለት ነብያት በሙሉ ጌታ ተወለደ የምስራች በሉ
 ሰውን በመውደዱ ሰማያዊው ንጉስ ይኸው ተወለደ እኛን ለመቀደስ
 `},{ 'title' :`ተወለደ`, 'lyrics':` ተወለደ ጌታ ተወለደ * 2
 ተወለደ አምላክ ተወለደ * 2
 አንዲት ብላቴና የ ዓመት ልጅ ጌታን ወለደችው በመላዕክት አዋጅ ፍጹም ድንግልና ተወለደ ጌታ ዓለምን የሚያድን የሰዎች አለኝታ
 ይህ ዓለም በቃሉ ከተፈጠረበት ይበልጣል ልደቱ አምላክ ሰው የሆነበት እንደምን ይገርማል ይሄ ተዋህዶ
 አየነው አምላክን እንደሰው ተወልዶ
 ፍጹም ድንግልና ክብር የተሞላች እንደምን አምላክን በማህፀን ያዘች ዓለምን በቃሉ የፈጠረ ጌታ ወለደችው ድንግል የሔዋን አለኝታ
 አንቺ ብላቴና እናታችን ማርያም በምድር ተፈልጎ እንዳንቺ አልተገኘም
 
 
 
 
 በሀሳብ በግብር ንጹህ ስለሆነች የአምላክ ማደሪያ ድንግል ተመረጠች
 `},{ 'title' :`ግነዩ ለእግዚአብሔር`, 'lyrics':` ግነዩ ለእግዚአብሔር እስመ ሔር
 እስመ ለዓለም ምህረቱ እስመ ለዓለም * 2 እናመስግንሽ የአምላክ እናት በዝማሬ የዓለም ቤዛ ነውና የማህፀንሽ ፍሬ * 2
 በድንግልና የወለድሽው የአንቺ ጽንስ
 ለድኩማኖች ብርታት ነው ለህሙማን ፈውስ * 2 ከሰማየ ሰማያት ወርዶ ከአንቺ ተወልዶ መለኮት ወረደ ዮርዳኖስ እኛን ለመቀደስ * 2
 በዮሐንስ እጅ ተጠመቀ እዳችንን ፋቀ
 በቸርነቱ አወቀን ከበደል አራቀን * 2
 ብርሃነ መለኮት ያደረብሽ አዳራሽ
 ቅድስተ ቅዱሳን ማርያም ድንግል አንቺ ነሽ * 2
 ስምሽን የጠራ ዝክርሽንም ያዘከረ
 በመንግስተ ሰማይ ይኖራል እንደተከበረ * 2 እመቤታችን እናታችን ማርያም የተማጸነሽ ይኖራል ለዘለዓለም * 2
 `},{ 'title' :`እግዚአብሔርን ጠራሁት`, 'lyrics':` እግዚአብሔርን ጠራሁት በሀዘኔ ጊዜ እግዚአብሔርን ጠራሁት በጭንቀቴ ጊዜ አወጣኝ ከጭንቀት ከሀዘን ከትካዜ * 2
 የልመናዬን ድምጽ እርሱ ሰምቷልና ጆሮውን ወደ እኔ አዘንብሏልና
 በዘመኔ ሁሉ ስጠራው እኖራለሁ * 2
 ጎስቋላ ብሆንም ምስጋና አቀርባለሁ * 2
 እንደ ቃልህ መጓዝ መራመድ አቅቶኝ የሃጢያቱ መንገድ ማዕበሉ ገፍቶኝ
 ወደ እርሱ ስማጸን ደግሞ ስፀፀት * 2
 አላሳፈረኝም መጣ በምህረት * 2
 ኖህን እንዳዳንከው እኛንም አድነን ከቀስቱ እንድናመልጥ ምልክትን ስጠን
 
 
 
 
 በትርህ ምርኩዝህ እነርሱ ያጽናኑኝ * 2
 አንተ ከኔ ጋር ነህ አልፈራም ክፉውን * 2
 በበዛ ምህረቱ ያለፈውን ትቶ በፍቅሩ ጎበኘኝ አልተወኝም ከቶ
 ሊቀበለኝ ወዶ ፊቱን አበራልኝ * 2
 ማን ይቃወመኛል እግዚአብሔር ካለልኝ * 2
 `},{ 'title' :`ሐይልን በሚሰጠኝ`, 'lyrics':` ሐይልን በሚሰጠኝ በክርስቶስ ሁሉን እችላለሁ * 2
 መከራም ቢገጥመኝ ለበጎ ነው ብዬ አልፋለሁ * 2 በሰንሰለት አስረው በወህኒ ቢጥሉኝ መከራን አብዝተው እጅግ ቢያስጨንቁኝ ለበጎ ነው ብዬ ተስፋ አድርጌሃለሁ
 ይሁን አንተ ያልከው እገዛልሃለሁ ትናንትናም ዛሬም አንተ ያው አንተ ነህ ፍቅርህ እይቀየር ወረትም የለብህ
 ስምህን መጥራቴ ሞገስ ሆኖልኛል ጠላቴ ቢፎክር መቼ ያሸንፈኛል
 በመከራው ጽናት ጉልበቴ ደከመ ትካዜ ከቦኛል ተስፋዬም ጨለመ
 ነገር ቢሆን ባይሆን አንተን እንዳከብር አደለኝ በጸጋህ ጌታ ያንተን ፍቅር
 ከሀገር ወጥቼ በዱር መሰደዴ ከባዕዳን ሀገር እርቄ መሄዴ ለበጎ ነውና መቼ ይከፋኛል
 ፈጽሞ እንዳልጠፋም ክንድህ ይይዘኛል
 `},{ 'title' :`እናመስግነው`, 'lyrics':` እናመስግነው እናመስግነው * 2
 አምላካችን ውለታው ብዙ ነው * 2 ከሃጢያት ገደል ከሞት ቤት ጎትቶ መንግስቱን የሰጠን ከሲኦል አውጥቶ ዘላለማዊ ቤት ታላቅ ሀብት ያደለን
 መቼም የማይተወን ታላቅ አባት አለን ፍጡራን ቢንቁኝ መጎስቆሌን አይተው
 ወዳጆች ቢሸሹኝ ተስፋ ቢስ ነው ብለው
 
 
 
 
 እውነተኛ ረዳት አምላኬ መች ተወኝ ሁለት እጄን ይዞ ልጄ ተነስ አለኝ
 ሞታችንን ሞቶ ህይወቱን ላደለን ለቸሩ ክርስቶስ ምን እንከፍለዋለን ለታላቅ ውለታ ጌታ ለዋለልን በእልልታ እንቀኝ በአንድነት ሆነን
 `},{ 'title' :`እንደ እግዚአብሔር ያለ`, 'lyrics':` እንደ እግዚአብሔር ያለ ማንም የለምና * 2
 እልል በሉ ቁሙ ለምስጋና * 2
 ባህር ተከፈለ እስኪታይ መሬቱ ፈርኦን ወደቀ አልሰራም ትምክህቱ ደካሞቹም ጸንተው ተራመዱ ሐይለኞችም ይኸው ተዋረዱ
 የኢያሪኮ ቅጥር የማይደፈረው
 ይኸው ፈራረሰ የሰው እጅ ሳይነካው ሐይለኞቹም ቢበረታቱብን
 እንጸናለን በእርሱ ተደግፈን
 የተወረወረው የጠላታችን ጦር
 ሜዳ ላይ ወደቀ ጋሻ ሆኖ እግዚአብሔር ለስላሴ ይድረስ ምስጋናችን
 ተሸነፈ አዳኝ ጠላታችን
 ባህር ላይ ሲራመድ ሞገስ አለው እርሱ በግርማው ሲነሳ ጸጥ ይላል ነፋሱ የድንግል ልጅ እኛ የምናመልከው ከሐሊ ነው የለም የሚሳነው
 `},{ 'title' :`በሀዘኔ ደራሽ ነሽ`, 'lyrics':` በሀዘኔ ደራሽ ነሽ በጭንቀቴ በችግሬም ደራሽ ነሽ የአምላኬ እናት የጌታዬ እናት
 ድንግል እመቤቴ ወላዲተ ቃል * 2
 መልካሚቱ ርግብ	ድንግል እመቤቴ ማርያም እናቴ ነሽ 
 ከፍጥረታት ሁሉ	
 ገናና ነው ክብርሽ	
 
 
 
 
 
 የሀዘኔ መጽናኛ
 እንባዬን አባሽ	ነሽ 
 
 ዋሻ መጠለያ
 የዘላለም ቤቴ
 መንገድ ስሄድ ስንቄ	ድንግል	እመቤቴ
 
 
 መጠጤ ነሽ ምግቤ እመ አምላክ ስጠራሽ
 ይጠፋል እርሃቤ	
 
 
 የእናትነትሽን ፍቅርሽን አየሁት
 ጎጆዬን ስትሞይው	ድንግል	እመቤቴ
 
 
 ባዶ የሆነውን አንቺ እያለሽልኝ ምን እሆናለሁኝ 
 
 `},{ 'title' :`በበጎ ፍቃዱ 
 በበጎ ፍቃዱ ሁሉ በእር`, 'lyrics':`ሱ ሆነ * 2	
 ነገር ሁሉ በእርሱ ተከናወነ * 2
 ሰማይና ምድር ግብሩን ተናገሩ ፈጥሮአቸዋልና እንዲገለጥ ክብሩ በፈጠረው ፍጥረት የሚታወቅ እርሱ እግዚአብሔር ይመስገን ስሙን አወድሱ
 አልሆነም ያለ እርሱ ፍጹም አንዳች ነገር ብንመረምረው በሰማይ በምድር
 ፈቃዱ ነውና መልካምና በጎ
 ፈጥሮ አሳይቶናል ሁሉን ውብ አድርጎ ክረምትና በጋ ሌሊትና ቀን ሁሉን አሳይቶ ጌታ አስተማረን
 ያደደረገው ሁሉ እንከን	የሌለው ለዚህ ቅዱስ አምላክ ምሳሌም የለው
 ያዘነውን ያውቃል ደስም ያለውን ሁሉ በእርሱ ፈቃድ ስለሚከወን ችግርና ደስታ ለበጎ ነውና
 ይህን ያስተማረን ይድረሰው ምስጋና
 
 
 
 
 
 
 
 
 
 `},{ 'title' :`አንደበቴም ያውጣ`, 'lyrics':` አንደበቴም ያውጣ የምስጋናን ቅኔ የአምላኬን ማዳን አይቻለሁ በዓይኔ በገባኦን ሰማይ ፀሐይን ይቆመ ዛሬም ጎብኝቶኛል እየደጋገመ
 ወጥመድ ተሰበረ እኔም አመለጥኩኝ ከሃጢያት ፍላፃ ከሞት አተረፈኝ የአናብስቱን አፍ በሐይሉ የዘጋ የዳንኤል አምላክ ይኖራል ከእኔ ጋር
 በዳዊት ምስጋና በያሬድ ዝማሬ ከቅዱሳኑ ጋር ልዘምር አብሬ
 እርሱን ሳመሰግን ሜልኮል ብትስቅብኝ ለጌታዬ ክብር እዘምራለሁኝ
 አስፈሪው ነበልባል እሳቱ ቢነድም
 ለጣኦት እንድንሰግድ ነገስታት ቢያውጁም ሁሉ ቢተወኝም ቢጠላኝም ዓለም
 ጽናት ይሆነኛል ጌታ መድሃኒዓለም
 `},{ 'title' :`እልል በሉ`, 'lyrics':` እልል በሉ በአንድነት ዘምሩ አመስግኑ ለክብሩም ዘምሩለት
 እንደ እግዚአብሔር ያለ ማንም የለም በሉ በሃጢአት ባርነት ስንኖር ተገዝተን ከቤቱ ስንርቅ ትዕዛዙን አፍርሰን አይቶ ዝም ላለን ጠላቶቹ ሳለን
 ውለታው ግሩም ነው ክብር ለእርሱ ይሁን * 2
 ራሱን አዋርዶ እኛን አከበረን ስጋውና ደሙን ብሉ ጠጡ አለን
 መልካም እረኛ ነው የሚያሳጣን የለም
 ምስጋና ይድረሰው ለመድሃኒዓለም * 2 ሕይወቱን የሰዋ እንደ አምላክ ማን አለ ለሰው ልጆች ብሎ በመስቀል የዋለ ፍቅሩ የማይለካ አያልቅም ቢወራ
 ከሰማያት ወርዶ ሆነ ከእኛ ጋራ * 2
 ስራውን እናድንቅ እንዲህ ለወደደን ከማያልቀው ፍቅሩ በረከት ላደለን
 
 
 
 
 
 
 ለማይነገረው ለአምላክ ስጦታ
 ውዳሴን እናቅርብ እንዘምር በእልልታ * 2
 `},{ 'title' :`እግዚአብሔር መልካም ነው`, 'lyrics':` እግዚአብሔር መልካም ነው * 2
 በመከራ ቀንም መሸሸጊያ ነው * 2
 ከገነት ሲሰደድ አዳም አባታችን ሞት ነግሶብን ሳለ በእኛ በሁላችን ቃል እንደገባለት ተወልዶ ሊያድነው
 በመከራው ጊዜ ወሸሸጊያ ሆነው * 2
 አብርሃም ከካራን ከእናት ከአባቱ ቤት ከነዓን ሲገባ ሲሰደድ በእምነት ከተሰጠው ተስፋ አንዳች ሳይጎድልበት
 እንደ ምድር አሸዋ ዘሩን አበዛለት * 2
 በሀዘን በችግር በመከራ ጊዜ
 ጭንቄን የሚያርቅ ነው የነፍሴን ትካዜ የቀደመው እባብ ሰላሜን ሲነሳኝ እግዚአብሔር መልካም ነው ሀዘኔን አስረሳኝ የቀደመው እባብ ሰላሜን ሲነሳኝ
 ክርስቶስ ኢየሱስ ሀዘኔን አስረሳኝ * 2
 `},{ 'title' :`እግዚአብሔርን አመስግኑ`, 'lyrics':` እግዚአብሔርን አመስግኑ
 ስራው ግሩም ድንቅ ነው በሉት እግዚአብሔርን አመስግኑት ስራው ግሩም ድንቅ ነው በሉት
 ሰማይን ያለ ምሶሶ ምድርንም ያለ መሰረት ያጸናው እርሱ ነው ስራህ ድንቅ ለው በሉት
 የባህርን ጥልቀት የመጠነ ዳርቻዋን የወሰነ እግዚአብሔርን አመስግኑ ስራህ ድንቅ ነው በሉት
 ማዕበል ነፋስን የሚገስጽ ፍጥረቱ ለስሙ የሚታዘዝ
 
 
 
 
 
 ትጉህ እረኛ ድካም የሌለበት
 እግዚአብሔር ስራህ ግሩም ድንቅ ነው በሉት ንጹህ ባህሪይ ነው ሁሉን የሚገዛ
 የነገስታት ንጉስ አልፋና ኦሜጋ ዘለዓለም እርሱ የማይለወጥ
 እግዚአብሔርን ስራህ ድንቅ ለው በሉት ጥበብን የሚገልጥ ጥበበኛ
 ፍርድ የሚያደርግ እውነተኛ ዳኛ እንደ እርሱ ያለ ከቶ አይገኝም እግዚአብሔር ግሩም ነው ዘለዓለም
 `},{ 'title' :`ደስ ይበለን`, 'lyrics':` ደስ ይበለን * 2 አምላክ አለ መሀላችን ምን ይከፈል ለዚህ ስራህ
 ገናና ነው አምላክ ክብርህ
 ምህረቱን አይተናልና አድርሶናል አምላክ በጤና ይህችን እድሜ የጨመረልን ለንስሐ ጊዜ የሰጠን
 ሃጢያትህን ይታገስሃል በቸርነት አምላክ ያይሃል ደስታ ነው በሰማያት
 በአንድ አጥዕ የጽድቅ ሕይወት
 እልል በሉ የጎበኛችሁ በምህረት አምላክ ያያችሁ በችግር ቀን ያሰበን ሁሉ አመስግኑ ዝምም አትበሉ
 ድንግል ማርያም ትጸልያለች ሃጥኡን ሰው ማረው እያለች በድንግል ክብር እንኖራለን በጽኑ ፍቅር አንድ እንዲያደርገን
 `},{ 'title' :`የያሬድ ውብ ዜማ`, 'lyrics':` የያሬድ ውብ ዜማ ድንግል እመቤቴ ስጦታዬ ነሽ * 2
 በምን አንደበቴ እንዴትስ ባለ ቃል ማርያም ልበልሽ * 2
 
 
 
 
 
 
 ምድርና ሰማይ ታምርሽን ይንገሩ ፍጥረታት በሙሉ ስላንቺ ይመስክሩ ተነግሮ የማያልቅ ድንቅ ነው ስራሽ ድንግል ሆይ እናቴ አምሳያም የለሽ
 ማርያም ድንግል እረዳቴ የምትደርሽልኝ ነይ ስልሽ በጭንቀቴ ተአምርሽን በዓይኔ አይቻለሁ
 ጽዮን ሆይ ስልሽ ድንግል ሆይ እጠግባለሁ የእግዚአብሔር ጥበቡ ባንቺ ተገለጠ የአዳም ዘር በሙሉ ከሞት አመለጠ የመዳን ምክንያት ማርያም አንቺ ነሽ ለፍጥረት ሁሉ መሰላል የሆንሽ
 ነገ ባላውቅ እኔን ቢያስፈራኝም አንቺ ካለሽልኝ በፍፁም አልወድቅም በፊትሽ እንድቆም ለምስጋና
 ማርያም ልበልሽ በትህትና
 ትውልዱ በሙሉ ለምስጋና ይቁም ባንቺ ስለሆነ የቀረለት መርገም አዳም ከነልጁ በሰማይ በምድር
 ማርያም * 2 ይበል ተዓምርሽን ይናገር ጨለማውም ከፊቴ ተገፈፈ
 ማርያም በምልጃሽ ልቤ አረፈ ከጎኔ ነይ ስልሽ እጽናናለሁ
 እሳት ገደሉን ሁሉንም አልፈዋለሁ
 `},{ 'title' :`የማያልፍ የለም`, 'lyrics':` የማያልፍ የለም ሁሉም ያልፋል ሀዘን መከራም ይታለፋል የማጣት ዘመን ሁሉም ያልፋል ሀዘን መከራም ይታለፋል
 አንዱን ስሻገር አንዱ ይተካል ፈታኜ ቀርቦ ፈተና አብዝቷል ትዕግስት ጽናቱን አድለኝና ይህም ቀን አልፎ ልይ እንደገና
 የማይቻለው በእርሱ ተችሎ ስንቱ ታለፈ ሁሉ ተጥሎ በሚያበረታው ጌታ በርትተን እዚህ ደርሰናል ሁሉንም አልፈን
 
 
 
 
 
 
 የማያልፍ መስሎኝ አየሁ አልፌ የማልችለውን አየሁት ችዬ
 ሁሉ ሲያልፍ አየሁ ሁሉን ስትረታ ምንድነው ዋጋህ ተመስገን ጌታ
 ተስፋ ያረኩት ጠፍቷል ከፊቴ ያስጨንቀኛል ብቸኝነቴ
 እኔ አልቻልኩም ጽናት ጎድሎኛል አልፌ ልየው ያ ይሻለኛል
 አይድንም ብሎ ዓለም ወስኖ ተስፋዬ ጠፍቶ ሁሉ ተከድኖ በእመ አምላክ ምልጃ አልፌዋለሁ አስጨናቂውን ድል አድርጌአለሁ
 `},{ 'title' :`ለውዳሴሽ ልትጋ`, 'lyrics':` ለውዳሴሽ ልትጋ ስምሽ ግርማ ያለው * 2
 እመቤቴ እኸ እመቤቴ ስልሽ እውላለሁ * 2 ከልቤ አቀርባለሁ ምስጋና ለስምሽ መለመኛዬ ነው ጽኑ ቃል ኪዳንሽ በሰላምታ ድምፅሽ ያልጸና ማን አለ ጽንሱ በማህጸን በደስታ ዘለለ
 ማርና ወተት ነው የስምሽ ስያሜ እመቤቴ ስልሽ ይቀላል ሸክሜ ቅኔ ማህሌቱ ሰዓታት መዝሙሩ ያመሰግንሻል ምድርና ጠፈሩ
 እናቱ ነሽና አንቺ ለአዶናይ
 ማለድኩኝ ከፊትሽ ይቅርታውን እንዳይ ሰዓሊለነ ብዬ ይኸው ተርፌአለሁ በአንቺ ተደግፌ ነገም እኖራለሁ
 ነይ ነይ እልሻለሁ እንደ ካህናቱ በሰዓታት ጸሎት ቆሜ በሌሊቱ ዝም አልልም እኔ አወድስሻለሁ የዓለም መከራ እረሳብሻለሁ
 `},{ 'title' :`የወደደኝ ጌታ`, 'lyrics':` የወደደኝ ጌታ ምን አድርጌለት ነው ብዘምርለትስ ያንስበታል ይኸው
 
 
 
 
 
 
 ከውድቀቴ አንስተህ ድካሜን ያገዝከኝ ሰባራውን ድልድይ ገጥመህ ያሳለፍከኝ
 በኢያሪኮ መንገድ ስለምን ቁጭ ብዬ ብርሃን እጅግ ናፍቆኝ ከሰው ተገልዬ የብርሃን ጌታ ወደ እኔ መጣና ዓይኔን አበራልኝ በእጁ ዳሰሰና
 ለብዙ ዘመናት አልጋ ላይ ተኝቼ የሚረዳኝ አጣሁ ጠሉኝ ዘመዶቼ የእኔ ጌታ አምላኬ ወደ እኔ መጣና አልጋህን ተሸከም አለኝ ፈወሰና
 አሥራ ሁለት ዓመት ደም እየፈሰሰኝ ምራቅ እየተፉ ሁሉም ሲያንቋሽሿኝ የጌታዬ ልብሱን ጫፉን ብዳስሰው ኃይልም ከእርሱ ወጣ ደሜን ቀጥ አረገው
 ሰካራም ዘማዊ ወንበዴ ነበርኩኝ የአመጸኞች መሪ ደምን ያፈሰስኩኝ ዛሬ ግን ታሪኬን ጌታ ቀይሮታል ለኃያሉ ጌታ ምስጋና ይገባዋል
 `},{ 'title' :`እግዚአብሔር ሆይ እወድሃለሁ`, 'lyrics':` እግዚአብሔር ሆይ እወድሃለሁ ስለስምህ እቃጠላለሁ
 ፍቅርህ እኔን ይመስጠኛል
 እንደ እግዚአብሔር ከየት ይገኛል
 ዓለም ሁሉ በጠላኝ ጊዜ ስንገላታ ይዞኝ ትካዜ አንተ ከእኔ አልተለየህም
 እግዚአብሔር ሆይ ወደር የለህም ሳኦል እኔን ሲያሳድደኝ
 ጎልያድም ሲዝትብኝ
 ግርማ ሆነህ ከፊቴ የቆምክ እግዚአብሔር ሆይ ስምህ ይባረክ
 ሞቷል ብለው ቀብረውኝ ሰዎች ምስኪን ሆኜ ሳይኖረኝ አንዳች ከመቃብር ቆፍሮ አወጣኝ አይዞህ ብሎ አምላኬ አጽናናኝ
 ሐሳብህን በእግዚአብሔር ላይ ጣል ለዘለዓለም ያበራልሃል
 ታማኝ ወዳጅ እርሱ ነውና ሰላም ይሙላህ ለእርሱ ተውና
 
 
 
 `},{ 'title' :`ለእኔስ ወደ እግዚአብሔር`, 'lyrics':` ለእኔስ ወደ እግዚአብሔር መቅረብ ይሻለኛል * 2
 መታመኛዬ እርሱ ነውና ይገባዋል ክብርና ምስጋና ፍቅሩን እያሰብን እንቅረብ ወደ እርሱ ይምረናልና መሃሪ ነው እርሱ
 በልባችን ይንገስ ይግባ ከቤታችን
 የሕይወታችን ዋልታ እርሱ ነው ተስፋችን * 2
 ከቶ አላገኝም እርሱን የሚመስል ነፍሴን የሚያከብራት የሚሰጠኝ ሐይል በመከራ ሰዓት ከክፉ የሚያድነኝ
 ከየት አገኛለሁ መጠጊያ የሚሆነኝ * 2 የለመለመ መስክ መሸሸጊያ ነው በሰላም ወጥቼ ሰላም እገባለሁ ተስፋዬ እርሱ ነው ይጠራኛልና ዘወትር አቀርባለሁ ክብርና ምስጋና ዘወትር አቀርባለሁ ለአምላኬ ምስጋና
 እኔስ ይሻለኛል መቅረብ ወደ ጌታ ጋሻዬ ነውና የነፍሴ አለኝታ
 ስለዚህ እቀርባለሁ አልቀርም ከደጁ
 ጠግቤ እኖራለሁ በበረከት እጁ * 2
 `},{ 'title' :`ደጅ ጠናሁ`, 'lyrics':` ደጅ ጠናሁ ቆይቼ ኪዳነምህረትን ተጽናናሁኝ ረሳሁ ሀዘኔን
 የአምላክ እናት እመቤታችን * 2
 ሞገስ ሁኚኝ ቀሪው ዘመኔን * 2
 የመከራው ዘመን አለፈ እንደ ዋዛ አንቺን ተጠግቼ የዓለሟን ቤዛ የልጅሽ ቸርነት የአንቺም ደግነት ባሪያሽን ሰወረኝ ከአስጨናቂው ሞት
 እናቴ ስምሽን ስጠራ አለፈ ያ ሁሉ መከራ እንባዬ በፊትሽ ፈሰሰ እምዬ ባንቺ ነው የታበሰ ሰላም ለኪ
 ልቤ ባንቺ ጸና ከፍ ከፍም አለ በጠላቶቼም ላይ አፌ ተናገረ
 
 
 
 
 
 በማዳንሽ ስራ ባሪያሽ ደስ ብሎኛል የሐያላኑን ቀስት ልጅሽ ሰብሮልኛል
 እናቴ ስምሽን ስጠራ አለፈ ያ ሁሉ መከራ እንባዬ በፊትሽ ፈሰሰ እምዬ ባንቺ ነው የታበሰ ሰላም ለኪ
 እጄ ባዶ ሲሆን ወዳጆቼም ሸሹ በመርገም ምክራቸው ሊለያዩኝ ሲሹ እርሱ የሰጠኝን እርሱ ወሰደ አልኳቸው እመቤቴ አለችኝ ብዬ አሳፈርኳቸው
 እናቴ ስምሽን ስጠራ አለፈ ያ ሁሉ መከራ እንባዬ በፊትሽ ፈሰሰ እምዬ ባንቺ ነው የታበሰ ሰላም ለኪ
 ከአውደ ምህረቱ ሆኜ ስጠራት ዘንበል ብላ አየችኝ ኪዳነ ምህረት ሐሳብሽን ምንም የለም የሚመስለው እረፍት ያገኘሁት እናቴ ባንቺ ነው
 እናቴ ስምሽን ስጠራ አለፈ ያ ሁሉ መከራ እንባዬ በፊትሽ ፈሰሰ እምዬ ባንቺ ነው የታበሰ ሰላም ለኪ
 `},{ 'title' :`የይሁዳ ጉዞ`, 'lyrics':` የየሁዳ ጉዞ አያዋጣምና
 ዴማስ ወደ ህይወት እባክህ ቶሎና * 2 በወንጌል ገበታ መመገብ ጀምረህ ወንድሜ ተመለስ ወዴት ትሔዳለህ ይጠራሃልና መስቀሉን ተመልከት
 የወንጌል ቡቃያ እውነተኛ ህይወት * 2
 ቸርነቱን አይተህ ፍቅሩን ቀምሰኸዋል በረድኤት ህይወት ደስታ ሞልቶልሃል ቅዳሴው ዝማሬው እጣኑ ሸቶሃል
 ዴማስ ሆይ ተመለስ እውነት ይሻልሃል * 2 ብዙ ክርስትያኖች መንገዱን ጀምረው የዓለም አሸንክታብ ድምቀት ሲጠራቸው ፈተናው ሲመጣ ወንጌሉን ወርውረው
 ሞትን ይመርጣሉ ህይወትን ሰርዘው * 2
 የመስቀሉ ፍቅር ከልብ ሳይጠፋ በእግዚአብሔር ጉባኤ መስክረህ በይፋ
 
 
 
 
 
 
 ልጄ የተባልከው በጥምቀት ቀለበት
 እንዴት ትሔዳለህ ተነስተህ ወደ ሞት * 2
 የክብር አክሊል ተዘጋጅቶልሃል
 አምላክ ለሽልማት ዴማስ ሆይ ይልሃል ወዴት ትሄዳለህ እባክህ ተመለስ ክብርህን አትተው ከጫፉ ሳትደርስ * 2
 `},{ 'title' :`መቼ ነው ጌታ`, 'lyrics':` መቼ ነው ጌታ ኸረ መቼ ነው * 2 ጌታዬ እንደ ቃልህ የሚሆን ጉዞዬ
 አልተማርኩም አልል አስተምረኸኛል * 2 ቃልህን እንደ ወተት አጠጥተኸኛል * 2 የታል አኗኗሬ አንተን የሚመስለው * 2 በልምድ ሕይወት ነው የምመላለሰው * 2
 
 
 
 
 
 
 ይህ አንደበቴማ በቃልህ ሰልጥኗል * 2 ልቦናዬ ከአንተ ከፊትህ ኮብልሏል * 2 አንተን እንደማውቅህ አብዝቼ ባወራ * 2 የተዘራው ሁሉ ፍሬ አላፈራ * 2
 እዘንልኝና መንገዴን አቅናልኝ * 2 የአመፅ ስራዬን በደሌን ተውልኝ * 2 ቃልህ እንዳይሰደብ በእኔ ድካም * 2 አርመው እርሻውን መድሐኒዓለም * 2
 ከእስራቴ ፈትተህ ነፃነት ስጠኝ * 2
 በቀኝ አቁመህ ጌታ ሆይ ባርከኝ * 2
 `},{ 'title' :`በመከራ ጽና`, 'lyrics':` በመከራ ጽና በፈተና ጽና * 2
 ለጊዜው ነውና ሁሉም ያልፋልና * 2
 እዮብ ተጨነቀ በጣም ተማረረ በመከራው ብዛት ትዕግስትን ተማረ ልጅ የሌለው ሆነ አጣ ንብረቱን በመከራ ጸና አልካደም አምላኩን
 መፈተን መልካም ነው ያነጥራል እንደ ወርቅ በመጨረሻው ቀን በክብር እንድንጸድቅ አንዱን ሳትሻገር ሌላ ቢተካብህ
 በሕይወት ዘመንህ ፈተና ቢያጠቃህ
 ከአምላክህ ተስማማ እራስህን አዋርድ በቃሉም ተመራ እንደ ፈቃዱም ሂድ ዋጋህ ከአምላክህ ዘንድ በሰማይ አለና በርታ ክርስትያን ሆይ በመከራ ጽና
 `},{ 'title' :`በደልህን አምነህ`, 'lyrics':` በደልህን አምነህ ንስሀ ግባና ወደ አምላክህ አልቅስ ተጸጸትና
 አመስግነው ጌታን አክብረው ከልብህ በጉብዝናህ ወራት በእርሱ ደስ ይበልህ ስትቸገር አይቶ ንቆ የማይተውህ
 አምላክህን ውደድ እርሱ ነው አለኝታህ * 2
 
 
 
 
 
 የሃጢያትን ኑሮ አቁምና ዛሬ ለማፍራት ተነሳ የንስሃን ፍሬ
 የእግዚአብሔርን ድምፅ አትናቅ ጥሪውን ተመለስ ይልሃል አስተውል መንገዱን
 የጉብዝናህ ወራት ያበቃል ያከትማል ድካም መሸነፍም መውደቅም ይመጣል ተስፋህ ይጨልማል ንብረትህም ያልቃል ወጣትነትህም መቼ ሁሌ ይኖራል
 የወደቅህ ለታ ማንም አያይህም
 ሁሉም ሲኖርህ ነው ካንተ ጋር የሚኖር እስከ መቼ ድረስ እንዲህ ትኖራለህ መለከት ሲነፋ ወዴት ትደርሳለህ
 ለካህኑ ነግረህ የሰራኸውን ሃጢያት ንስሀ ተቀበል እንድታገኝ ስርየት ቤትህን አዘጋጅ ክርስቶስ ይመጣል ማድጋህን ክፈት እርሱም ይሞላዋል
 ተመለስ ወደ እርሱ በደሙ ገዝቶሃል እርሱም አይቀየም ሊቀበልህ ወጥቷል አመስግነው ጌታን አክብረው ከልብህ በጉብዝናህ ወራት በእርሱ ደስ ይበልህ
 `},{ 'title' :`የዶኪማስ ጓዳ`, 'lyrics':` የዶኪማስ ጓዳ ሆኖብኛል ቤቴ
 ያንቺን ድንቅ ስራ ናፍቃለች ሕይወቴ ጊዜዬ እንዳያልፍ በዋዛ ፈዛዛ ያለኝን ሰምቼ ለእርሱ እንድገዛ የልቦናዬ ጋን ባዶ ሆኗልና
 አማልጅኝ ከልጅሽ በቃሉ እንድሞላ * 2
 ማነው ውስጡን ያየ የጎደለውን የዶኪማስን ልብ ያስጨነቀውን እስኪ እንጠይቀው እድምተኛውን
 ወይኑን አጣጥሞ ያደነቀውን * 2
 አስቀድሞ ያለኝ መናኛ ነበረ
 አሁን ግን ሚስጢሩን ልቤ መረመረ ያንቺን እናትነት አምኖ ተናገረ
 ድንቅ ስራሽንም ለዓለም መሰከረ * 2
 
 
 
 
 
 
 
 `},{ 'title' :`ወደ አንተ እሰግዳለሁ`, 'lyrics':` ወደ አንተ እሰግዳለሁ ሳለሁ በሕይወቴ ለአንተም እገዛለሁ እስከ እለተ ሞቴ
 አንተ ነህና መድሃኒቴ የዘለዓለም ቤቴ * 2 የነፍስ የስጋዬ የሕይወቴ ቤዛ አትበለኝ ችላ በደሌ ቢበዛ
 አንተን አምኜ እኖራለሁ ወዴት እደርሳለሁ አንተን አምኜ እኖራለሁ በአንተም እመካለሁ
 ሳይመሽብኝ ቀኑ ሳይጨልም ድንገት በጽድቅ ጎዳና ልጓዝ ወደ ፊት
 ምራኝ መንገዱን አሳየኝ እንዳልሳሳት * 2
 `},{ 'title' :`ዓለምን ዞሬ አየሁት`, 'lyrics':` ዓለምን ዞሬ አየሁት ሁሉን በተራ ቀመስኩት ፈጽሞ የለም * 2 ሠላም አንደ ልጅሽ ቤት ሀብት ንብረቴን ጨረስኩና
 ጉልበቴ ሁሉ ደከመና
 ጎስቋላ ሆንኩኝ * 2 ደካማ የሌለው ጤና ስቃ አሳስቃ ተቀብላ
 መልኳን አስውባ ተኳኩላ
 ዛሬ ጣለችኝ * 2 ይህች ዓለም አትረባም ብላ የትላንትና ወዳጆቼ
 ዛሬ ሲሆኑ ጠላቶቼ
 ባክኜ ቀረሁ * 2 በዓለም ላይ ተንከራትቼ የአባቴ ቤት ሲናፍቀኝ
 ፍቅሩ ምህረቱ ትዝ ሲለኝ
 ጎስቋላው ልጅህ ደካማው ልጅህ ጌታ ሆይ ዛሬ መጣሁኝ እናቴ አንቺን ንቄ ትቼ
 የአባቴን ቤት እረስቼ
 ተሰቃየሁኝ ተንከራተትኩኝ ልደሰት በዓለም ገብቼ አባቴ ሲያየኝ ተደስቶ
 ጎረቤቶቹን ሁሉ ጠርቶ
 ሰርጉን ደገሰ * 2 የበደልኩትን እረስቶ እስከ አሁን ድረስ በድያለሁ ዓለም ደህና ሁኚ አብቅቻለሁ
 ወደ አባቴ ቤት * 2 ዳግመኛ ተመልሻለሁ
 
 
 
 
 `},{ 'title' :`ጎሰቆለ`, 'lyrics':` የምድራዊ ሕይወቴ ጎሰቆለ * 2
 ጎሰቆለ * 2 ድንግል ጎሰቆለ ድንግል የጌታዬ እናት እመቤት
 ልጅሽ እንዳልጠፋብሽ የአምላክ እናት ከልጅሽ ጋር ነይልኝ አትለይኝ
 አጽናኝ መካሪዬ ነሽ አትራቂኝ ቅረቢኝ የስጋ ምኞቴን እያሳደድኩ
 ከአምላኬ ኮበለልኩኝ እረከስኩኝ የፍጥረት አማላጅ ሆይ እመቤቴ
 ዋስ ጠበቃ ሁኝልኝ መድሃኒቴ ለህይወቴ በልቤ ውስጥ ሳይልኝ አዛኝቷ ፍቅርና ውለታሽን አንዳልረሳ ልጅሽ አይሳነውም ሁሉን መስጠት
 ያብቃኝ በክብር አንድቆም በሀይማኖት በጽናት
 `},{ 'title' :`ከወገኔ ጋር`, 'lyrics':` ከወገኔ ጋራ እዘምራለሁ
 በደስታ በሐሴት ስሙን እጠራለሁ ምግብና መጠጤ አምላኬ ነውና ዘወትር አቀርባለሁ ለጌታ ምስጋና
 ህዝቡ ተሰብስቦ በቤተ ክርስቲያን ሲዘምር ደስ ይላል በአንድነት ሆነን በረከት ይሞላል ዝማሬው ይገርማል ከእጣኑ ጋር ወደ ላይ ይወጣል
 ቀሳውስቱ ሌሊት ማህሌት ሲያቀርቡ ከመላእክቱ ጋር ወረብ ሲወርቡ ብርሃኑን ለብሰን በደስታ ስንዘምር ትዝታው ልዩ ነው ህሊና ሲሰውር
 ራዕይ ነውና ኑና ተመልከቱ ሰዎች ሲዘምሩ እንደ መላእክቱ
 የጽጌው ማህሌት የትንሳኤው ደስታ ልዩ ዝማሬ ነው እንዳይመስለን ተርታ
 
 
 
 
 
 
 
 `},{ 'title' :`ከካራን ውጡ`, 'lyrics':` ከካራን ውጡ ከነዓን ግቡ
 ወደ ጽድቅ ሕይወት ዛሬ ቅረቡ ካራን ጣኦት ነው የሚመለከው
 የአህዛብ ሀገር የሞት መንደር ነው * 2 እንደ አባታችን እንደ አብርሃም ወገኖች ውጡ ከካራን ዓለም የግፍ እንጀራ ይብቃችሁና ከካራን ውጡ በአምላክ ጎዳና
 የጣኦት ምስል ከሚሸጥበት ዓለም በዝሙት ከሚነድበት ከሰዶም መንደር ከካራን ውጡ የሃጢያትን ስር ዛሬ ቁረጡ
 የሃጢያት ዓለም ዛሬ ይብቃና የፍቅርን ሕይወት እንልበስና ከካራን መንደር በፍጥነት ወጥተን ከነዓን ገብተን ማደር አለብን
 ማርና ወተት ከሚፈልቅበት ሰዎች በፍቅር ከሚኖሩበት ከሰማያዊት ኢየሩሳሌም
 ዛሬ ብንገባ እናገኛለን የአምላክን ሠላም
 `},{ 'title' :`ያልጠፋነው`, 'lyrics':` ያልጠፋነው ከእግዚአብሔር ምህረት የተነሳ ነው ቸርነቱ ከቶ አያልቅምና ርህራሄው ከቶ አያልቅምና ይገባዋል ክብርና ምስጋና
 ፈታኝ ሲያንገላታን በባህር ስንሔድ ማዕበል ተነስቶ ያ የሥጋ ሞገድ ሕይወት ስትመዝን ልባችን ሲናወጥ ለጠላት ሳይሰጠን አደረገልን ጸጥ
 ስለሆነ ርህሩህ ፈጥኖ የማይቀየም ለንስሀ እንቅረብ አንሂድ ወደ ዓለም
 
 ምስክር ነን እኛ አይተናል ማዳኑን በእርሱ ተማርከናል ቀምሰን ቸርነቱን
 በበደልነው በደል ማረን እንላለን ከአንተ ተለይተን ወዴት እንሄዳለን
 
 
 
 
 
 ዓለም የማያውቀው የማይመረምረው በውስጣችን አለ እኛ እምናመልከው
 ከእንግዲህ አልፈልግም የሸንጋይ ምላስ ቃልህ ይቆጣጠረኝ በስጋም በነፍስ አንተ ካከበርከኝ ማን ያዋርደኛል
 ዓይኔን ከሰው አንሳው አሁንስ በቅቶኛል
 `},{ 'title' :`እያለፈ ነው ዘመኔ`, 'lyrics':` እያለፈ ነው ዘመኔ ትዕዛዙን ሳልፈፅም ወየው ለእኔ * 2
 በጠራኝ ጊዜ ምን እላለሁ ና ብሎ ወደ እኔ * 2
 በወጣትነቴ ሳልሰራ እያየሁ አለፈኝ ብዙ አዝመራ * 2
 ከእንግዲህ በመስራት ጌታ ሆይ ልኑር ከአንተ ጋራ * 2
 የማስብበት በየዕለቱ ንጹህ ልብ ስጠኝ አቤቱ * 2
 ከትዕዛዝህ ውጪ በመሆን እንዳልቀር በከንቱ * 2 እንደየስራው ለመክፈል በግርማ መንግስቱ ሲመጣ * 2 ማን ይሆን የሚቆም ከፊቱ ፈተናን የወጣ * 2
 እንዳያስታችሁ ተጠንቀቁ እየተማራችሁ ከቃሉ * 2
 ይመጣሉና በእርሱ ስም አምላክ ነን የሚሉ * 2
 ትዕግስትን በመያዝ ሁላችሁ እስከመጨረሻው ጠንክሩ * 2 ያን ጊዜ ይሆናል በእርሱ ዘንድ የማዳን ተግባሩ * 2
 `},{ 'title' :`ሰላምሽ ዛሬ ነው`, 'lyrics':` ሰላምሽ ዛሬ ነው ኢየሩሳሌም
 ወደ አንቺ መጥቷልና አምላክ ዘለዓለም * 2 ሆሳዕና በአርያም እያሉ ዘመሩ ህጻናት በኢየሩሳሌም
 አንቺ ቤተልሔም የዳዊት ከተማ
 የህዝብሽ ብርሃን መጣልን በግርማ * 2 ሆሳዕና እያሉ አመሰገኑት በኢየሩሳሌም አዕሩግ ህጻናት * 2
 ኪሩቤል መንበሩን የሚሸከሙለት
 መስቀል ተሸከመ ሊሆነን መድሃኒት * 2 የኢየሱስን ህማም ደናግል አይተው እያለቀሱለት ሄዱ ተከትለው * 2
 
 
 
 
 `},{ 'title' :`ዘጠኝ ሰዓት ሲሆን`, 'lyrics':` ዘጠኝ ሰዓት ሲሆን አባት ሆይ በመስቀል ላይ ሆነህ አባት ሆይ ድምጽህን በማሰማት አባት ሆይ ነፍስህን ሰጠህ አባት ሆይ
 የሰማይ ከዋክብት በሙሉ ረገፉ ጨረቃና ፀሐይ ደምን አጎረፉ ብርሃናት ጨለሙ ጠፍተው ተለያዩ ስጋህን በመስቀል ተገልጦ ስላዩ
 ጌታችን ክርስቶስ በመስቀል ላይ ሳለ አሰምቶ ጮኸ ተጠማሁ እያለ
 ማርና ወተት ለሚመግበው
 ሐሞት አመጡለት ይቅመሰው ብለው አካሉ ሲወጋ ውሃ ደም ፈሰሰ በምድር ተረጭቶ ዓለምን ቀደሰ
 የእስራኤል ሴቶች ዋይ ዋይ ሲሉልህ ለእነርሱ አዘንክ እንጂ ለአንተስ አላሰብክ
 እናትህ ስታለቅስ በመስቀል ስር ሆና ዮሐንስን ሰጠህ ጠብቆ እንዲያጽናና መላዕክትም ታዩ አጋንንትም ሸሹ የአይሁድ ሰራዊት ፈርተው ተረበሹ
 `},{ 'title' :`የጸጸት እሮሮ`, 'lyrics':` አምላክ ሆይ ወደ እኛ ባትመጣ * 2
 ለብሰህ የማርያምን ስጋ * 2 ባክኖ የነበረው የአዳም ዘር * 2 ውጤቱ ነበር የሚያሰጋ * 2
 በዚያ ዓመት በዚያች ወር በዚያች ቀን * 2
 ድህነትን ለሰው ልጅ ስትሰጥ * 2 ምን የበዛ ነበር ትህትና * 2 ትዕግስትህ የማይለወጥ * 2
 የአሾህ አክሊል ደፍተህ * 2 በራስህ ጎንህን ሲወጉ በጦር * 2 አንተ ግን ለእነርሱ ከአባትህ * 2 ምህረትን ትለምን ነበር * 2
 
 
 
 
 
 ግን መቼ አወቁህ እነርሱ * 2 በሃጢያት ደንድኖ ልባቸው * 2 መድሃኒታቸውን ገረፉት ሰቀሉት * 2 አንተም ሞትክላቸው * 2
 በዚያች በደብረ ዘይት ቦታ * 2 ደስታና ለቅሶ ሲፈልቅ * 2 ከቶ ከየት ይሆን እጣዬ * 2 ያን ጊዜ የእኔ አወዳደቅ * 2
 የጸጸት እሮሮ በፊትህ * 2 እንዳያቃጥለኝ እኔን * 2 እርዳኝ ፈጣሪዬ እኔን * 2 አድሰው የዛገው ልቤን * 2
 ዳግም ስትመጣ ለፍርድ / 
 ከዓለም ፍፃሜ በኃላ / 
 ኸረ እንዴት እድለኞች ናቸው * 2
 በፊትህ የሚያገኙት ተድላ * 2
 `},{ 'title' :`እስመ ለዓለም`, 'lyrics':` እስመ ለዓለም ምህረቱ * 2
 አያልቅም ብዙ ነው የአምላክ ቸርነቱ * 2 አመስግኑ ጌታን ሁላችሁ በአንድነት * 2 መሀሪ ነውና ለሰው ልጆች ሕይወት
 የማይሞተው ሞቶ የተቀበረው * 2
 ከገሃነም እሳት እኛን ሊያድን ነው ከማርያም የነሳው ያ ቅዱስ ስጋው
 ቀራንዮ ሲውል የሚያሳዝን ነው ለፈጠረው ፍጥረት እጅግ ተሰቃይቶ ነፍሳትን አወጣ ከሲኦል ለይቶ
 `},{ 'title' :`የት ይሆን መግቢያዬ`, 'lyrics':` በስራዬ የት ይሆን መግቢያዬ * 4
 ጨነቀኝ ጠበበኝ ነፍሴ ወዲያልኝ * 2
 
 
 
 
 
 ተሸክሜ የሃጢያት ክምር * 2
 ይመሻል ይነጋል በከንቱ ስዞር * 2
 ገሰገሰ ቀኑ ጨለመብኝ * 2
 ዋ ለነፍሴ ምንም ስንቅ አልያዝኩኝ * 2 በድያለሁ ወደ አንተ እጮሀለሁ * 4 ይቅር በለኝ እማጸንሀለሁ
 ችላ አትበለኝ ከፊትህ ቆሜአለሁ
 አለፈብኝ በከንቱ ጊዜዬ * 2 እየጓጓሁ ለዚች ለስጋዬ * 2 በንስሀ ሳላጥበው እድፌን * 2
 ልትደርስ ነው ያች የፈተና ቀን * 2
 `},{ 'title' :`ወደ ምስራቅ እዩ`, 'lyrics':` ወደ ምስራቅ እዩ ወደ ፀሐይ መውጫ ድንግልን ክበቧት እንበል ሃሌ ሉያ ለአምላክ እናት ለአዛኝት
 እልል እንበል እንዘምርላት
 ወገኖች ተነሱ እናታችን መጣች ስሟን ስንጠራ መቼ ትቀራለች የተከዘን ልታጽናና
 ነይ ስንላት ትመጣለችና የጽጌው ማህሌት መዝሙር ሲጀመር ማርያም ትመጣለች በደመና በአየር ንኢ ስንል በሰዓታት
 እሷ አትቀርም ትመጣለች በእውነት
 ፍልሰታ ሲጀመር ቃል ኪዳን ገብታለች የሌሊት ውዳሴን ንኢን ትሰማለች ህፃናቱን በበረከት
 ልትጎበኝ ትመጣለች በእውነት በፍጹም ቸርነት እንዲምረን ጌታ በአማላጅነትሽ ሁኝልን መከታ
 እናታችን አለኝታችን
 እንድናለን ድንግል አንቺን ይዘን
 ሃሌ ሃሌ ሉያ * 4 እስመ ዝንቱ ኡራኤል እስመ ዝንቱ ለዓለም ብርሃን
 
 
 
 
 
 
 `},{ 'title' :`አትተወኝ አትጣለኝ`, 'lyrics':` አትተወኝ አትጣለኝ * 2
 ወድቂያለሁ እና ጌታ ሆይ አንሳኝ * 2
 ቸሩ መድሃኒቴ የአልአዛር ቤት ራት የኑሮዬ ጣዕም የሕይወቴ መብራት በሃጢያት ጭቃ ላይ ወድቂያለሁና
 ጌታዬ ሆይ አንሳኝ እጅህን ዘርጋና * 2
 የሰጠኸኝ ክብር የልጅነት ስልጣን እንደ ሶምሶን ሲወድቅ ከደሊላ ጋር እርቃኔን ቀረሁኝ ተላልፌ ሕግህን አምላኬ ዘርጋልኝ የምህረት እጅህን ጌታዬ ዘርጋልኝ የምህረት እጅህን
 ዘወትር እየበደልኩ ከህግህ እርቄ በሃጢያት ጭቃ ላይ ክፉኛ ወድቄ በበደል እስራት ተይዣለሁና
 አባቴ ሆይ ማረኝ መሀሪ ነህና ጌታዬ ሆይ ማረኝ መሀሪ ነህና
 `},{ 'title' :`እመቤቴ የአምላክ እናት`, 'lyrics':` እመቤቴ የአምላክ እናት ላመስግንሽ ቀን ከሌሊት ለልጅሽም ክብር ውዳሴ
 ታቀርባለች ዘውትር ነፍሴ * 2
 ልቤ ተነሣሣ ተቀኘ ለክብርሽ በፍፁም ትህትና ሊያመሰግንሽ
 ጽዮን መጠጊያ ነሽ የአብርሃም ድንኳን የታጠረች ተክል እመብርሃን
 የለመለመች መስክ አምላክ የመረጣት የጽላቱ ኪዳን ታቦቱ ድንግል ናት የሰማይ የምድር ንግስት ናትና
 ክብር ይገባታል ዘውትር ጠዋት ማታ አደራሽን ማርያም የሁሉ እናት በምልጃሽ አስቢኝ ኃላ ስራቆት
 ያንን የእሳት ባህር አሻግሪኝ ድንግል ሆይ እንዳልወድቅ እንዳሞት ከቶ እንዳላይ ስቃይ
 
 
 
 
 
 
 `},{ 'title' :`ተክለሐይማኖት ፀሐይ`, 'lyrics':` ተክለሐይማኖት ፀሐይ የኢትዮጵያ ሲሳይ ምዕራፈ ቅዱሳን * 2 በነፍስም በሥጋ አትርሳን
 የቅዱሳን እርስት የኢትዮጵያው ብርሃን የጸሎት ባለቤት የነዳያን መድህን
 ገና ሳትወለድ አምላክ የመረጠህ
 የድውያን ህመም ፈዋሹ አንተ ነህ * 2
 ገና በሶስት ቀን በህፃንነትህ
 ጌታን አወደሰው ቅዱስ አንደበትህ ቀድሞም እግዚአብሔር አስቦሃልና በወጣትነትህ ወጣህ ለምነና * 2
 ሌትና ቀን ሳትመርጥ ክረምትና በጋ ስትፀልይ ውለህ ስትፀልይ አነጋህ በመቆምህ ምክንያት አንድ እግርህ ቢነሳ
 ጸሎትህን ፈጸምክ ለስጋህ ሳትሳሳ * 2
 ምንኛ ድንቅ ነው ቅዱስ ያንተ ብርታት ሰባት ዓመት ሙሉ በአንድ እግርህ ጸሎት የዓለም ግሳንግሱ ሀብቱ ሳይስብህ
 ለኢትዮጵያ ፀለይክ ቆመህ በአንድ እግርህ * 2 የሐይማኖት ተክል የኢትዮጵያ አባት ምህረትን ከአምላክህ ለሀገርህ አሰጣት እኛንም አግዘን ጽድቅን እንድንሰራ
 በተሰጠህ ስልጣን ጠብቀን አደራ * 2
 `},{ 'title' :`ያሬድ ካህኑ
 ያሬድ ካህኑ ዘመረ`, 'lyrics':`* 2
 ዘመረ ያሬድ ዘመረ አምላኩን አመሰገነ * 2 አርያም በማለት ያሬድ ዘመረ ማህሌት ጀመረ ያሬድ ዘመረ ዜማውን ከመላዕክት እያስተባበረ
 ምስጋና አቀረበ ያሬድ ዘመረ በዜማ መሣሪያ ያሬድ ዘመረ ጸናጽል አነሳ ከበሮ መቋሚያ
 በግዕዝ በዕዝል ያሬድ ዘመረ በአራራይ ዜማ ያሬድ ዘመረ
 ከብሉይ ከሐዲስ ምስጢር እያስማማ
 
 
 
 
 
 
 በዜማው ምልክት ያሬድ ዘመረ የአምላክን መከራ ያሬድ ዘመረ የመስቀሉን ነገር የማዳኑን ስራ
 ደሙ እየፈሰሰ ያሬድ ዘመረ በጦር ተወግቶ ያሬድ ዘመረ
 ሊቁ ማህሌታይ በመንፈስ ተቃኝቶ በጥኡም ልሳኑ ያሬድ ዘመረ
 በተሰጠው ጸጋ ያሬድ ዘመረ
 ለንጉስ እግዚአብሔር ለአልፋ ኦሜጋ ድጓ ጾመ ድጓ ያሬድ ዘመረ
 ምዕራፍ መዋሲት ያሬድ ዘመረ ምስጢር ተገልጾለት ከሰማይ መላዕክት
 የዜማ መሠረት ያሬድ ዘመረ ፈልፈለ ዝማሬ ያሬድ ዘመረ የኢትዮጵያ ኩራት የተዋህዶ ፍሬ
 `},{ 'title' :`እጹብ ድንቅ ነው`, 'lyrics':` እጹብ ድንቅ ነው ውለታው እግዚአብሔር ለኛ ያረገው ከቶ አይጥለንም ለዘለዓለም
 እንደ አምላካችን ማንም የለም
 ወድቀን ነበረ ተነስተናል ባህር አሻግሮ አቁሞናል ድንቅ አደረገ ታምር ሰራ እያንሳፈፈ ያን ተራራ
 የጠፋውን በግ የፈለገ እራሱን ባዶ አደረገ መስቀል ታቅፎ ክንዱ ዛለ ምን ያልሆነልን ነገር አለ
 ከአባትም በላይ አባት ነው የልጆቹ እንባ የሚገደው የጭንቀታችን ተካፋይ
 አዛኝ ጌታ ነው ሁሉን ቻይ ዳግም እንድንቆም በሕይወት
 ጨክኖ ወደደን እስከሞት ከእንግዲህ አንፈራም እንጸናለን ለክፉ የማይሰጥ አባት አለን
 
 
 
 
 
 
 `},{ 'title' :`የስላሴን መንበር`, 'lyrics':` የስላሴን መንበር ቅዱሳን ከበውት ኪሩቤል በደመና ዙፋኑን ይዘውት ድንግልን ከመሃል ሚካኤልን ከፊት አእላፍ መላዕክት ሲሰግዱ በፍርሃት እዩ ተመልከቱ የሰማዩን ድምቀት እዩ ተመልከቱ የሰማዩን አባት
 የስላሴን መንበር ቅዱሳን ከበውት እያሸበሸቡ የሰማይ መላዕክት ካህናተ ሰማይ ስሉስ ቅዱስ ሲሉ
 በጽድቅ ስራቸው በምድር ይታያሉ * 2
 የቅዱሳን ህብረት የቅዱሳን ሀገር ሲያወድስ ይኖራል የስላሴን መንበር ፍቅርና ርህራሄን የተሞላች ሰማይ
 እግዚአብሔር ያድለን በትንሣኤ እንድናይ * 3
 `},{ 'title' :`እናመሰግንሃለን`, 'lyrics':` እናመሰግንሃለን * 2
 እንደ አባቶቻችን በማህሌት እንጠራሃለን እንደ ቅዱሳኑ ለክብርህ እንዘምራለን
 ለአምላክ ምስጋና ለፈጣሪ ክብር ማለዳ ተነስተን ምስጋና ስንጀምር የአባቶች ዝማሬ ቅኔ መወድሱ ሲሰማ ደስ ይላል ከቤተ መቅደሱ
 ስርዓተ ሰማይ በምድር ተሰርቶ በአባቶች ሎቦና የአምላክ ጥበብ ሞልቶ ዝማሬ ፈለቀ ከታላቁ መቅደስ
 የያሬድ ጸናጽል መሰንቆ በገናው
 የጽዮን ደናግል ለመዝሙር ተነሱ ስሉስ ቅዱስ በሉ ስሙን አወድሱ ማህሌቱ ሲቆም ሰዓታት መዝሙሩ ቅዱሳን መላዕክት አብረው ሲዘምሩ
 ፍጹም ተደሰተች ነፍሳችን በደስታ ለምስጋና ስንቆም ከቅዱሳን ተርታ
 
 
 
 
 
 
 
 
 `},{ 'title' :``},{ 'title' :`ዝም አትበሉ`, 'lyrics':` ዝም አትበሉ እግዚአብሔርን አመስግኑ * 2
 ቅዱስ * 3 ስሉስ ቅዱስ በሉ መላዕክቱ ሁሉ ምስጋናን ጀምሩ ቅዱስ ቅዱስ በሉ
 የሙሴ እህት ማርያም ከበሮውን አንሽው በምስጋና መዝሙር እስራኤልን ጥሪው አምላክን እናክብር እንዘምር በእልልታ
 ከእኛ ጋር ይሆናል የሠራዊት ጌታ * 2
 ፍጥረታትም ጩኹ ሰማያት ዘምሩ ስለ ቅድስናው ውዳሴ ጀምሩ ዳዊት ሆይ ተነሣ ስለ ጽዮን ዘምር
 ከበሮው ይመታ በገናው ይደርደር * 2
 ወገኖች እንዘምር ለእግዚአብሔር ክብር ውለታው ብዙ ነው ለእኛ ያለው ፍቅር ማዳኑን ያያችሁ ዘምሩ በእልልታ
 ለጌታ ለእግዚአብሔር ለሠራዊት ጌታ * 2
 ባህሩን አቋርጦ ወንዝ ያሻገራችሁ ተራራውን ንዶ ያቀለለላችሁ
 በአውሎ ነፋስ መሐል መንገድ ላለው ጌታ
 ለንጉስ ክርስቶስ እንዘምር በእልልታ * 2
 `},{ 'title' :`ጠላቴን ጌታዬ`, 'lyrics':` ጠላቴን ጌታዬ አንበረከከልኝ
 እጅግ ተዋረደ	በጣሙን ደስ አለኝ ለዚህ ድንቅ ውለታህ ምን ልክፈልህ ጌታ ስለ ለወጥክልኝ ሀዘኔን በደስታ
 እግዚአብሔር ብርሃኔ መድሃኒቴ ነው የሚያስደነግጠኝ የሚያስፈራኝ ማነው አስጨናቂዎቼ በከበቡኝ ጊዜ
 ፈጥኖ ደረሰልኝ ሳለሁ በትካዜ * 2
 ይቅርታህ በአይኔ በፊቴ ነውና ሃጢያቴ ቢበዛም አልተውከኝምና
 እግዚአብሔር የሕይወቴ መሸሸጊያዬ ነው
 በእርሱም ትመካለች እድል ፈንታዋ ነው * 2
 
 
 
 
 ነፍሴን ሀዘን ከቧት እጅጉን ተጨነቃ ስትጮህ ወደ አንተ ምህረትህን ናፍቃ እራርተህ ፈወስካት አነሳሃት ጌታ
 መቼም አይረሳም የአንተ ውለታ * 2
 አጥንቶቼ ደክመው በለቅሶ በዋይታ አይኔም በሀዘኔ በእንባ ተሞልታ ልቤ ታውኮብኝ ሰላሜ ደፍርሶ
 አዳነኝ ጌታዬ በምህረቱ ዳሶ * 2
 `},{ 'title' :`በገና አንስተን`, 'lyrics':` በገና አንስተን መሰንቆን እናመስግነው ስምህን
 እንደ አምላካችን ማንም የለም * 2
 ይክበር ይመስገን ለዘለዓለም * 2 ዓለም ሞኝነት ይመስለዋል ለአንተ መንበርከክ ይከብደዋል
 ፍቅርህን ቀምሰን ዝም	አንልም * 2
 እንዘምራለን ለዘለዓለም * 2
 ሞኝነት ለኔ መች ሆነና ፊትህ ያቆመኝ ለምስጋና
 እንድቀኝልህ ግድ የሚለኝ * 2
 ፍቅርህ ብቻ ነው የማረከኝ * 2
 ፈውስን ስትሰጠን ስትባርከን ፍቅርህን ልከህ ስትጎበኘን ጉልበት ይጸናል ባንተ ጸጋ * 2
 ማነው የሚከፍለው የአንተን ዋጋ * 2
 `},{ 'title' :`ለማርያም እንዘምራለን`, 'lyrics':` ለማርያም * 2 እንዘምራለን ለዘለዓለም * 2
 የተዘጋጅ በር	ለዘለዓለም ህዝቅኤል ብሏል ለዘለዓለም
 ንጽህይት ናት በእውነት በፍፁም ድንግል	
 አብነት አድርገን እኛም እርሱን	
 በፍፁም ፍቅር እንዘምራለን * 2
 የዋህት እርግብ	ለዘለዓለም ሠላም አብሳሪ ለዘለዓለም ጨለማ ሕይወቴን ብርሃንን አብሪ	
 
 
 
 
 እማጸንሻለሁ ድንግል ለነፍሴ አደራ ቅድስት አንቺ ነሽ ዋሴ * 2
 እጅግ	የበዛ ነው ለዘለዓለም ያለኝ ፍቅር	ለዘለዓለም አይወሰንም አይነገርም በእርሷ ደስ ይለኛል ሐሴት አደርጋለሁ 
 ስሟን እየጠራሁ እዘምራለሁ * 2
 ንኢ ንኢ ስላት ለዘለዓለም ቀንና ሌሊት	ለዘለዓለም አትለየኝም ለእኔስ ቅርቤ ናት እጹብ እጹብ ብለው አመሰገኗት 
 ክብርዋን ሊገልጹ ቢያጥራቸው ቃላት * 2
 `},{ 'title' :`ወይቤሎሙ ሐሩ`, 'lyrics':` ወይቤሎሙ ሐሩ ወመሐሩ ለዘየአምን * 2
 ወንጌለ መንግስተ ሰማያት * 4
 በሕይወታችሁ ስበኩ በኑሮአችሁ ከጽንፍ እስከ ጽንፍ
 በዓለም ዙሪያ አዳርሱ ሳትሰለቹ ደመና ጠቅሳችሁ እንደወፍ
 ወንጌለ መንግስተ ሰማያት * 2
 በሃጢያት ገመድ ተይዞ ለታሰረው በዓለም ጽልመት ለተዋጠው የእውነቱ መንገድ ብርሃኑ ለጠፋበት በሁለንተናው ፈንጥቁበት
 ወንጌለ መንግስተ ሰማያት * 2
 የጽድቅ እንጀራ በማጣት ለተራበው የሕይወትን ውሃ ለተጠማው
 ቀቢጸ ተስፋ በልቡ ላደረበት የወንጌልን ማዕድ አቅርቡለት
 ወንጌለ መንግስተ ሰማያት * 2 አይንተ ወንጌል ካህናት ሊቃውንት ለተልዕኮ የጠራችሁ
 ከእውነተኛው ምንጭ ከጌታ ከባህሩ የሕይወትን ውሃ የጠጣችሁ
 ወንጌለ መንግስተ ሰማያት * 2
 ሁለንተናችሁ ይነበብ ፊደል ይሁን በትዕዛዙ ሔዳችሁ
 ስራችሁ ይብራ በዓለም እንደ ሻማ
 
 
 
 
 በሕይወታችሁ ሰብካችሁ ወንጌለ መንግስተ ሰማያት * 2
 `},{ 'title' :`እርግብየ`, 'lyrics':` እርግብ * 2 ማርያም እሙ ለእግዚእየ በቀለመ ወርቅ ጻአፊ ስምየ
 በአምደ ብርሃን ጻአፊ ስምየ በቀለመ ወርቅ ጻአፊ ስምየ
 የተመረጥሽ ጌጤ ፈርጤ ሽልማቴ
 የክብሬ አክሊል ነሽ ለኔ እመቤቴ እርግብየ ወደ አንቺ እጮሃለሁ በችግሬ ጊዜ እንድታርቂልኝ የልቤን ትካዜ እርግብየ
 የማትፈርሺ መቅደስ ንጽህት አዳራሽ የመለኮት እሳት በማህጸንሽ የያዝሽ እርግብየ የድህነቴ ምክንያት የሕይወቴ ፋና
 የችግሬ ደራሽ ርህርህተ ህሊና እርግብየ ስጠራ ስምሽን ከጠዋት እስከ ማታ ፈጥነሽ ድረሺልኝ እንዳልንገላታ እርግብየ የነቢያት ትንቢት የሰማዕታት አክሊል ምዕረገ ጸሎት የወርቅ መሰላል
 ምርኩዝ መደገፊያ የሐይማኖት በትር
 ሆነሽ የተገኘሽ የሕይወት ማህደር እርግብየ መንገዴ ጨልሞ ወድቄ እንዳልቀር
 ደግፈሽ አሻግሪኝ ያን የሃጢያት ባህር እርግብየ
 `},{ 'title' :`ስምሽን ጠርቼ`, 'lyrics':` ስምሽን ጠርቼ መቼ አፍራለሁ ማርያም ብዬ መቼ እወድቃለሁ የምጽናናበት ስምሽ ነውና
 ድንግል ሆይ ላቅርብ ላንቺ ምስጋና ጨለማ ውጦኝ በጠላት ሀገር ለዘመናትም ስረገጥ ስኖር ዲያብሎስ ማርኮ ሲያሰቃየኝ የዓለሙን መድን ወለድሽልኝ
 ከአባቶቼ ርስት ከሀገር ወጥቼ በአህዛብ ሀገር ስኖር ተሽጬ
 
 
 
 
 
 
 ደርሰሽ አጽናንተሽ አከበርሽኝ ብቸኝነቴን አስረሳሽኝ
 ድንኳኑ ሞልቶ ሰዉ ታድሞ አስተናባሪው በጭንቀት ቆሞ ምን አቀርባለሁ ብዬ ስቸገር
 ምልጃሽ ደርሶልኝ ዳንኩኝ ከማፈር ያሰብኩት ሀሳብ ደመና ሆኖ
 ቢበተንብኝ እንደ ጉም ተኖ ይሆናል ያልኩት ሳይሆን ቢቀርም
 በእመ አምላክ እኔስ ተስፋ አልቆርጥም እናት አባቴ ባያስታውሱኝ
 ይህቺ ዓለም ንቃ ገፍታ ብትተወኝ አንቺ ካለሽኝ ምን እሆናለሁ አውሎ ነፋሱን ባህሩን አልፋለሁ
 ጠላቴ ደርሶ ቢያንገላታኝም መከራ አብዝቶ ቢያስጨንቀኝም አላቋርጥም ያንቺን ምስጋና ውለታሽ ድንግል አለብኝና
 ክፉዎች ደርሰው ቢዝቱብኝም አንቺን መውደዴን አያስተዉኝም በአህዛብ መሃል ስምሽን ስጠራ መከታ ሁኚኝ እናቴ አደራ
 `},{ 'title' :`አንቺን የያዘ ሰው`, 'lyrics':` አንቺን የያዘ ሰው ምን ይጎድልበታል በምልጃሽ በረከት ቤቱ ሞልቶለታል ዘር መከር ባይኖረው ጎተራው ባይሞላ
 ሁሉም ይሸፈናል በረድኤትሽ ጥላ * 2 በረከትሽ ብዙ የደናግል ገንዘብ የምስኪናን እናት የርሁባን ቀለብ ለሁሉ መጋቢ ጸጋሽ የማይጎድል
 ስምሽ ጥዑም ምግብ ከረሃብ የሚያስጥል * 2
 አንቺ ብትመጪ ከምስኪኗ ቤቴ እንደ መጥምቁ እናት በዛልኝ ሐሴቴ
 የአዲስ ኪዳን ቁርባን መንበር ጠረጴዛ
 ጽድቅን አሸተትን የሕይወትሽን መዓዛ * 2
 ልቤ ተጠራጥሮ ኪዳንሽን ካልከዳ ልመናም አልወርድም አልይዝም አኩፋዳ
 
 
 
 
 
 ሁሉን እየሞላሽ መመገብ ታውቂያለሽ ቢዝቁት የማያልቅ ጸጋና ሀብት አለሽ * 2
 የእግዚአብሔር ማረፊያ ኮሬባዊት ዋሻ የሕይወት ውሃ ምንጭ የህግ መፍሰሻ ነበልባል ተዋህዶሽ ሙሴስ አንቺን አይቷል
 ጫማውን አውልቆ በፊትሽ ተደፍቷል * 2
 `},{ 'title' :`እዘምራለሁ`, 'lyrics':` እዘምራለሁ ለእግዚአብሔር በፍፁም ደስታ ላዳነኝ አምላክ ላቆመኝ ከሰዎች ተርታ * 2
 እንዳለፈ ውሃ መከራዬን ያስረሳኝ እርሱ ነው በእጆቹ ደግፎ ለምስጋና ያቆመኝ በጸጋው
 መጽናናቴ እያልኩ የምጠራው ውለታው ማርኮኝ ነው ፍቅሩ አስደነቀኝ ምህረቱ ለእኔ ያደረገው
 ኃይልህ በድካሜ እንዲገለጥ	ይህን አድርገሃል ወጀቡን ገስጸህ ማዕበሉን እኔን አድነሃል በጠላቴ ፊት በዘይቱ ራሴን ቀብቶኛል
 ወደቀ ሲሉ ጠላቶቼ ሐይሌን አድሶታል
 በሃጢያት ብረክስም በምህረቱ እኔን ጎብኝቶኛል ፈፅሞ እንዳልጠፋ በመዳፉ በእጆቹ ቀርጾኛል ተስፋ ያደረግኩት ምንም የለም ጌታ ካንተ በቀር ወጥመዴን ስበር ሰንሰለቴን የሃጢያቴን ቀንበር
 በሁሉ አንተ ጌታ እንደሆንክ አሁን አውቂያለሁ ሐይልህ በድካሜ ተገለጠ ሁሉን አልፌአለሁ ይሁን ያልከውን በሕይወቴ ፈፀምክ በፍቅርህ ዳግመኛ በእጅህ ተሰራሁኝ በበጎ ፈቃድህ
 `},{ 'title' :`ሰረገላዎችህ`, 'lyrics':` ሰረገላዎችህ የእሳት ናቸው የሌጌዎን ጭፍሮች ማይችሏቸው የገሐነም ደጆች ማይችሏቸው አንተ ብቻ ቅዱስ ሐያል ጌታ
 ሳመልክህ እኖራለሁ ጠዋት ማታ * 2 በእሳት ሰረገላ ታጥሯል መንገዳችን ግያዝ ሆይ አትፍራ አለ ፈጣሪያችን የጠላትን ምሽግ በቃሉ ይቆርጣል
 ከእኛ ጋራ ያለው ከእነርሱ ይበልጣል
 
 
 
 
 ከቴማን ተራራ ከፋራን ሲወርድ ጠላት ይጨነቃል በድምጹ ሞገድ ጦረኛ አያበዛም ሞአብን ሲመታ በአህያ መንጋጋ ሺውን ጥሏል ጌታ
 የጥልቁን መሠረት በነፋስ አስሮታል ከሰማያት በላይ ዙፋኑን ዘርግቷል ዘንባባ ይዛችሁ ግቡ ከመቅደሱ በምስጋናው እሳት እንድትቀደሱ
 ወደረኞቻችን ከቁጥር ቢበዙ
 እንደ ቃየል ልጆች ሾተል አንመዝም እንጀራ መግበን እንሰዳቸዋለን በቀልና ፍርድን ለአምላካችን ትተን
 `},{ 'title' :`ዛሬም አለሽ`, 'lyrics':` ዛሬም አለሽ በልቤ * 3
 ድንግል ሆይ ውለታሽ አይጠፋም ከሃሳቤ እንደ ሃጢአቴ ብዛት እንደ በደሌማ
 የጥልቁ ሰንሰለት ሲያንሰኝ ነው ጨለማ ግን ያንቺ ሆንኩና ሁሉንም አለፍኩት ያንን የሞት ባህር በምልጃሽ ቀዘፍኩት
 አርፏል ልቤ ባንቺ ባዛኝቷ ማርያም ውስጤ እየፈሰሰ ፍቅርና ሠላም ህመሜን ቢያስረሳኝ የውዳሴሽ ቃና እመቤቴ እላለሁ ዛሬም አንደ ገና
 እናታችን ጽዮን ሰው ሁሉ ይልሻል ዳዊት በበገና ያመሰግንሻል የሐሴቦን ነገስታት ለክብርሽ ዘመሩ
 የማትፈርሽው መቅደስ የእግዚአብሔር ሀገሩ እጅግ ብዙ ነገር አድርገሽልኛል
 ይቅር ባይም ልጅሽ በፍቅር አይቶኛል እኔስ እኖራለሁ ድንግል ባንቺ ጥላ ጨለማን አላይም ከእንግዲህ በኃላ
 `},{ 'title' :`ያ ድሃ ተጣራ`, 'lyrics':` ያ ድሃ ተጣራ እግዚአብሔርም ሰማው ደርሶ ስላንኳኳ ከጸባኦት እንባው አምላክ በቸርነት በምህረት ጎበኘው ባለቀሰ ጊዜ ግራ የገባው ሰው
 
 
 
 
 መሻትህ ብቻ ነው የሚፈለግብህ እግዚአብሔርን ጥራ እመን ትድናለህ * 2
 ንገረው ችግርህን የውስጥህን ብሶት ይሽረዋልና አስፈሪውን ሕይወት ግራ የተጋባው የተከፋው ገጽህ
 ይበራል በጸሎት አምላክህን ጠርተህ ለወገን ለዘመድ ያስቸገረው መላ
 ሲቀል ታየዋለህ ካነባህ በኋላ ሳግና ንዴትህ ይቀራል ይሻራል
 በእርሱ ፈንታ ልብህ ሰላም ይሞላዋል በከንቱ መጨነቅ እራስን መጥላቱ ነውና የአጋንንት መግቢያ ምልክቱ ሀዘን በህሊናህ በፈሰሰ ጊዜ ንገረው ለአምላክህ የልብህን ትካዜ
 `},{ 'title' :`ርሆቦት`, 'lyrics':` ርሆቦት እያልን እንዘምር በእልልታ ጌታ አብዝቶናል ውሎልናል ውለታ የዝማሬ ነው የምስጋና ሰዓቱ
 የእግዚአብሔር ልጆች ክንዳችሁን አበርቱ ቃኝተነዋል በገና መሰንቆውን ላናቋርጥ በፊቱ ምስጋናውን በዕጣኑ ጢስ ታጅቧል ውዳሴያችን ይሰማናል ያበዛል አምላካችን
 ለአገልግሎት ስንወጣ ጥቂት ነበርን በረሃውን	ስንጓዝ በዛ ዘመን ለመለምን በፍቅሩ እንደ ዋርካ ለዚህ ቀን አስቦናል ጌታ ለካ
 ሁሉም ሆኗል በጊዜው በፈቃዱ እንቅፋቱም ተነስቷል ከመንገዱ ያነሳሳን ያበረታናል ገና
 ዓለምን እንከድናለን በምስጋና ስናመሰግን ውለን እናድራለን
 ያለድካም በፊቱ እንቆማለን
 እንኳን በምድር በሰማይ በበጉ ፊት ዝማሪያችን ይሰማል እንደ ዳዊት
 
 
 
 
 
 
 
 `},{ 'title' :`ቸርነትህ ነው`, 'lyrics':` ቸርነትህ ነው ያደረሰኝ እስከ ዛሬ ቸርነትህ ነው የጠበቀኝ እስከ ዛሬ ላመስግንህ የኔ ጌታ በዝማሬ * 2
 መክሊቱን ቀብሬ ባሳዝንህ መብራቴንም ይዤ ባልጠብቅህ በታላቅ ይቅርታህ እንዳትረሳኝ በፍቅርህ ጎብኝተህ ከሞት አውጣኝ
 ከቤትህ እርቄ መች ጠገብኩኝ በርሃብ በርዛት ተቸገርኩኝ አምናለሁ አምላኬ እንድትምረኝ ለይቅርታህ መጣሁ ተቀበለኝ
 አንዳች እንደሌለኝ አውቀዋለሁ ባንተ ቸርነት ግን እመካለሁ የከበደው ሸክሜ ይቀለኛል ይቅርታህ ለባሪያህ ይደርሰኛል
 በመቅደስህ ቆሜ ለመዘመር ስራህን ለትውልድ ለመመስከር እኔ ማነኝ ብዬ አስባለሁ አምላክ ቸርነትህን አደንቃለሁ
 በሰው እጅ መመካት አቁሚያለሁ እረዳቴ አንተ ነህ አውቂያለሁ አንተ ከጠበቅከኝ በሕይወቴ ቅጥሬ አይደፈርም መድሃኒቴ
 የእኔን ስራ ተወው ተግባሬን የመስቀሉን ነገር መርሳቴን አዚሜን አንስተህ አንተን ልይህ ኢየሱስ ክርስቶስ አምላኬ ነህ
 `},{ 'title' :`ሞገድ	ሲገፋኝ`, 'lyrics':` ሞገድ ሲመታኝ ማዕበሉ ማን ያድነዋል ሁሉም ሲሉ
 በሰላም አለፍኩ በፀጥታ * 2
 ሁሉ ተችሎ ላንተ ጌታ * 2
 በአንተስ ቁስል ተፈወስኩኝ ጌታ በፍቅርህ ተማረኩኝ
 
 
 
 
 
 
 ሞቴን ሽረኸው ባንተ ሞት * 2
 ይኸው አቆምከኝ በሕይወት * 2
 ደጅ ስጠናህ ስማጸንህ መቼ ጨከነ ጌታ ልብህ
 እንደ ቀራጩ አመሰገንኩ * 2
 ምህረት ጸጋህን ከእጅህ ለበስኩ * 2 ዘውትር እልል ብል ብዘምር ስለገባኝ ነው ያንተ ፍቅር
 ጌታ እምጠራው ስምህን * 2
 ለውጠኸው ነው ታሪኬን * 2
 አይኖቼ አያዩም ካንተ በቀር የምትወደድ የምትፈቀር ዘመድ ወገኔ ሆነኸኛል * 2
 እኔን የሚችል የት ይገኛል * 2
 `},{ 'title' :`ሐረገወይን`, 'lyrics':` ሐረገወይን ነሽ ድንግል የወልድ እናቱ
 ብጽእት ይሉሻል እመአምላክ * 2
 አንቺን ትውልድ ሁሉ
 ስምሽ ልዩ ነው ለኛ ቤዛዊተ ኩሉ የያዕቆብ መሰላል የሙሴ በትር የእሳትን ባህር የምታሻግር
 እመ ብዙሃን ናት የተሰጠች ለእኛ
 ጥላ ከለላ ናት ከጥፋት መዳኛ * 2
 ፍቅርና ሠላም የተገለጠባት
 ሐረገ እግዚአብሔር ድንግል እመቤት ናት የታጠረች ተክል የተዘጋች	ደጃፍ
 ለድንግል ምስጋና ይድረስ ከአጥናፍ አጥናፍ * 2 እጹብ ድንቅ ነገር ለእኛ ተሰጥቶናል ሕይወት የምትለምን እናት አግኝተናል እስከ ቀራንዮ ከጸና ጉዟችን
 ድንግል ትገኛለች ያደራ እናታችን * 2
 
 
 
 
 
 
 
 
 `},{ 'title' :`አስፈሪ ነበልባል`, 'lyrics':` አስፈሪ ነበልባል ሁሉንም አልፌ ይኸው በአምላኬ ቆምኩኝ ተደግፌ
 ምስጋና አቀርባለሁ ሁሉን ቻይ ለሆነው እንድዘምርለት ልቤን ለከፈተው
 ለሰው ያልነገርኩት በውስጤ የቀረ ያሳለፍኩት ስቃይ መከራ ነበረ
 ወደ አንተ አልቅሼ ፈታህልኝ አምላክ አይተህ ቸል አላልከኝ በባሪያህ አልጨከንክ
 አምላክህ የት አለ ሲሉኝ ጠላቶቼ አጥምደው ይዘውኝ እጃቸው ገብቼ ሀዘን ነፍሴን ከቧት መድረሻ ጠፍቶኝ ፈጥነህ ደረስክና ከሞት አዳንከኝ
 ከእንግዲህ ወዲህ እኔ ተስፋ አልቆርጥም ስራህን አይቼ ከቶ አልናወጥም
 ወድቄ እንዳልቀር አስተምረኸኛል ወጥመዱን ሰባብረህ ለዚህ አብቅተኸኛል
 `},{ 'title' :`ስምህ በሁሉ ተመሰገነ`, 'lyrics':` ስምህ በሁሉ ተመሰገነ ከክብር በላይ ክብርህ ገነነ አንተን ማወደስ ያስደስተናል
 ስምህን ማክበር ግብራችን ሆኗል
 አምላክ ተመስገን በሰማያት ስምህ ይወደስ በፍጥረታት
 ከህጻናት አፍ ምስጋና ይውጣ * 2
 አንተን ማመስገን ይሁን የእኛ እጣ * 2
 በምግብ እጦት ብንሰቃይም ማህሌትህን አናቋርጥም
 የመከራ ዶፍ ቢወርድብንም * 2
 እንዘምራለን ለአምላካችን ስም * 2
 ሰማዩ ዝናብ ደመና ቢያጣ ፍቅርህ በእኛ ውስጥ አላቋረጠም ቸርነትህን እንጠብቃለን * 2
 ከአንተ ደጅ ጌታ የት እንሄዳለን * 2
 
 
 
 
 
 `},{ 'title' :`ማርያም አርጋለች`, 'lyrics':` ማርያም አርጋለች ወደ ገነት * 4 የሰማይ መላዕክት እያረጓጓት * 2 እሷም እንደ ልጅዋ ተነስታለች * 2
 የአባትዋ ዳዊትን ትንቢት ልትፈፅም ወርቁን ተጎናጽፋ በቀኙ ልትቆም ወደ አምላክ ማደሪያ ወደ ሰማያት
 አረገች በእልልታ ድንግል የእኛ እናት አርጋለች ማርያም ተነስታለች
 ሰማያት ይከፈት ደመናም ይዘርጋ ዝምታም አይኖርም እመ አምላክ አርጋ አንደበት ይከፈት ማርያምን ያመስግን ከዘለዓለም ጥፋት በምልጃዋ እንድንድን አርጋለች ማርያም ተነስታለች
 የአምላክ ማደሪያ የ ቅዱስ ስጋሽ አምላክን ያቀፉት እነዛ እጆችሽ ሙስና መቃብር ይዞ አላስቀረሽም
 ተነስተዋል በክብር በእምነት አየናቸው አርጋለች ማርያም ተነስታለች
 ሐዋርያት አበው እንኳን ደስ አላችሁ በክብር አረገች ማርያም ሞገሳችሁ ወደ ዓለምም ውጡ ስበኗን ይዛችሁ የድንግል እርገቷን ንገሩ ተግታችሁ አርጋለች ማርያም ተነስታለች
 `},{ 'title' :`ማን አለን`, 'lyrics':` ማን አለን ጌታ ሆይ ካንተ በቀር * 2
 በሰማይ ሆነ በዚህ ምድር ማን	አለን ከአንተ በቀር
 ዛሬ ወዳጅ ነገ ጠላት ይለወጣል የሰው ሕይወት ያመናቸው ገፍተው ጣሉን አንተ ብቻ አትለየን
 ሕይወታችን መልኩ ወይቦ መንገዳችን በሾህ ተከቦ ጠላት በዝቶ ስንሰቃይ ታገልክልን ነህ ኤልሻዳይ
 
 
 
 
 ባይደላንም የምድር ኑሮ ብናሰማም ለቅሶና ሮሮ ባይሳካ ውጥናችን
 ባንተ ያምራል ፍጻሜያችን እንኳን ጮኸን ሳንለምን
 አፍሮ አይገባም ባዶ እጃችን ስቦ ማውጣት እስኪያቅተን በዓሳ ይመላል መረባችን
 `},{ 'title' :`መላዕክቱ`, 'lyrics':` መላዕክቱ በፊቱ ይቆማሉ ሠራዊቱ በፊቱ ይሰግዳሉ
 ሐያል አምላክ እግዚአብሔር እያሉ * 2 በክብረ መንግስቱ በነጭ ዙፋን ላይ ዘለዓለም ይኖራል ከሰማያት በላይ ለሚታዘዙለት እጁን ይዘረጋል ጨለማውን በሰላም ያነጋል
 መብረቅ ነጎድጓዱ የምስጋናው ጅረት ዘወትር ይፈሳል በቀንና ሌሊት የእሳት መጋረጃው ይነዳል ከፊቱ ተቀኙለት ሊቀ መላዕክቱ
 ትናንትናም ዛሬም እርሱ ህያው ነው ሞትን አሸንፎ በአባቱ ቀኝ ያለው ዳግመኛ ሲመጣ እርሱን ለመቀበል በደመና እንነጠቃለን
 በወርቅ ፅና ላይ ብዙ ዕጣን ጨምረው ዙፋኑን ያጥናሉ በበጉ ፊት ቆመው አዲሱን ምስጋና አዲሱን ውዳሴ ያቀርባሉ ለቅድስት ስላሴ
 `},{ 'title' :`ገብርኤል`, 'lyrics':` ገብርኤል * 2 ስለው ሰምቶ መጣ ወደኔ ፈጥኖ
 ሰንሰለቴን በጠሰው የአንበሶቹን አፍ ዘግቶ ገብርኤል	ስጋዬ ሳይረግፍ በአናብስቱ ጥፍር
 ታድጎኛል ምልጃው የመልአኩ ክብር
 
 
 
 
 
 
 በረሀብ ለነደዱ አናብስት ሲጥሉኝ
 አንተ አለኸኝና ክንፎችህ ከለሉኝ ገብርኤል ከአፎቱ ሲመዘዝ የጠላቴ ሰይፍ
 አጽንቶ ይዞኛል ፍሬዬ ሳይረግፍ
 አደገድጋለሁ አለኝና ፍቅሩ
  በእሳት ክንፍ ታጥሯል የደጄ ድንበሩ ገብርኤል	በሰይፍ ተመትርዋል የክፉዎች ክህደት
 ሐብሉ ተበጥሷል የአመጹ ሰንሰለት
 ከቅዱሱ ድንጋይ ሕይወት የሚያፈልቀው
 እንዳልለይ እረዳኝ ክብሬን ከፍ አደረገው ገብርኤል አለው ልዩ ስልጣን ከአምላክ የተሰጠው
 ይመጣል ወደ እኛ እሳቱን ሊያጠፋው
 እኛም እናምናለን ሰምተናል አይተናል
 የመላዕክት አለቃ ከአምላክ ያማልዳል
 `},{ 'title' :`ሌላ ምስጋና`, 'lyrics':` እመቤቴ ሆይ ሀብቴ ነሽና ሳመሰግንሽ ዲያቢሎስ ቢቀና ገና አለኝ ገና አዲስ ምስጋና ገና አለኝ ላንቺ አዲስ ምስጋና
 ድልድይ ሆነሽን	ተሻግረናል እኛ አንወሰድም አንሞትም ዳግመኛ እናት አለችን በላይ በሰማይ አማላጃችን	እሙ ለአዶናይ
 ግዮን ከቦታል የርስትሽን ሀገር ጣፋጭ ተአምርሽ ይኖራል ሲነገር ዋሻው ያበራል ሜዳው ሳር ቅጠሉ መለኮሳቱ ንኢ ንኢ ሲሉ
 ተፍገመገመ ራደ ጠላታችን የልጅሽ ሞገስ ሰፍኖ በላያችን
 ሞገዱም ይጩህ ዲያቢሎስም ያውራ ከእሳቱ አንወድቅም ሳለን ካንቺ ጋራ
 ቤትሽ አድገናል በአማረው እልፍኝሽ የንጉሱ እናት እመ ብዙሃን ነሽ የራማው መላዕክት ክንፎቹን ዘርግቷል ወደ ገሊላ ምስጋና ተሰምቷል
 
 
 
 
 
 
 
 `},{ 'title' :`አንተ ግን አንተ ነህ`, 'lyrics':` አንተ ግን አንተ ነህ በፀባኦት ያለህ ዘለዓለም	የምትኖር ሁሉን አሳልፈህ የሁሉ ባለቤት አንተ ግን አንተ ነህ
 ደመናት ባይኖሩ ዝናብም ባይሰጡ ጨረቃና ፀሐይ ብርሃን ባያወጡ የፍጥረታት ፀባይ ሁሉም ቢቀያየር
 አንተ ግን አንተ ነህ ህያው እግዚአብሔር የምድር ሐያላን ትላንት የነበሩ
 በጉልበት በስልጣን እጅግ የተፈሩ ቦታውን ለቀዋል በጊዜአቸው አልፈው
 አንተ ግን አንተ ነህ መንግስትህ ህያው ነው ሁሉን ስትለውጥ የማትለወጥ እንደየስራው የእጁን የምትሰጥ ማለዳ ማለዳ አዲስ ነው ስምህ ቀናት የመይቆጥሩት አንተ ብቻ ነህ
 አመድ ሲሆኑ አየን የግሪክ አማልክት በወርቅ እና በብር በእጅ የተሰሩት ዘመን የማይሽርህ እንዲህ እነደዋዛ አንተ ግን አንተ ነህ ፈጥረህ የምትገዛ
 `},{ 'title' :`ሊረዳኝ መጣ`, 'lyrics':` ሊረዳኝ መጣ ሃያል ሚካኤል ይጠብቀኛል ሃያል ቅዱስ ሚካኤል
 የሙሴ ጠባቂ ሃያል ሚካኤል
 መንገድ የመራኸው ሃያል ቅዱስ ሚካኤል የኤርትራን ባህር ሃያል ሚካኤል
 ከፍለህ ያሻገርከው ሃያል ቅዱስ ሚካኤል ክብርህ ከመላዕክት ሃያል ሚካኤል
 ከፍ ከፍ ያለ ነው ሃያል ቅዱስ ሚካኤል ታላቁ አለቃ ሃያል ሚካኤል
 ከቶ እንዳንተ ማነው ሃያል ሚካኤል በሃጢያት በረሃ ሃያል ሚካኤል
 መጠለያ ሁነን ሃያል ቅዱስ ሚካኤል ጠላት በመንገድ ላይ ሃያል ሚካኤል እንዳያስፈራራን ሃያል ቅዱስ ሚካኤል
 
 
 
 
 
 
 `},{ 'title' :`ሃጢያቴ በዛ`, 'lyrics':` ሃጢያቴ በዛ እመቤቴ ምህረት ላኪልኝ ለሕይወቴ የፈጣሪ እናት አዛኝት * 2
 ባንቺ ነው ማግኘት የጽድቅ ሕይወት * 2 ከሲኦል አውጪኝ አዛኝት የጻድቃን ውበት እመቤት
 ሠላማዊ እናት ሀገረ እግዚአብሔር * 2
 ባንቺ ነው መውጣት ከሃጢያት ቀንበር * 2
 የሚሰግዱልሽ ጻድቃን ሰማዕታት የሚላኩልሽ ቅዱሳን መላዕክት ከእነርሱ ጋር ነይ እመቤቴ * 2
 እንዲታረቀኝ ሰማያዊ አባቴ * 2
 አስታርቂኝ እኔን ከልጅሽ እማልላለሁ ከፊትሽ
 ስምሽን ጠርቶ ያፈረ ማነው * 2
 የአዳም ተስፋ ስራሽ ድንቅ ነው * 2
 የፍቅር እናት እመቤታችን አማልጅን እኛን ከጌታችን
 ዘወትር ነይልኝ እናቴ ማርያም * 2
 ላንቺ ቅርብ ነው መድሃኒዓለም * 2
 `},{ 'title' :`ምስጉን ነው`, 'lyrics':` ምስጉን ነው የተመሰገነ ባሪያውን እኔን ይቅር ያለ ይመስገን ይመስገንልኝ ጎጆዬን አምላክ ሞላልኝ
 እጅህ ሰፊ እንደሆነ አውቃለሁ ጌታዬ የጎደለው ሞልቷል ይድረስ ምስጋናዬ የጣሁትን ከአንተ አግኝቻለሁ
 ሁሉን ነገር ለበጎ ብያለሁ ማቄን የቀደደው ደስታ አስታጠቀኝ ባዶ የነበርኩት ሁሉ ተሰጠኝ
 ሰጭም ነሽም እግዚአብሔር ብቻ ነው የሰው ድርሻ በር ማንኳኳት ነው
 
 
 
 
 
 
 እገፋለሁ እንጂ እኔ አልጨነቅም መሰረቴ አንተ ነህ ከቶ አልናወጥም ስትሰጠኝ የሚታየውን
 እንዳትነሳኝ የዘለዓለሙን ቢሰጥ አያልቅበት ለጋስ ክቡር ጌታ ሁሉን ከወነልኝ በልዩ ችሮታ ድሆች ስንሆን ሁሉ አለንና አምላካችን ይድረሰው ምስጋና
 `},{ 'title' :`ገና እንዘምራለን`, 'lyrics':` ገና እንዘምራለን * 4
 አንደ መላዕክቱ ብርሃንን ለብሰህ ገና እንዘምራለን
 ወላዲት አምላክን ከፊት አስቀድመን በዳዊት በገና መሰንቆ ታጅበን ለስላሴ ክብር ገና እንዘምራለን
 ገና እንዘምራለን በምስጋና ስራ ከሰለጠኑት ጋር
 ልብን የሚያስደስት መዝሙር እየዘመርን ያልተሰማ ዜማ ያልታየ ምስጋና ይፈልቃል አይቀርም ከእኛ ልቦና
 ገና እንዘምራለን
 በትንቢት ሳይሆን በታላቅ ትህትና በልዩ ተመስጦ በፍቅር ልቦና ስራችን ይሆናል ለአምላክ ምስጋና ገና እንዘምራለን
 ዳዊት በተመስጦ እርቃኑን ቢሆንም ሜልኮል በዝማሬው ብትስቅበትም አምላክ ከወደደ እንዲያመሰግነው
 በደስታ እንዳይዘምር ከልካዩ ሰው ምን ነው ገና እንዘምራለን
 `},{ 'title' :`አቤቱ እንዳንተ ማን ነው`, 'lyrics':` አቤቱ እንዳንተ ማነው በፍቅርህ ቤቴን ባረከው
 
 
 
 
 
 
 እንደሳምራዊው ዘይቱን አፍስሶ አዳነኝ ጌታ ምህረቱን አስታውሶ
 መገፋቴን አይተህ ለእኔ ራራህልኝ ስድቤን አስወግደህ ሞገስን ሰጠኸኝ ጥንት እንደሰማሁህ አየሁህ በአይኖቼ
 እቀኝልሃለሁ መቅደስህ ገብቼ * 3
 ከመሰዊያው ስፍራ ብርቅም ከቤትህ መጣህ ልትፈልገኝ ይገርማል ምህረትህ ወዴት ነው ያለኸው ብለህ ጠርተኸኛል
 ግሩም ነህ አምላኬ ማዳንህ ይደንቃል * 3 ዓይንህ አይታኛለች ከላይ ከሰማያት ነፍሴን ታድገሃል የድሃ አደግ አባት ከፊት እየወጣህ መንገዴን መራኸኝ
 ጨለማዬ በርቷል አምላክ ስለሆንከኝ * 3
 የሕይወቴ መዝገብ ሲገለጥ መፅሐፉ ቀርጾኝ አይቻለሁ እኔን በመዳፉ ምስክሩ እኔ ነኝ ፈጽሞ አላፍርበት
 ያደረገልኝን የውዴን ቸርነት * 3
 `},{ 'title' :`ዘንዶውን አሸንፏል`, 'lyrics':` ሚካኤል ስለው ስሙን ስጠራ የአምላኬ ብርሃን በላዬ በራ
 አዛኝ ነው በእውነት ፍጹም አዛኝ
 የሚጠብቀኝ የሚያጽናናኝ * 2
 ከአለቆች ጋራ ህዝቡን የመራ የሚመላለስ በእሳት ተራራ ባህሩም ሸሸ ከማደሪያው የጌታ መላዕክ ሲያናውጸው
 ዘንዶውን አሸንፏል ስሙን በክብር ጽፏል * 2
 ከባዱ ጋራ ሜዳ ሆኖኛል የወህኒው መዝጊያ ተከፍቶልኛል አልናወጥም ከቶም አልፈራ የጌታ መላዕክ ነው ከእኔ ጋራ
 ዘንዶውን አሸንፏል ስሙን በክብር ጽፏል * 2
 ትዕቢተኛውን አሸንፎታል ዲያብሎስ አሁን ዝናሩን ፈቷል ታላቅ ጸጥታ በሠማይ ሆነ
 
 
 
 
 
 እግዚአብሔር ብቻ ስሙ ገነነ
 ዘንዶውን አሸንፏል ስሙን በክብር ጽፏል * 2
 ሚካኤል ሲቆም ፈጥኖ ደራሹ የሚቃወሙን አጥብቀው ሸሹ ታላቁ መላዕክ ከፊት ቀደመ ታሪክ ተሰራ እንባችን ቆመ
 ዘንዶውን አሸንፏል ስሙን በክብር ጽፏል * 2
 `},{ 'title' :`አንቺ የወይን ሐረግ`, 'lyrics':` አንቺ የወይን ሐረግ ድንግል ልምላሜሽ የበዛ * 2
 ምግብ ሆኖ * 2 ተሰጠን ፍሬሽ ለእኛ ቤዛ * 2
 ባንቺ ሰማይነት ድንግል የወጣ ፀሐይ * 2
 ብርሃን ነው * 2 ለጻድቃን ስሙም አዶናይ * 2 ፊደል ትመስያለሽ ድንግል ወንጌል ትወልጃለሽ * 2 ለመላዕክት * 2 የማይቻል ነበልባሉን የቻልሽ * 2
 የመሶብ ምሳሌ ድንግል የኮከብ መገኛ * 2
 በስጋችን በነፍሳችን እንዳንራብ አንቺ አለሽን ለእኛ * 2
 `},{ 'title' :`ባለውለታዬ`, 'lyrics':` ባለውለታዬ * 2 ከአመድ ያነሳኸኝ ከትቢያ ተጥዬ ተመስገን ጌታዬ
 በሩን ቢዘጋብኝ ስምኦን ጨክኖ
 ዝቅ አድርጎ ቢያየኝ ከአይሁድ ጋር ሆኖ እንድቀርብ ወደ እርሱ አዘዘ ጌታዬ እግሩን አጥበዋለሁ ወድቄ በእንባዬ * 2
 የቀራጭ አለቃ ቢሆንም ስራዬ እንድወርድ ከዛፉ አዘዘ ጌታዬ ማዕረጌን መሸከም እስኪያቅተኝ ድረስ
 ቤቴ ተባረከ በኢየሱስ ክርስቶስ * 2
 ድንጋይ የጨበጡ ፈራጆች ከበውኝ ነውሬን ዘርዝረው ጌታ ፊት አቆሙኝ ፈረደችባቸው ሃጢያትም በእነርሱ
 በሰላም ሂጅ ብሎ ምሮኛል ንጉሱ * 2
 የማምነውን አምላክ አውቀዋለሁ እኔ በሰራልኝ ስራ በእድሜ በዘመኔ
 
 
 
 ፍቅሩን ተሸክሟል የልቤ ትከሻ ልለየው አልችልም እስከመጨሻ * 2
 `},{ 'title' :`ድንግል በድንግልና`, 'lyrics':` ድንግል በድንግልና ጸንሳ በድንግልና ትወልዳለች ስሙንም አማኑኤል ትለዋለች
 ገና ሳይጸነስ ዘመኑ ሳይገባ
 ገረድ መሆን ሻተች ትንቢቱን አንብባ ልታያት ናፈቀች	ያችን	ቅድስት እናት ለክብርዋ ተገዝታ ውሃ ልትቀዳለት
 ባርያ	ልሁን አለች ዝቅ አድርጋ ራሷን መች አወቀችና እናቱ መሆኗን
 ጥቂት ለሚሻ ሰው ያውቃል ብዙ መስጠት በማህጸኗ መቅደስ ሲቀድስ ኖረበት
 ሀር ወርቁን ስትፈትል በቤተ መቅደሱ ማደርያው እንድትሆን መረጣት ንጉሱ በህሊናው ተስላ የነበረች ምናብ መሰላል ሆነችው ለአዳም ድህነት ርካብ
 በጎ መዓዛዋን ውበቷን ወደደ
 በማህፀኗ ሊያድር እግዚአብሔር ወረደ ከኪሩቤል ይልቅ ጀርባዋ ተመቸው ንጽህይት ናትና የማትቆረቁረው
 የተዘጋጀ መቅደስ ከቶ እማትከፈት ታትማ የኖረች የክብሩ ሰገነት ማንም አይከፍታትም ጥበብ አላትና የእስራኤል ቅዱስ ገብቶባታልና
 በረቀቀ ጥበብ ድንግል ተደነቀች በሆዷ ቅዳሴን እያስተናገደች
 ጎንበስ አለች ማርያም ውዳሴ ልትሰማ ከቅኔያት ሀገር ከሆዷ ከተማ
 `},{ 'title' :`ድንግል ፈጣሪዋን`, 'lyrics':` ድንግል ፈጣሪዋን ወለደችው በመጠቅለያም ጠቀለለችው የለምና ስፍራ ለእንግዶች ማረፊያ
 ግርግም አስተኛችው በከብቶች ማደሪያ
 
 
 
 
 
 
 ጨነቃት ጠበባት የዳዊት ከተማ የጌታ መወለድ ታምሩ ሲሰማ ወረደ መልአኩ ምስራች ሊያወራ የህጻኑም ክብር በምድር አበራ
 ይህ ምስጢር ታላቅ ነው ከቶ ማይነገር * 2
 ማርያምም በልቧ ትጠብቀው ነበር * 2
 ሰባ ሰገል መጡ ከሩቅ ምስራቅ ሀገር ወርቅ እጣን ከርቤውን ለእርሱ ለመገበር በእናቱም እቅፍ አገኙት ህጻኑን
 ለዓለም ተናገሩ ንጉስ መወለዱን
 ይህ ምስጢር ታላቅ ነው ከቶ ማይነገር * 2
 ማርያምም በልቧ ትጠብቀው ነበር * 2
 የይሁዳ ምድር ምስጋና ተመላች ንጉስ መጥቷልና ከናዝሬት ገሊላ ታምሩን ትናገር ቤቴልሔም ታውራ ዝማሬ ሲውጣት ተረስቶ ቆጠራ
 ይህ ምስጢር ታላቅ ነው ከቶ ማይነገር * 2
 ማርያምም በልቧ ትጠብቀው ነበር * 2
 የማይታይ ታየ ተዳሰሰ እንደ ሰው በጠባቡ ደረት አዳምን መሰለው ገረማት ጥበቡ ታናሿን ሙሽራ ተዋህዷልና ቃል ከስጋ ጋራ
 ይህ ምስጢር ታላቅ ነው ከቶ ማይነገር * 2
 ማርያምም በልቧ ትጠብቀው ነበር * 2
 `},{ 'title' :`በሰማይ ለእግዚአብሔር ምስጋና`, 'lyrics':` በሰማይ ለእግዚአብሔር ምስጋና በምድርም ለሰው ልጅ ሰላም * 2 ተወልዷልና መድሃኒዓለም * 2
 የሞቱ ዘመን ማብቂያው ሲቃረብ መቋጫው ሲደርስ አስፈሪው ወጀብ ከድንግል ማርያም ጌታ ተወለደ የጠብ ግድግዳ በክንዱ ተናደ
 ሰላም ታወጀ ነፃነት ሕይወት ተወልዷልን የዓለም መድሃኒት
 
 
 
 
 
 የሰማይ ዜማ ተሰማ በምድር ባአፈ መላዕክት ለእግዚአብሔር
 ቃሉን አልረሳም የምህረት ኪዳኑን የማዳኑን ቃል ከአፉ የወጣውን መሐላው ጽኑ ጸጸት የሌለበት ላዳነን አምላክ እልል እንበልለት
 አጽናኙን ድምጹን ሰማን በኤፍራታ በዱር አየነው የፍጥረትን ጌታ በሚቆምበር በሚያድርበት ስፍራ እንሰግዳለን በጽዮን ተራራ
 `},{ 'title' :`እሰይ ተወለደ`, 'lyrics':` እሰይ ተወለደ የዓለም መድሃኒት * 3
 ይኸው ተወለደ የዓለም መድሃኒት * 3
 በሶሪያ ታየ ፈጣሪ እንደ እንግዳ * 3
 ብስራተ ልደቱን ለሁሉ ሲያስረዳ * 3
 ትንቢት ተናገሩ ነብያቱ ሁሉ * 3
 የእስራኤል ንጉስ ተወልዷል እያሉ * 3
 ሰባ ሰገል መጡ ሊሰግዱ በሙሉ * 3
 አምላክ ቀዳማዊ ተወልዷል እያሉ * 3
 ሰባሰገል መጡ ይዘው እጅ መንሻ * 3
 ወርቅ እጣን ከርቤውን ለማርያም እጅ መንሻ * 3
 ህጻናት አደሩ ከልደቱ ቤት * 3
 ውሃው ሆኗልና ማርና ወተት * 3
 `},{ 'title' :`ሆሣዕና በሉ`, 'lyrics':` ሆሳዕና በአርያም ሆሳዕና ሆሳዕና ብለን እናቅርብ ምስጋና
 ሆሣዕና በሉ	ሆሣዕና ለወልደ ዳዊት 
 ትህትናን ያሣየን	
 ስሙ ይባረክ	
 ሆሣዕና በሉ	ሆሣዕና ለሰማይ ንጉስ 
 
 
 
 
 
 ግርማን ለብሶ መጣ እኛን ሊቀድስ	
 ሆሣዕና በሉ	ሆሣዕና ለአምላክ ምህረት 
 ተወልዶ ከድንግል	
 እንደ ሕጻናት እረኞች በዋሻ	ሆሣዕና የሰገዱለት 
 የአዳም ልጆች ሁሉ	
 ደግሞም መላዕክት	
 `},{ 'title' :`በእግዚአብሔር ስም የሚመጣ`, 'lyrics':` በእግዚአብሔር ስም የሚመጣ * 2
 የተባረከ ነው ቅዱስ * 2
 ሠላምን የሚያውጅልን
 ፍቅር አንድነትን የሚያጸናልን እውነተኛ መካር የሆነ ለህዝቦች ሠላም የቆመ
 ከሞአብ ምድር የሚያወጣን ከጠላት ወጥመድ የተቤዠን የሕይወት እንጀራ የሆነው በእግዚአብሔር ስም የመጣው
 ለኢየሩሳሌም የሚያነባ ቤተ መቅደስን የሚያጸና
 ለተገፉት ሁሉ መጠጊያቸው የመጽናናት አባት አለኝታቸው
 አዕምሮን የሚያልፍ ሰላም ያለው በጥዑም ቃሉ የሚያጽናናው ነፍሴም እርሱን ወዳ ዘመረች ሆሣዕና በአርያም እያለች
 `},{ 'title' :`ምድረ ቀራንዮ`, 'lyrics':` ምድረ ቀራንዮ ምድረ ጎለጎታ * 2 መድሃኒት ክርስቶስ በአንቺ ተንገላታ የዓለም መድሃኒት በአንቺ ተንገላታ
 መስክሪ አንቺ ምድር ጉኡዚቷ ስፍራ * 2
 መድሃኒት ክርስቶስ ያየብሽ መከራ * 2
 
 
 
 
 የእሾህ አክሊል ጉንጉን	ደፍቶ በራሱ ላይ * 2
 ደሙ እነደ ውሃ ሲፈስ በመስቀሉ ላይ * 2
 እጅና እግሮቹ በችንካር ተመተው * 2 ይቅርታን አድርጎ ለዚያ	ለሃጢያታቸው * 2 ሁሉን ማድረግ ሲችል ስልጣን ሲኖረው * 2 በቀራንዮ መስቀል ፍቅሩን ገለጸው * 2
 መከራ በተራ ሲፈራረቁበት * 2
 በደልም አልሰራም ምንም አይነት ስህተት * 2
 ከሰማያት ወርዶ እንዲህ መዋረዱ * 2
 የእኛን በደል ሃጢያት ክርስቶስ	መወሰዱ * 2
 ፀሐይ ከለከለች ለመስጠት ብርሃን * 2 ለመሸፈን ብላ የአምላኳን እርቃን * 2 በመስቀል ላይ ሆኖ ተጠማሁ እያለ * 2 ተገርፎ ተሰቅሎ ቀራንዮ ዋለ * 2
 በቆረስከው ስጋ ባፈሰስከው ደም * 2 አቤቱ ተራዳን እስከ ዘለዓለም * 2 ቸሩ መድሃኒዓለም እባክህ ማረን * 2
 ደካሞች ነንና ወድቀን እንዳንቀር ደካሞች ነንና ጠፍተን እንዳንቀር
 `},{ 'title' :`ወንበዴ ነበርኩኝ`, 'lyrics':` ወንበዴ ነበርኩኝ ሀገር ያሰለቸው በመስቀል ላይ ሆኖ ታሪኬን ለወጠው አስበኝ ስላልኩት በኋላ ስትመጣ
 ገነትን ለማየት የመጀመሪያ ሰው ሆንኩኝ ባለ ዕጣ
 አቤት ፍቅሩ የእግዚአብሔር * 2 ግሩም ፍቅሩ የእግዚአብሔር * 2 ኃያል ፍቅሩ የእግዚአብሔር * 2
 አስበኝ ስላልኩት አሰበኝ ጌታዬ ወንበዴ ነበርኩኝ ስርቆት ነው ስራዬ
 በመስቀል ላይ ሆኖ ህዝቡን ያስብ ነበር
 እኔስ አላየሁም * 2 እንዲህ ያለ ፍቅር አልታይም ብዬ ሃጢያትን ስሰራ ተመለስ ይለኛል ስሜን እየጠራ
 
 
 
 
 
 
 እንዳልሞትበት ነው በሃጢያት ታስሬ ፍቅሩን አልዘልቀውም * 2 አንደዚህ ዘርዝሬ
 መከራ ሲከበኝ መጥቶ ያጽናናኛል በሀዘኔ ጊዜ እግዚአብሔርም ያዝናል
 ዓይኑ ከእኔ አይርቅም ጥበቃው አይጠፋም
 ስሙን እጠራለሁ * 2 በጌታዬ አላፍርም
 `},{ 'title' :`ተወልዳለችና`, 'lyrics':` ተወልዳለችና የጌታ እናት መድሃኒት * 2 እናመስግናት እናወድሳት እንውደዳት * 2 የአዳምን ሕይወት
 አዳም ሲሰደድ ከጥንት ርስቱ ፊቱን ሸፈነው ጭንቀት ፍርሃቱ እያለቀሰ ገነትን ሲያጣ
 ተስፋ አንቺ ሆንሽው የመዳኑ ዕጣ ሊባኖስ ተራራ ተሰማ ዜና
 ምስራቅ ወለዱ እያቄም ወሐና ዳግማዊት ሔዋን ምክንያት ድህነት ልደቷን ሰማን በቅድስት እለት
 የልደትሽ ቀን ልደታችን ነው በአንቺ ነውና ልጅ የተባልነው ፉሪን የተባልሽ ቅድስት ተራራ በአንቺ መወለድ ዓለሙ በራ
 `},{ 'title' :`ሥላሴን አመስግኑ`, 'lyrics':` ሥላሴን አመስግኑ * 2
 የምድር ፍጥረታት ዘምሩ እልል በሉ * 2 በስመ አብ ወወልድ ወመንፈስ ቅዱስ ምስጋና ይገባል ከምንም በፊት ዓለማትን ሁሉ ለፈጠረ ጌታ
 ምስጋና ይገባል ከጧት እስከ ማታ ኪሩቤል ሱራፌል የሚያመሰግኑህ
 መላዕክት በሰማይ የሚዘምሩልህ እኛም የአዳም ልጆች እንዘምራለን በሰማይ በምድር እንጠረሃለን
 
 
 
 
 ብራብ በስላሴ እጠግባለሁኝ ብጠማም በአምላኬ እረካለሁኝ ስላሴ አምባዬ ክብሬም ናቸውና ሁሌም ይመሩኛል በሕይወት ጎዳና
 `},{ 'title' :`ምስጋናዬን`, 'lyrics':` ምስጋናዬን ለአምላኬ አቀርባለሁ በማደሪያው ገብቼ እሰግድለታለሁ ኤልሻዳይ ነው ጌታ	ሁሉን ቻይ ይፈጸማል አምናለሁ የልቤ ጉዳይ
 ዘንባባዬን ይዤ እንደ ህጻንቱ ሆሣዕና ልበለው ሰግጄ በፊቱ
 ምንም ባዶ ብሆን እውቀት ቢጎድለኝ
 ለስሙ ልዘምር ከልካይም የለኝ * 2
 አምላኬ በፊትህ ቃል አለብኝ እኔ
 ቋንቋዬ	መዝሙር ነው ያንተ እንደ መሆኔ በአሚናዳብ ደጃፍ በቅድመ ታቦቱ
 ያ የክብርህ ኡደት ጠራኝ ማህሌቱ * 2 የሕይወት ትርጉሜ አንተ ነህ ደስታዬ ስምህን ማገልገል ክብሬ ነው ስራዬ ለታመነው ጌታ ምስክር የሆኑ
 ከብረው ተመለሱ ለበረከት ሆኑ * 2
 መነሻዬ አንተ ነህ ጉልበቴና ክብሬ መድረሻዬም አንተ መደምደሚያ ቅጥሬ በጽዮን ተራራ ስትገለጥ ያኔ
 ነጩን ልብስ አልብሰህ አስለሳኝ ለቅኔ * 2
 `},{ 'title' :`ምህረቱ ለዘለዓለም ነውና`, 'lyrics':` ምህረቱ ለዘለዓለም ነውና * 2
 እግዚአብሔር ይመስገን * 2
 ምህረቱ አይኖቼን ከእንባ ከሀዘን ታድጓል
 በዘመኔ ሁሉ መጽናናት ሆኖኛል
 ከቁጥርም በዝቷል ከአዕምሮም በላይ ነው
 ዘመን የማይሽረው ዘለዓለማዊ ነው ምህረቱ ከነገስታት ማዕድ ዕድል ፈንታ ስጠኝ
 ከተረሳሁበት እኔን አስታወሰኝ
 
 
 
 
 ትንሽዋን ጸሎቴን ከትጋት ቆጥሮልኝ
 ከሰላሙ መንደር ከነዓን አገባኝ ምህረቱ ይታደጋል ከሞት ከጥልቅ ለተጣሉ
 ምስራች ይሆናል በሞት ጥላ ላሉ
 የሃጢያትን ክምር ከላያችን ንዶ
 ደስታን ያለብሰናል ማቃችን ቀዶ ምህረቱ	ለጠላት ዘለፋ እኛን መቼ ተወን
 በደልን ደምስሶ ልጆቹ አደረገን
 እስከ ሽበት ድረስ አስከ ሽምግልና
 በዘመኔ ሁሉ ይረዳኛል ገና
 `},{ 'title' :`አብ ወወልድ`, 'lyrics':` አብ ወወልድ	ወመንፈስ ቅዱስን * 2
 አመሰግናለሁ በየዘመን * 2
 አንድ ጌታ አንድ አምላክ አንድ አገዛዝ ስልጣን ከዚህ በቀር ሌላ ምንም አይጨመር ሦስትነታቸውን በስም በአካል በግብር
 ከነዚህ በስተቀር ምንም አይጨመር በሰማያት ያሉ እልፍ አእላፋት
 መናብርት ስልጣናት ሃያላት ሊቃናት ያመሰግናሉ እያሉ በፍቅር
 ቅዱስ ቅዱስ ቅዱስ እግዚአብሔር
 አመሰግናለሁ የተቻለኝን እኔም እንደነርሱ ባልመጣጠን
 አመድና ትቢያ ስሆን አከበረኝ ስምህን ለመጥራት ይኸው አበቃኸኝ
 ይኸው በዚህ ሰዓት በፊትህ ቆሚያለሁ በመቅደስህ ዙሪያ ስምህን እጠራለሁ መንበረ ጸባኦት ትድረስ ምስጋናዬ ያመሰገንኩትም ትቅረብ በጌታዬ
 `},{ 'title' :`እመብርሃን`, 'lyrics':` ትምክህቴ መድሃኒቴ አንቺው ነሽ * 2
 እመብርሃን * 4 ምርኩዛችን
 ሸክም የከበደኝ ደካማ ነኝ እኔ እረዳትም የለኝ ካንቺ በቀር ለእኔ
 
 
 
 
 
 አመ አምላክ ደግፊኝ ቁሚልኝ ከጎኔ እመብርሃን * 4 ምርኩዛችን
 የሃጢያትን ቋጥኝ በጀርባዬ አዝዬ እቅበዘበዛለሁ ተገፎ ጸጋዬ
 በአንቺ እማጸናለሁ ነፍሴን በእጅሽ ጥዬ ምርኩዝ መሰላሌ ጥላ ከለላዬ
 እመብርሃን * 4 ምርኩዛችን
 ልዩነሽ እናቴ ማርያም ድንግል
 ማን አዛኝ እንዳንቺ ግራ ቀኝ ቢባል በአንቺ ላይ አረፈ ልቤ ተረጋጋ የሕይወቴ ተስፋ በአንቺ ተዘረጋ
 እመብርሃን * 4 ምርኩዛችን ፈጽሞ አርቂልኝ የእኔን ክፉ ሽታ በሽቱሽ መዓዛ አድይኝ እርካታ የኪሩቤል አክናፍ የነፍሴ ዋስትና
 ነይ ነይ እመቤቴ ምርኩዜ ነሽና
 እመብርሃን * 4 ምርኩዛችን
 ከፍቅርሽ ምስጋና ዝም እንዳልል ድንግል አንደበቴን ፍችው ህሊናዬም ይቁሰል የፍቅርሽ ማዕበል ይፍሰስ በሕይወቴ በእቅፍሽ አድርጊኝ እንደ ልጅነቴ
 እመብርሃን * 4 ምርኩዛችን
 `},{ 'title' :`ሞት ነው ርሃብ`, 'lyrics':` ሞት ነው ርሃብ ከክርስቶስ ፍቅር የሚለየኝ * 2
 ኃይሉ በእኛ ላይ አድሮ እንበረታለን ጸጋው በእኛ ላይ አድሮ እንበረታለን
 ከአንተ ርቀው ሸሽተው እየሄዱ ጠፋባቸው የጽድቅ መንገዱ ለስጋዊ ጥበብ ሲፈልጉ በመታለል ስንቶቹ አንተን አጡ
 በተዋህዶ የከበርከው ጌታ መድሃኒዓለም ሆንክልን መከታ ስነደክም ሞኞት ሲፈትነን
 ሃይልን ሰጥተህ በእጆችህ አዳንከን
 የዓለም ሰይፍ በእኛ ላይ ተስሏል ስጋችንን ሊቆርጠው አድብቷል
 
 
 
 
 
 ሃይልን ስጠን እንድናሸንፈው ጸጋህ ለእኛ የዕምነት ጋሻችን ነው
 ሐዋርያት ጸጋ በዝቶላቸው ስለ ፍቅር ፈሰሰ ደማቸው ዛሬም ለእኛ ጸጋህን አብዛልን እንዳንደክም ፈተና ሲገጥመን
 ጋሻ ሆነህ እንድትመክትልን
 ቸር አምላክ ሆይ ወደ አንተ እንጮሃለን ቢገጥመንም ችግር ወይ መከራ
 አትለየን ጌታ ከእኛ ጋራ
 `},{ 'title' :`ይለመነናል`, 'lyrics':` ይለመነናል አምላክ አብርሃም ይታደገናል መድሃኒዓለም
 ለፍጥረታት ሁሉ እጁን የዘረጋ * 2
 ቸር እረኛ ነው አልፋና ኦሜጋ * 2 አብርሃም ይስሐቅን ያዕቆብን አስበህ የማልክላቸውን ቃል ኪዳን አስታውሰህ ደካማ ለሆነው ስጋ ሰልጥኖብን
 አትመልስ ጌታ የምህረት ዓይንህን
 ከሰማየ ሰማይ ይድረስ ጩኸታችን * 2
 እንዘን እናልቅስ ስለበደላችን * 2 ባይመለከተን አምላክ አብርሃም በምህረት ዓይኖቹ መድሃኒዓለም ባይዘረጋልን አምላክ አብርሃም
 የፍቅር እጆቹ መድሃኒዓለም
 ሕዝበ እስራኤል ሁሉ ለአምላክ ዘምሩ * 2
 አድኖናልና በሚያስደንቅ ፍቅሩ * 2 ምንም እንኳን ክህደት ቅጥፈት ቢበረታ ስለ አብርሃም ብለህ አልተውከንም ጌታ ለቅዱሳን ያለህ ቃል ኪዳን ሲጸና
 ቀስተ ደመናህን አይተነዋልና
 የእስራኤል አምላክ የማታንቀላፋ * 2
 በፍደቅርህ ታደገን በሞት ሳንጠፋ * 2
 ቃል ኪዳኑ ግሩም አምላክ አብርሃም ምህረቱ የበዛ መድሃኒዓለም
 ርስት ጉልታችን አምላክ አብርሃም የህይወታችን ቤዛ መድሃኒዓለም
 
 
 
 
 ሳይጸየፍ ጌታ ያደፈ ሃጢያቴን * 2
 ከማጥ ውስጥ አወጣኝ ታደጋት ሕይወቴን * 2
 `},{ 'title' :`ባለጸጋ እመቤት`, 'lyrics':` ባለጸጋ እመቤት ባለጸጋ እናት አፍሰናል ከደጅሽ ብዙ በረከት ወጀቡን ቀዝፈናል ብለን ማርያም እንዘምራለን እስከ ዘለዓለም
 ሰው በሌለበት ከተማ ሞት በከበበው ጨለማ ሞገስ ገንዘቤ ዘመዴ በምልጃሽ ቀንቷል መንገዴ ፋና ሆነሽኝ መብራቴ በክብርሽ ደምቆልኝ ቤቴ ሐሴት አረኩኝ ደስታ ያዘነው ገጼ ተፈታ
 እንደኔ ሃጢአት በደል ይገባኝ ነበር መስቀል ጽኑ ኪዳኗ ጋረደኝ እምባ ጸሎቷ ታደገኝ እስኪ ልናገር ስራዋን የምህረት እናት መሆኗን ጽዮን እጆቿን ዘርግታ አስታርቃኛለች ከጌታ
 የክብር ሰንደቅ አርማዬ ወደ መቅደሱ መግቢያዬ አንቺን ይዤአለሁ ጠባቃ የሞቴ ታሪክ አበቃ እልል እላለሁ ከልቤ ልቅሶዬ ሰምሮ ሃሳቤ ድንግል ፍቅር ናት ሰላም ለክብሯ ይስገድ ዓለም
 የእልፍኜ ማማር ውበቴ ትሩፋቴ ነሽ ሙላቴ ስምሽ መቀነት ሆኖኛል የዛለው ክንዴ በርትቷል ባማረው ቤትሽ አድጌ በልጅሽ ፀጋ በልጽጌ በእናትነትሽ በረከት ይኸው ቆሜያለሁ በሕይወት
 `},{ 'title' :`መንግስተ ሥላሴ`, 'lyrics':` አማን አማን * 2
 መንግስተ ሥላሴ ዘለዓለም * 2
 ንግበር ሰብዓ ብለው አማን በአማን አዳምን ፈጥረውት አማን በአማን በቸርነትና በፍቅር ጎበኙት
 ሁሉን በእጁ አርገው ሁሉን አስገዙለት የፍቅር የደስታ አማን በአማን
 የበረከት አባት አማን በአማን መንግስቱ ዘለዓለም ህልፈት የሌለበት በአፈ መላዕክት የሚመሰገኑት
 
 
 
 
 
 የዛን የደግ አባት አማን በአማን የአብርሃምን ቤት አማን በአማን እንደባረኩለት የእኛንም ባርኩልን የቤታችን ዋልታ መሰረት ሁኑልን
 በመከራ ጊዜ አማን በአማን ከጭንቅ የሚያወጣ አማን በአማን ስምህን ሳመሰግን ትረካለች ነፍሴ የነሙሴ አባት የአብርሃሙ ስላሴ
 `},{ 'title' :`እንድናለን`, 'lyrics':` እንድናለን እኛስ እንድናለን * 2
 እንድናለን ድንግል አንቺን ይዘን
 በፍጹም ቸርነት	እንድናለን ስለ ወደደን 
 እንዳንጠፋበት	
 ድንግልን ሰጠን	
 የልባችን ደስታ	እንድናለን እኛስ አግኝተናል 
 በአማላጅነቷ	
 ፈጣሪ ምሮናል	
 ምርኩዝ አንቺን ይዘን	እንድናለን ስንቃችን ሰንቀን 
 በድንግል መሪነት	
 ጽድቅን እንወርሳለን የምታማልደን	እንድናለን ድንግልን ሰጥቶናል 
 የእሳቱን ባህር	
 በእርሷ ተሻግረናል	
 የልባችን ደስታ	እንድናለን እኛስ አግኝተናል 
 በአማላጅነቷ	
 ፈጣሪ ምሮናል	
 `},{ 'title' :`ኦ ሥሉስ ቅዱስ`, 'lyrics':` ኦ ሥሉስ ቅዱስ ተመስገን * 2
 ዓለማትን የፈጠርክ እግዚአብሔር ተመስገን * 2
 
 
 
 
 
 
 አዳም ሳይፈጠር በዙፋንህ ነበርክ በአንድነት ሦስትነት እየተመሰገንክ መላዕክትን ፈጠርክ ስምህን ሊጠሩ
 በምስጋና ጸንተው ካነተ ጋር ሊኖሩ * 2
 የሰውን ልጅ ፈጠርክ ክብርህን እንዲወርስ አንተን በማመስገን ሕይወቱ እንዲቀደስ እኛም ልንጠራህ ባይገባን እንኳን
 ለምስጋና ቆመን ደጅህን አንኳኳን * 2
 የዓለም ሁሉ ንጉስ የዓለም ሁሉ ፈጣሪ ፍጥረትን በሙሉ አውሎ አሳዳሪ ስላሴን ላወድስ ስሉስ ቅዱስ ልበል
 በዓለም ከመክበር በቤታችሁ ልጣል * 2
 ዮርዳኖስን ልሁን ሥላሴን ልያቸው በአንድነት ሦስትነት ቅዱስ ልበላቸው ትባረክ ትቀደስ ነፍሴ በስላሴ
 በአባቶቼ አምላክ በአብርሃም	በሙሴ * 2
 `},{ 'title' :`ገብረሕይወት`, 'lyrics':` ገብረሕይወት * 3 ከኢቲሳ መጣ ሊባርካት ኢትዮጵያ መጣ ሊጠለልባት
 ገብረሕይወት በዝቋላ ገዳም	ገብረሕይወት መቶ ዓመት ጸለየ
 አባታችን ለእኛ ጌታን ተማጸነ
 በባህር ውስጥ ጠልቀህ ማርልኝ ብለሃል
 ለኢትዮጵያውያን ምህረት ለምነሃል ገብረሕይወት አንበሳና ነብር	ገብረሕይወት ይከታተሉሃል
 በጸጋህ ተማርከው ለአንተ ተገዝተዋል
 የቅዱሳን እራስ ገብረ መንፈስ ቅዱስ
 ቃል ኪዳን ተሰጠህ ምድረ ከብድ ስትደርስ ገብረሕይወትየእናት ጡት ሳትቀምስ ገብረሕይወት የኖርክ በበርሃ
 ልብስህ ጸጉር ብቻ ግሩም የአምላክ ስራ
 እንማፀናለን ሁላችን በአንድነት
 ጸሎትህ እንዲያወጣን ከሃጢያት ከመቅሰፍት
 `},{ 'title' :`መጠጊያዬ`, 'lyrics':` መጠጊያዬ ክብሬ ትምክህቴ ማረፊያዬ የዘላለም ቤቴ እናቴ ነሽ ዋሴ ለሕይወቴ
 
 
 
 
 በዓለም ፍቅር ተስቤ ስማረክ ከጽድቅ ተለይቼ ብቻዬን ስለጉድ ፍጻሜዬ ሁሉ ላያምር ለማይጠቅመኝ ነገር እንዲሁ ስኖር ሽቶ መዓዛዬ በአንቺ ነው የሚያምር
 የልቤን ታውቂያለሽ ያሰብኩትን ምኞቴን በሙሉ በነብስ ያለምኩትን በልቤ ውስጥ ይድረስ በረከትሽ ባንቺ ተመክቼ እንዳልጠፋ ልጅሽ በብርሃነ መስቀል ልዳሰስ በእጅሽ
 ወደ እርሱ ለመቅረብ ተስኖኛል ሃጢያቴ ድጥ ሆኖ ዘወትር ይጥለኛል እስከ መቼ ድረስ ከእርሱ ልለይ መድሃኒት ከሌላ ከየትም አላገኝ ድንግል ንጽህናሽ ለእኔ ሆኖ ይገኝ
 እናቴ ርህሩህ ነሽ እጅግ አዛኝ በአማላጅነትሽ በኪዳንሽ ልዳኝ በዛች በፍርድ ሰዓት ፈጣሪዬ
 ከእኔ ራቂ እንዳይል አዝኖብኝ ጌታዬ ድጋፍ አንቺ ሁኚኝ መከታዬ
 `},{ 'title' :`ያዕቆብ ከቤርሳቤት`, 'lyrics':` ያዕቆብ ከቤርሳቤት ወደ ካራን ሲሄድ የለውም ነበረ አማካሪ ዘመድ
 ፀሐይ ጠልቃ ነበር ከዛ እንደ ደረሰ ከእርሱም በታች ድንጋይ ተንተራሰ
 ህልምንም ዓለመ ታላቁን ራዕይ መሰላል ተተክሎ ከምድር እስከ ሰማይ ሲወጡ ሲወርዱ መላዕክት በእርሱ ላይ
 እግዚአብሔርም ቆሞ ከላይ ከጫፏ ላይ የአባቶችህ አምላክ እኔ እግዚአብሔር ነኝ
 ይህን ምድር ለርስትህ እሰጥሃለሁኝ ዘርህ እንደ አሸዋ በምድር ይበዛል በአራቱም ማዕዘን ህዝብህም ይዘራል
 አበው በምሳሌ እንደተናገሩት
 ከምድር እስከ ሰማይ አምላክ የዘረጋው በላይዋ ተቀምጦ በግልፅ የታየባት የያዕቆብ መሰላል እመቤታችን ናት
 ሰማይና ምድር የሚታረቁባት
 ወልደ እገዋለ እምያው የተወለደባት
 
 
 
 መላዕክት ከሰማይ በአንድ የዘመሩባት ታካቋ መሰላል እመቤታችን ናት
 `},{ 'title' :`ስላሴ ዘከሃ`, 'lyrics':` ስላሴ ዘከሃ ስላሴ ዘዝየ * 2
 ሁልጊዜ እለዋለሁ አምላኬ አምላኬየ ዓይኔን ወደ ተራራው አነሳለሁና እረዳቴ የኔ ስላሴ ነውና
 አምባ መጠጊያዬ እኔ በአንተ አላፍርም የማዳንህ ስራ ዛሬም ቢዘገይም
 የጠላት ፍላጻን ሰብሮ ታድጎኛል ማን እንደ ስላሴ እረዳት ሆኖኛል
 ወዶኛል አዳነኝ እግዚአብሔር ክፍሌ ነው ቀብቶኛልና እኔ አመልከዋለው
 እረኛዬ እግዚአብሔር እኔን ቀብቶኛል በለመለመ መስክ ሁሌ ያሰማራኛል ከነጣቂ ተኩላ ይኸው ሰውሮኛል ለማመስገን በቃሁ እርሱ ፈቅዶልኝ
 አንተ ለእኔ ጌታ መሸሸጊያዬ ነህ ከጣርም ከጭንቀትም ትጠብቀኛለህ እንዲታደጋችሁ ስላሴን ፈልጉት ስሙንም በአንድነት ከፍ ከፍ አድርጉት
 `},{ 'title' :`አወድሰኝ ኤፍሬም`, 'lyrics':` አወድሰኝ ኤፍሬም ብላ ጠየቀችው ድንግል እናታችን ባርከኒ ብሎ ወገቡን ታጠቀ ኤፍሬም አባታችን የልጄ በረከት ይደርብህ ብላው ጀመረ ምስጋና
 ወደ ብርሃን ድንኳን ወደ ተከበረው ደረሰው ገባና ልቡ ያዘነ አዳምን ሊያድን ጌታ ወደደ
 ዳግማዊት ሰማይ ማደሪያው ልትሆን እርሱ ፈቀደ የሰማይ ምስጢር በማህጸንሽ ተከናወነ
 ከዘሩ ቀርተሽ በንጽህናሽ የሰው ዘር ዳነ
 ሰዓሊለነ * 2
 አዕምሮውን ልቡን ሳይብን አሳድሪብን ጸጋውን ክብሩን እንዳይነሳን ለምኝልን
 በሔዋን ምክንያት በለስዋን በልተን ገነት ቢዘጋ በአንቺ አማላጅነት ደግሞ ተዛመድን ከአምላካችን ጋር
 
 
 
 
 ትውልድ ሁሉ በክብር አመሰገነ
 የሲኦል ቀንበር በላያችን ላይ ስላልተጫነ
 ሰዓሊለነ * 2
 ሙሴ በሲና ሳትቃጠይ ያየሽ ሐመልማል እግዚአብሔር መርጦሽ በማህፀንሽ ዙፋኑን ተክሏል የዲያቢሎስን ጥበብ እንዲያፈርስ አምላክ ሰው ሆነ በልጅሽ መሞት መዳናችንም ተከናወነ
 ሰዓሊለነ * 2
 `},{ 'title' :`እነሆ አዲስ ሰማይ`, 'lyrics':` እነሆ አዲስ ሰማይና አዲስ ምድር አየሁ * 2
 ፊተኛው አልፎ በዚያ እኖራለሁ * 2 የተሸከመችው መኖሪያ ቤቴ ያጌጠችው ድንኳን መክበሪያ ሀብቴ እግዚአብሔር ለልጁ ለእኔ ያዘጋጃት
 አዲሲቱ ሰማይ ኢየሩሳሌም ናት * 2
 ዓለም ሳይፈጠር ጌታ ያሰናዳት ማርና ወተት ያልተቋረጠባት የጎደለ ነገር እንከን የሌለባት
 የዘላለም ቤቴ ኢየሩሳሌም ናት * 2
 ምንም አልጨነቅ ለሚቀረው ነገር ልክ እንደ ትላንቱ ነገንም ለማይኖር ሁሉም ከንቱ ሲሆን ከፀሐይ በታች
 የእግዚአብሔር ክንድ ግን ሁሌም የሚመች * 2
 አስራ ሁሉት ደጆች የተሰሩላት የሐዋርያት ስሞች የተጻፉባት መቅደሷ በጉ ነው ሁሉን የሚገዛ
 የዘለዓለም ንጉስ ምህረቱን ያበዛ * 2
 `},{ 'title' :`ሰዓሊ ለነ ቅድስት`, 'lyrics':` ሰዓሊለነ ቅድስት እንልሻለን * 2 እንደ ኤፍሬም እንደ አባታችን ለምኝልን እመቤታችን * 2
 ተስፋ አንቺ ነሽና ለፍጥረት ዓለም እየተመኩብሽ እስከ ዘለዓለም
 
 
 
 
 
 ሃጢያታቸው ተደምስሶላቸው
 በአንቺ ጸሎት ዳነች ሕይወታቸው * 2 ስምሽም ስልጡን ነው በእግዚአብሔር መንበር ቃል ኪዳን ገባልሽ ልጆችሽን ሊምር
 በአንቺ ጸሎት ይተማመናሉ
 ጠዋት ማታ ቅድስት ሆይ ይላሉ * 2
 ዓለም ስትዋጋን በምኞት ስለት ነፍሳችን ስትደክም ሲከባት ሃጢያት መንገድ ጠፍቶን ግራ ሲገባን
 ብርሃናችን ነይ እናታችን * 2 የልባችን ሀዘን እጅግ ከብዶብናል ከበለሱ በታች በፍርሃት ወድቀናል
 እንደ ኤልሳቤጥ እንደ ዘመድሽ
 ደስ አሰኝን ይሰማን ድምፅሽ * 2
 `},{ 'title' :`ፍቅሩን ለገለጸው`, 'lyrics':` በመስቀል ተሰቅሎ ፍቅሩን ለገለጸው ምን ስጦታ አለን ለእርሱ የምንከፍለው ምስጋና ነውና ከእኛ የሚፈልገው
 ቸር አምላካችንን ተመስገን እንበለው
 ዓለም እስኪደነቅ ድንቅ አድርጎልናል እንዲሁ ያለዋጋ ጸጋውን ሰጥቶናል ትናንት ለእስራኤል ሞገስ የሆናቸው ስሙን እናመስግን ዛሬም ከእኛ ጋር ነው
 አፋችን ይሞላ በታላቅ ምስጋና ከሃጢያቱ ባህር ተሻግረናልና
 ክቡር ምስጉን አምላክ ቅዱስ እንበለው ኢሳይያስም በክብር በራዕይ እንዳየው
 ከቶ ለእግዚአብሔር ምን ይከፈለዋል ሁሉም የራሱ ነው ማን ምን ይሰጠዋል አመስጋኝ ቢቀኝም ክብር ለራሱ ነው እርሱ በባህሪው ዘለዓለም ምስጉን ነው
 ሙሴም ዝም አላለ ዳዊትም አልተኛ በጎቹ ዘመሩ ለመልካሙ እረኛ
 ያሬድ ተመሰጠ ወደ ሰማይ ዓለም እኛም ከእርሱ ጋር እንዘምር ዘለዓለም
 
 
 
 
 
 
 `},{ 'title' :`የሐይማኖት ፍሬ`, 'lyrics':` ተነግሮ የማያልቅ ነው ጸጋህ * 2 በጸሎት የተጋህ የሐይማኖት ፍሬ ተክለሃይማኖት የዕምነቱ ገበሬ
 በወንጌል ብርሃን ህዝብህን የመራህ የሃጢያትን ባህር ከፍለህ ያሻገርክ ኢትዮጵያዊው ሙሴ በመስቀልህ ባርከን ፍሬ እንድናፈራ ንፁህ ዘር አድርገን
 ሐዲስ ሐዋርያ አባ ተክለሃይማኖት ወንጌልን ያስተማርከን ለክርስቶስ መንግስት ጸበልህ እንዲምረን ውረድ አባታችን በዕጣንህ መዓዛ ይፈወስ ደዌያችን
 ለማጠን የበቃህ የስላሴን መንበር
 ሰይጣን ከቶ የማይደርስ በሄድክበት ሀገር ለህሙማን ሁሉ የሆንካቸው ፈውስ ጠብቀን ተክልዬ በስጋም በነፍስ
 በጣሙን የበዛ ትሩፋት ምግባርህ ጸሎትህን ያልተውክ ቢቆረጥ አነድ እግርህ ምዕራፈ ቅዱሳን የወንጌል ገበሬ
 እኛንም አድነን ከዚህ ዓለም አውሬ
 `},{ 'title' :`አልፈርድም እኔ`, 'lyrics':` አልፈርድም እኔ በማንም በደል በማንም ሃጢያት በፈረድኩበት እንዳልመዘን ጌተ ሲመጣ በሃይል በስልጣን
 በቸርነቱ አምላክ ባይተወው በደሌን ሁሉ ውስጤ ቢፈተሽ በተሰጠኝ ህግ በቅዱስ ቃሉ በምን ምግባሬ በሰው እፈርዳለሁ ዓይኔን አቅንቼ በደሌ በዝቶ ለራሴ ሳላውቅ ለሃጢያት ሞቼ
 ይልቅ የአንዱን ሸክም ሌላው ሰው አዝሎ መጓዝ ይችላል መፍረድ ከመጣ አንድም ሰው አይድን ሁሉም በድሏል ወንድም ወንድሙን እየከሰሰ ለፍርድ አቁሞ
 አህዛብ ያያል በንትርኩ እጅግ ተገርሞ
 ክርስትያን ሆኖ ከወንድሙ ጋር እየተጣላ ዓለም ዳኘችን በጸብ ፍርድ	ቤት ታረቁ ብላ ክርስትያን ሆነን በአህዛብ መሃል እየተካሰስን አምላክ አዘነ የመስቀሉን ዓላማ ትተን
 መቼ ከሰሰ የከሰሱትን የገረፉትን
 አይተናል እንጂ ለጠላቶቹ ምህረት ሲለምን
 
 
 
 
 በጽድቅ ስራ ላይ ለእውነት ብለን መጥተናል እንጅ ማን ነው የሾመን በወንድሞች ላይ አርጎ ፈራጅ
 `},{ 'title' :`እንደ ኤልሣቤጥ`, 'lyrics':` እንደ	ኤልሳቤጥ ላመስግንሽ ፊትሽ ወድቄ ልሳለምሽ የጌታዬ እናት የእኛ አማላጅ
 አዛኝ ነሽ ከልብ ፍጹም የዋህት
 እርህራሄሽ ያስደስተኛል
 ስለ ሃጢያቴ ምልጃሽ ይቀድማል የሰላምታሽ ድምፅ ደስ ያሰኘኛል ከትካዜዬም ያሳርፈኛል
 ድምጽሽ ሲሰማኝ ልቤ ይረካል ሀዘኔ ቀርቶ ፊቴ ይፈካል በእናትነት አንቺን ለሰጠኝ
 ቸሩ አምላካችን ይክበር ይመስገን
 የሁሉ እመቤት የሁሉ	አጽናኝ የአበው መድሃኒት ከአምላክ አገናኝ ዛሬም በልቤ ደስት ጨምረሽ
 እንደ ኤልሳቤጥ ሰላም ልበልሽ ከሴቶች መካከል መርጦ ቀድሶሻል ትውልድ ሁሉ ብጽኢት ይልሻል
 በልዩ ውዳሴ ያመሰግኑሻል ድንግል እናታችን በቀኙ ቆመሻል
 የሰላምታሽን ድምፅ ልቤ ሲሰማ ነፍሴ ደስ አላት ቀለለ ሸክሟ ድንግል ለክብርሽ ስንበረከክ እጅሽ ይዘርጋ ለመባረክ
 `},{ 'title' :`እስከ መቼ ነው`, 'lyrics':` እስከ መቼ ነው የማልለወጠው ባልተሰበረ ልብ የምመላለሰው * 2
 በሰጠኸኝ ጸጋ ድካሜ ተከድኖ ዓለም ይከበኛል አልቆና አግኖ
 ይህን ከንቱ ወጥመድ ጣለው ከኋላዬ ትንሽ ሰው መሆኔን ይወቅ ህሊናዬ
 ፀሐይ ስትጨልም ከዋክብት ሲረግፉ ለገናናው ክብርህ ፈቅደው ሲሸነፉ
 
 
 
 ለሁለት ሲከፈል ድንጋያማው ዓለት የእኔ ልብ መቼ ይሆን የሚሸነፍለት
 ቃልህን ስሰማ ልቤን ይነካዋል ጽድቅን አስባለሁ ሀዘን ይሰማኛል ወዲያው ተመልሼ ሁሉን እረሳለሁ
 ለዚህ ዓለም ስብከት ልቤን እከፍታለሁ መኖርን እሻለሁ ልቤ ተለውጦ
 አንተን እንዲያከብርህ ከሁሉ አብልጦ ዓለት አይሁን ይቅር ይሰበር ከፊትህ ደንግጬ እነድመለስ ሲገስጸኝ ድምፅህ
 `},{ 'title' :`ስራው ድንቅ ነው`, 'lyrics':` እግዚአብሔር ስራው ድንቅ ነው * 2 ለእኔ ያደረገው ብዙ ነው * 2 እግዚአብሔር ስራው ድንቅ ነው * 2 ለእኔ ያረገልኝ ብዙ ነው * 2
 እረዳቴ እርሱ ነው ከሰማያት እግዚአብሔር ጠባቂ ለእኔ ሕይወት ብርሃኑን በፊቴ የሚያበራ
 አምላኬ ድንቅ ነው የእርሱ ስራ በመንገዴ ሁሉ የሚመራኝ
 ስነሳም ስወድቅም የሚያስበኝ ማንም አልመጣልኝ ከወገኔ ከሁሉም ይበልጣል እርሱ ለእኔ
 የዕዳዬን ደብዳቤ ውድቅ አድርጎ ሕይወቴን መራልኝ ወደ በጎ
 ኸረ እንደ እግዚአብሔር ማን ይሆናል እርሱን ለሚፈሩት ይታመናል
 አንድ ቀን አስቤ ተጨንቄ ለመኖር አልቻልኩም ተጠንቅቄ ሁሉን ነገር ለእርሱ ትቼዋለሁ በምህረቱ ጥላ እኖራለሁ
 `},{ 'title' :`በረከትህ ይደር`, 'lyrics':` በረከትህ ይደር * 2 በሁላችን የዝማሬ ጸጋህ ዳዊት አባታችን
 ምስጋና እንድንሰዋ እኛም ለአምላካችን
 
 
 
 
 በገና የያዙበት እጆቹ ጠንክረው ጎልያድን ጣሉት ጠጠርን ወርውረው ከበሮ የመታበት ክንዶቹ በርትተው
 አንበሳን ገድለዋል ግልገል ከአፉ ነጥቀው ክፉ መንፈስ ከሰው የሚያስወግደው
 የሳኦልን ህመም የሚፈውሰው የበገና ምስጢር የዝማሬ ቃና በእኛም ይደርብን ልጆችህ ነንና
 እልል * 2 በሉ እንድታሸንፉ ድምጽንም አሰሙ ቅጽሩን እንድታልፉ
 የመዝሙር ነጎድጓድ ወህኒውን ይከፍታል ብርሃናዊው መላዕክ ከሰማይ ይመጣል
 `},{ 'title' :`ከንቱ ነኝ`, 'lyrics':` ከንቱ ነኝ የከንቱ ከንቱ ነኝ
 ዋስትና መከታ እግዚአብሔር ካልሆነኝ ተስፋዬ የሚሆነኝ ሕይወት የሚሰጠኝ እግዚአብሔር ብቻ ነው የሚያስተማምነኝ አምላኬ ብቻ ነው የሚያስተማምነኝ
 እኔ ንጉስ ነበርኩ በክብር ያጌጥኩኝ ሁሉን በምድር ላይ በጥበብ ፈፀምኩኝ የዚህ ዓለም ደስታ ምንም አላዋጣኝ
 በመጨረሻ ግን በሞት ተወሰድኩኝ * 2
 ከጸሐይቱ በታች አዲስ ነገር የለም ሰዎች ይደክማሉ እስከ ዘለዓለም ጥበብን ፍለጋ ደክሜ ነበረ
 ሁሉም ከንቱ ሆኖ በመቃብር ቀረ * 2 ከእኔ አስቀድመው የከበሩ ሁሉ አፈር ተጭኗቸው ከመቃብር አሉ
 እብደትና እውቀት ሁሉን አወቅኳቸው
 ምንም ቋሚ የለም ሁሉም ከንቱ ናቸው * 2
 ልቤን የሰጠሁት ተስፋ ያደረኩት አልጨበጥ ብሎኝ አለሁኝ ስታክት የጥበብም ብዛት ለትካዜ ሰጠኝ
 እኔ በዚህ ዓለም እጅግ ጎስቋላ ነኝ * 2
 ልቤንም ፈተንኩት በደስታ ብዛት
 የዚህን ዓለም ለውጥ ጣዕሙን አቀመስኩት
 
 
 
 
 
 
 ሳቅም በልቤ ውስጥ ይፍለቀለቅ ነበር ሁሉም ከንቱ ሆኖ ገብቶ ከመቃብር * 2
 `},{ 'title' :`ገሊላ እትዊ`, 'lyrics':` እመቤቴ እስከ መቼ ባዕድ ሀገር ትኖሪያለሽ * 2
 ገሊላ ግቢ * 4 ሀገርሽ ገሊላ ግቢ * 2
 ገሊላ ግቢ * 4 ሀገርኪ ገሊላ እትዊ * 2
 እመቤቴ ማርያም ገሊላ እትዊ ስደቱ ይበቃሻል	ገሊላ እትዊ ሔሮድስ ምቷል ብሎ ገብርኤል ነግሮሻል በእሳት ሰረገላ ዑራኤል ይመራሻል	
 የዝናቡ ጌታ	ገሊላ እትዊ	እናት ሆነሽ ሳለ	ገሊላእትዊ
 ሰይጣን በሰው አድሮ እያስከለከለ	
 ውሃ ጥም ጸንቶብሽ አፍሽ ደርቆ ዋለ	
 ይበቃል እናቴ	ገሊላ እትዊ	ርሃብ ጥማትሽ ገሊላ እትዊ
 ሒጂ ወደ ገሊላ ወደ ዘመዶችሽ	
 
 
 
 
 የሰማዕታት አክሊል የጻድቃን እናት	
 ባርከሽ ሰጠሻቸው መከራ ስደት	
 እኛም ይታደለን የአንቺው በረከት	
 ገጽሽ ብሩህ መልካም ገሊላ እትዊ ልክ እንደ ፀሐይገሊላእትዊ እግዝትነ ማርያም እሙ ለአዶናይ አይገባም ለአንቺ መከራ ስቃይ	
 `},{ 'title' :`ተስፋችን ነህ አንተ`, 'lyrics':` ተስፋችን ነህ አንተ እስከ ዘለዓለም * 2
 የድንግል ማርያም ልጅ መድሃኒዓለም * 2 ደምህን አፍስሰህ ስጋህን ቆርሰህ * 2 ብሉ ጠጡ ብለህ ለዓለም ሰጠህ * 2
 የዘለዓለም ሕይወት እንድናገኝ ሆነ * 2
 በመድሃኒዓለም ሁሉም ተከወነ * 2
 ደሙን የረጨኸው ቅዱስ ዑራኤል * 2
 ኢትዮጵያን ቅረባት ትሁን ባለሟል * 2
 በደሙ ተባርካ በዑራኤል እጅ * 2
 ዛሬም ከእርሷ ጋር ነው ሆኗት አማላጅ * 2 ጸሎትህ ኢትዮጵያን እጅግ ቀደሣት * 2 ሃያሉ ዑራኤል መቼም አይተዋት * 2
 የሰው ልጅ ችግር ከሚያስወግድ መላክ * 2 አንዱ ዑራኤል ነው ምድራችንን ይባርክ * 2 ይመስገን ቸር አምላክ
 አሜን * 2 ይሁን አሜን ሃሌ ሉያ * 2
 ሰላምን ለግሣት ለኢትዮጵያ * 2
 `},{ 'title' :`ምስጋና ነው ስራዬ`, 'lyrics':` ምስጋና ነው ስራዬ በዘመኔ በእድሜዬ ለዋለልኝ ውለታ ምን ልክፈለው ለጌታ
 ትላንትና ጥልቁ ነበረ መኖሪያዬ የማዳኑ ቀኑ ደረሰ የጌታዬ እራቁቴን ሸፍኖልኛል በብርሃኑ
 ምግቤ ሆኗል ስሙን ማወደስ በየቀኑ
 
 
 
 
 
 አልተራብኩም አልተጠማሁም በዘመኔ ምግበ ስጋ ምግበ ነፍስ ነው ጌታ ለእኔ ተበጥሷል የእሳቱ ገመድ ሰንሰለት አልረሳውም የእርሱን ውለታ ብድራት
 ማን ያፈቅራል እስከ ሞት ድረስ ዋጋ ከፍሎ ማን ያድናል ባለስልጣኑን ሞትን ገድሎ አማኑኤል በፍቅሩ ጸዳል ምድርን ከድኖ ስው አድርጎኛል የማይሆኑትን ሁሉ ሆኖ
 እንዴት ብዬ ፍቅሩን ልግለጸው እንዴት ብዬ ስለ እጆቹ በእንባ ጨቀየ መኝታዬ
 በእርሱ ቁስል ነፍሴ ወጥታለች ከመከራ በዝማሬ ስሙን ማክበር ነው የእኔ ስራ
 `},{ 'title' :`አበባየሆሽ`, 'lyrics':` እሰይ ደስ ደስ ይበላችሁ * 2
 ቅዱስ ዩሐንስ መጣላችሁ ደስ ደስ ይበላችሁ
 ደስ ብሎን መጣን ደስ ብሎን * 2
 ጌታ አለ ብለን
 ደስ ብሎን መጣን ደስ ብሎን * 2
 ድንግል አለች ብለን
 አበባየሆሽ	ቅድስት * 2
 ባልንጀሮቼ	
 ቁሙ በተራ	
 በጎ ምግባርን	
 በዕምነት እንስራ	
 ዛሬ ነው ቀኑ	
 መመለሻችን	
 ይቅር እንዲለን	
 ቸሩ አምላካችን	
 አደይ የብርሃን ጮራ በኢትዮጵያ አበራ * 2
 ድንግል ማርያምን	ቅድስት እንለምናት	
 ምህረት የሚሰጥ	
 ቃል ኪዳን አላት	
 ጭንቀት ይርቃል	
 ይቀርባል ሰላም	
 
 
 
 
 
 
 ስሟ ሲጠራ	
 የድንግል ማርያም	
 አደይ የብርሃን ጮራ በኢትዮጵያ አበራ * 2
 በህገ ልቦና	ጥንቱን ፈጣሪን አውቀሽ 
 ህገ ነብያትን	ከዓለም
 ቀድመሽ ተቀበልሽ	
 በብሉይ ኪዳን ለጌታ መስዋዕት አቀረብሽ ተስፋ ካረጉት	ከአይሁድ
 ህገ ወንጌልን	በፊት
 ይዘሽ ተገኘሽ	በፊት
 ኢትዮጵያ ደስ ይበልሽ ትልቅ ጸጋ አለሽ * 2
 `},{ 'title' :`የዓለምን በደል`, 'lyrics':` የዓለም በደል የሰውን ግፍ አይቶ ዘጠና ዘጠኙን መላዕክት ትቶ ጽድቅን ለመፈፀም በደልን አጥፍቶ
 የሰላሙ መሪ የሰላሙ ዳኛ አምላክ ተወለደ ተጠመቀ ለእኛ
 የሰማያት ሰማይ የማይችለው ንጉስ ተወለደ ተጠመቀ እኛን ለመቀደስ ተራሮች ደንግጠው ዘለሉ እንደ ፈረስ
 የሰላሙ መሪ የሰላሙ ዳኛ አምላክ ተወለደ ተጠመቀ ለእኛ
 ባህር ተጨነቀች ጠበባት መሬቱ ዮርዳኖስም ሸሸ አልቆመም ከፊቱ እንደ ተናገረ ዳዊት በትንቢቱ
 የሰላሙ መሪ የሰላሙ ዳኛ አምላክ ተወለደ ተጠመቀ ለእኛ
 ልጁ በዮርዳኖስ ጽድቅን ሲመሰርት መጣ በደመና ሰማያዊው አባት እየመሰከረ የልጁን	ጌትነት
 የሰላሙ መሪ የሰላሙ ዳኛ አምላክ ተወለደ ተጠመቀ ለእኛ
 
 
 
 
 
 
 
 
 `},{ 'title' :`ወደ ማደሪያው`, 'lyrics':` ወደ ማደሪያው ገብቼ ልስገድ ለእግዚአብሔር ምስጋናን ላቅርብ ስለ ስሙ ክብር
 አድርጎልኛልና አመሰግነዋለሁ በአፀደ መቅደሱም እሰግድለታለሁ
 ከፊቱ ለመቆም ማልጄ እነሳለሁ * 2
 በመከራዬ ቀን ሆኖኛል መከታ ቤቱም ተገኝቼ በፍጹም ደስታ የከንፈርን ፍሬ ልሰዋ በእልልታ * 2
 አስር አውታር ባለው በበገና በመላዕክቱ ፊት ለማቅረብ ምስጋና
 የአፌንም ነገር ሰምተኸኛልና * 2 ለስሙ ልንበርከክ ለእርሱ እንደሚገባ ስዕለትን ልፈጽም ላቅርብለት መባ
 ወደ አደባባዩ በምስጋና ልግባ * 2 አሸበሽባለሁ ድምፄን አሰምቼ በቤተመቅደሱ ሌሊት ተገኝቼ
 እንደ ካህናቱ እጆቼን ዘርግቼ * 2
 `},{ 'title' :`ሐመልማላዊት`, 'lyrics':` ሐመልማላዊት እጽ ሐመልማላዊት * 2
 ሙሴ ዘሪያ ዘደብረሲና * 2
 ማርያም ተወለደች * 2
 የለመለመች እጽ የለመለመች * 2 ሙሴ ያያት በደብረሲና * 2 ማርያም ተወለደች ዛሬ * 2
 `},{ 'title' :`ኦ ሚካኤል`, 'lyrics':` ኦ ሚካኤል * 2 ሊቀ መላዕክት በሃጢያት እንዳንወድቅ እንዳንሞት ፈጥነህ ተራዳን አጽናን በዕምነት
 ለያዕቆብ ነገድ	ሚካኤል ለእስራኤል	ሚካኤል ጠባቂያቸው ነህ መላከ ኃይል 
 
 
 
 
 
 ፍቅር አድለን ምህረት ቅዱስ ሚካኤል የእኛ አባት * 2 ነጸብራቃዊ ሚካኤል ተክህኖ ልብስህ	ሚካኤል ሐመልማለ ወርቅ ዓይኑ ዘርግብ 
 ፍቅርን አድለን ምህረት ቅዱስ ሚካኤል የእኛ አባት * 2 በስዕልህ ፊት	ሚካኤል	እሰግዳለሁ	ሚካኤል ፈጥነህ አረጋጋኝ አለሁ በለኝ 
 ፍቅርን አድለኝ ምህረት ቅዱስ ሚካኤል የእኛ አባት * 2
 `},{ 'title' :`መመኪያዬ ርስቴ`, 'lyrics':` መመኪያዬ ርስቴ የሆነች
 ድንግል ማርያም ለእኔ እናቴ ነች
 እናቴ ነች * 3
 ስማጸናት ትመጣለች	እናቴ ነች ወዳጄ ሆይ ትለኛለች 
 መድሃኒቴ ስለሆነች	
 የድህነት ምክንያት ነች የመስቀል ስር ስጦታዬ	እናቴ ነች እመቤቴ ከለላዬ 
 ወልደ አምላክ ምህረት ይዛ መጣችልኝ የእኔ ቤዛ	
 በጌታ ቀኝ የምትቆመው	እናቴ ነች ላመናት የምትቀርበው 
 ንጽህት ቅድስት የሆነች	
 የዓለም ንግስት እናቴ ነች ድንግል ማርያም መመኪያዬ	እናቴ ነች አክሊሌ ነች አለኝታዬ 
 መንግስተ ሠማይ መግቢያዬ የምቀርበው ከጌታዬ	
 ባንቺ እኮ ነው እመቤቴ	
 `},{ 'title' :`እሠይ እልል በሉ`, 'lyrics':` እሠይ እልል በሉ ተገኘ መስቀሉ * 2
 የጥል ግድግዳ	አበባ	የፈረሰበት	አበባ ሰው ከእግዚአብሔር ጋር የታረቀበት የእግዚአብሔር ልጅ የነገሰበት የሞት አበጋዝ የወደቀበት 
 
 
 
 
 
 አይሁድ በቅናት	አበባ	መስቀሉን ቀብረው	አበባ ቢከድኑት እንኳን በቆሻሻቸው 
 ጌታን መቃወም ስለማይችሉ	
 ይኸው ተገኘ ወጣ መስቀሉ ደጉ ኪረኮስ አበባ	ሽማግሌው	አበባ
 እሌኒን መራት በደመራው	
 ጌታ በእርሱ ላይ በመስቀሉ	
 ጭሱ ሰገደ ወደ መስቀሉ የዕምነት ምልክት	አበባ መስቀል ነውና	አበባ
 ተራራው ሜዳ ሆነ እንደገና	
 እንደተነሣ ጌታን እንደካዱ	
 ነጎድጓድ ወጣ ከእጸ መስቀሉ እኛም በመስቀል አበባ	እንመካለን	አበባ
 በእግዚአብሔር	ጥበብ መች እናፍራለን	
 ሞኝነት እንኳን
 ኃይል እጸወነ 
 ቢሆን ለዓለም
 ለዘለዓለም	
 
 ግድግዳው ፈርሷል	አበባ	የልዩነቱ	አበባ
 ምድርና ሰማይ ሆነ እንደጥንቱ	
 ነፍስና ስጋ በእርሱ ታርቀዋል	
 ህዝብና አህዛብ ወንድም ሆነዋል	
 `},{ 'title' :`የመስቀሉ ፍቅር`, 'lyrics':` የመስቀሉ ፍቅር ሲገባቸው * 4 እመቤታችንን እናያታለን የመስቀሉ ፍቅር የገባቸው * 4
 እመቤታችን አለች ከጎናቸው * 4 አባ ህርያቆስ አባታችን የመስቀሉ ፍቅር ቢገባው
 ልቤ አፈለቀ አለ መልካም ነገር ከእመቤቴ ጋር ሲነጋገር ከድንግል ማርያም ጋር ሲነጋገር
 ነይ ነይ እምዬ ማርያም ነይ ነይ ቤዛዊት ዓለም
 አንድ ወልዳ ስሙን አበዛችው * 2
 አንዱ ሀገር ስትሄድ አማኑኤል አለችው
 ኢየሱስ	
 አንድዬ ለመናኒው ጸሎት ልዩ እጣን የዋሻው ሻማ ነሽ እመብርሃን
 
 
 
 መዓዛሽ ሸተተኝ ከግሸን ትናፍቂኛለሽ ምን ልሁን ትርቢኝማለሽ ምን ልሁን
 ዳዊት በመዝሙሩ ያነሳሻል የያዕቆብ ድንኳን ነሽ ይልሻል የእግዚአብሔር ድንኳን የሚሉልሽ
 እመቤቴ ማርያም አንቺ ነሽ * 2
 ቤቴልሔም ስሔድ አይሻለሁ ቀራንዮ ስሔድ አይሻለሁ ፍጹም አትለይም ከልጅሽ
 የአንቺስ ልዩ ነው ፍቅርሽ * 2
 `},{ 'title' :`ትህትናሽ ግሩም`, 'lyrics':` ትህትናሽ ግሩም ነው ደግነትሽም * 2
 እናቱ ሆነሻል ለመድሃኒዓለም * 2
 ንጽህት ስለሆነሽ	እመቤቴ * 2
 እንከን የሌለብሽ	
 የፍጥረታት ጌታ	
 ባንቺ ያደረብሽ	
 የድንግል መመረጥ	
 ዜናው አስገረመኝ	
 እሳቱን ታቀፈች የማይቻለውን	
 ምርኩዜ ልበልሽ	እመቤቴ * 2
 ጥላ ከለላዬ	
 ጋሻዬ ልበልሽ	
 የኔ መመኪያዬ	
 በዓለም እንዳልጠፋ	
 ሕይወቴ መሮብኝ እንደ ወይን አጣፍጪው ድንግል ድረሽልኝ	
 የምስራቅ ደጃፍ ነሽ	እመቤቴ * 2
 የሁላችን ተስፋ	
 እሙነ ፀሐይ ጽድቅ	
 የሁሉ ጠባቂ	
 ድንግል የድል አክሊል	
 ድንግል የጽድቅ ስራ	
 
 
 
 
 
 ድንግል መሰላል ነሽ	
 
 `},{ 'title' :`የተዋህዶ ተስፋ`, 'lyrics':` ገድሉ ተዓምራቱ	
 
 ገድሉ ተዓምራቱ እጅግ ብዙ ነው ጣኦትን አዋርዶ የተሸለመው የተዋህዶ ኮከብ ተክለ ሐዋርያ አባ ተክለሃይማኖት ዘኢትዮጵያ
 ዳግማዊ ዮሐንስ ጠፍር የታጠቀ ንጹህ ባህታዊ ጠላት ያስጨነቀ የጸጋ ዘ አብ ፍሬ ዛፍ ሆኖ በቀለ በደብር ሊባኖስ መናኝ አስከተለ
 ደካማ መስሏቸው በአንድ እግሩ ቢያዩት ባለ ስድስት ክንፉ ተክልዬ የእኛ አባት እርሱስ አንበሳ ነው ትናገር ደብረ አስቦ ሌጊዮን ሲዋረድ	እፍረት ተከናንቦ
 ከካህናት መካከል ሕሩይ ነው ተክልዬ መጣሁ ከገዳምህ ልሳለምህ ብዬ ኢትዮጵያዊው ቅዱስ አባ ተክለሃይማኖት ወልድ ዋህድ ብለህ ምድሪቷን ቀደስካት
 የባረከው ውሃ የረገጥከው መሬት ገላው ያረፈበት ሆኗል ጸበል ዕምነት ኑና ተመልከቱ ድውያን ሲፈቱ ይሰብካል ተክልዬ ዛሬም እንደ ጥንቱ
 `},{ 'title' :`ክብረ ቅዱሳን`, 'lyrics':` ክብረ ቅዱሳን ይዕቲ * 2 ክብረ ቅዱሳን * 2
 ሙዳየ መና ግሩም ሙዳየ መና * 2 የቅዱሳኑ ክብር ነሽና እንሰጥሻለን ቅኔ ምስጋና የወለድሽልን የሕይወት መና ዝናብ ያለብሽ ታናሽ ደመና
 ትህትና ልብስሽ ፍቅር ውበትሽ ጽንስ የዘልላል ሰላምታ ድምፅሽ እሳቱን ወልደሽ እሳት ታቅፈሻል ሳንዘምርልሽ መቼ ይመሻል
 
 
 
 
 
 
 የፀሐይ መውጫ ምስራቅ ሆነሽ ታላቁን ብርሃን አየንብሽ አትጨልምም ሕይወታችን ልጅሽ	እስካለ ፀሓያችን
 ሰዓሊለነ ሰላም ለኪ ተማህጸነ በኪዳንኪ
 ንኢ ርግብየ ምስለ ወልድኪ ሰማይ ወምድር ይወድስኪ
 `},{ 'title' :`እመቤቴ ማርያም`, 'lyrics':` እመቤቴ ማርያም እመቤቴ * 2
 ባንቺ ያደረብሽ የሠራዊት ጌታ
 እመቤቴ ማርያም ይድረስሽ ሰላምታ * 2 ሕይወቱን የሰጠ ፍጹም ለሰላም ሁሉንም የሚችል ያለ በአርያም
 የአምላክ ማደሪያ ድንግል ማርያም * 2
 ጌታ የመረጠሽ እስከ ዘለዓለም * 2
 የምድር ባለ ጸጎች ሲማልዱ ፊትሽ የሰማይ መላዕክት ምስጋና ያቅርቡልሽ አህዛብ ይንበርከክ ለሃያሉ ልጅሽ * 2
 ክብር ይገባሻል በእናትነትሽ * 2
 ላንቺ ሲያስተላልፍ ገብርኤል ሠላምታ ከልዑል ተልኮ ከሠራዊት ጌታ
 ሰላም ላንቺ ይሁን ብሎ ያበሰረሽ * 2
 እመቤቴ ማርያም ምስጋና ይድረስሽ * 2
 `},{ 'title' :`እቴ ሙሽራዬ`, 'lyrics':` እቴ ሙሽራዬ ሰሎሞን ያለሽ * 2
 እኔም ልበልሽ እናቴ እመ አምላክ/ማርያም/ ጊቢ በቤቴ * 2 ሁሉም ሰው ለራሱ ወንበር ሲዘረጋ
 የክብርን ሽልማት ለራሱ ሲያስጠጋ ድንግል እንደ ባሪያ ውሃ ተሸክመሽ ጌታን በትህትና ታገለግያለሽ
 ወርቀ ዘቦ ለብሰው በቤቱ ከሞሉት በሀርና በእንቁ ከተንቆጠቆጡት
 
 
 
 
 
 በሰው ፊት ያማሩ ብዙ ሆነው ሳለ ጌታ ግን ወደደሽ እናቴ ነሽ አለ
 አሳድጐሽ ሳለ መልአኩ መግቦ ተሸልመሽ ሳለ በዝቶልሽ ተውህቦ እጅግ በትህትና ስላገለገልሽው
 እንደ ኪሩብ መላዕክ ጌታን ተሸከመሽው የባሪያውን ውርደት ተመልክቷልና
 ለወለድሽው ንጉስ ይድረሰው ምስጋና ከልብ የወጣ እንጂ ከንቱውን አይደለም ብጽዕት እንላለን እኛ ዘለዓለም
 `},{ 'title' :`ካንተ የሆነው`, 'lyrics':` ካንተ የሆነው መልካም ነው * 2
 ሁሉን በጊዜው ስትሰራው ካንተ የሆነው መልካም ነው
 የኑሃሚን ርስት ሞአብ አይደለችም ለምለሙን እንጀራ ስቡን ብታበቅልም በሙላት ወጥታችሁ ባዶ አትመለሱ የእስራኤልን ቅዱስ ቃልኪዳን አስታውሱ
 ሩት አትለፊ የቡኤዝን እርሻ
 ጌታ ፈቅዶልሻል የእንጀራሽን ድርሻ ያለኝ ይበቃኛል ብለው ለሚያምኑት እጅግ አትርፈዋል ሰላም በረከት
 እስማኤል አይደለም የእግዚአብሔር ስጦታ አብርሃም ሆይ ጽና ባለህበት ቦታ
 ሰላም እና ፍቅር ይዞ የሚመጣው ይስሐቅ ይወለዳል ቢዘገይም ጊዜው
 ሰዶም ብታበቅል ለምለሙን ቄጤማ ለእግዚአብሔር ልጆች መቼም አትስማማ ድንጋይ እንኳን ቢሆን የአብርሃም ርስት ጠግበናል ልጆቹ ማርና ወተት
 `},{ 'title' :`አማላጅ ነው`, 'lyrics':` በፍጡራንና ፈጣሪ መካከል
 ድርሻ የተሰጠህ ሰውን ለማገልገል ተራዳኢ መላዕክ ጠባቂ የእስራኤል የመላዕክ አለቃ ስሙ ነው ሚካኤል
 
 
 
 
 
 አማላጅ ነው ሚካኤል * 2 የአምላክ ባለሟል ለእነ ሙሴ ለሕዝበ እስራኤል
 ፈርኦን በእስራኤል ላይ በትዕቢት ተነስቶ ቢከታተላቸው ጦሩን አስነስቶ ይመራቸው ጀመር ሚካኤል በፋና ሌሊቱን በብርሃን ቀኑን በደመና
 ከባህር ያወጣኸው ጸጋ ዘአብን ከአረመኔው ንጉስ እግዚእ ሐሪያን ከልለህ የጠበቅህ በብዙ ተዓምራት እኛንም ጠብቀን ከበደል ከሃጢያት
 በአፎሚያ ላይ ሲፎክር ጠላት ፈጥነህ የደረስከው ሊቀ መላዕክት እኛንም ጠብቀን ከክፉ ከቅሰፍት ፈጥነህ ድረስልን ሁነን ረዳት
 መልአኩ ሚካኤል አማላጃችን እንለምንሃለን እንድትጠብቀን
 አምላክ በፍርድ ቀን ጻድቃንን ሲጠራ ዋስ ጠበቃ ሁነን ሚካኤል አደራ
 `},{ 'title' :`እልፍ አእላፋት`, 'lyrics':` እልፍ አእላፋት ወትእልፈት ቅዱሳን ንጹሃን መላዕክት ቆሙ ለአገልግሎት ጸንተው በአንድነት
 ቅዱስ * 3 አምላክ በማለት * 2
 ኢዮር ራማ ኤረር የመላዕክት ሀገር የሐይማኖት የፍቅር የምልክት ክር እውነት የታየብሽ የመላዕክ ክብር
 እንጽና ሲል ገብርኤል በአለንበት ቦታ በሳጥናኤል ነገድ ነበረ ሁካታ
 ግማሹ እየካደ ቀሪው ሲያመነታ
 የሳጥናኤል ምኞት እንደ አበባ ረግፎ ሚካኤል ተሾመ በዕምነት ተደግፎ ሳጥናኤል ወደቀ ጸጋውን ተገፎ
 ቅዱሳን መላዕክት በዕምነት የጸናችሁ በታላቅ አክብሮት ሰላም እንበላችሁ ስግደት ወበጸጋ እንስገድላችሁ
 
 
 
 
 
 
 
 
 `},{ 'title' :`ድንግል መከራሽን`, 'lyrics':` ድንግል መከራሽን ጥቂት ላስታውሰው በሔሮድስ ዘመን ፍጥረት ያለቀሰው አንቺ የአምላክ እናት ደግሞም እመቤት እንደ ችግረኛ ተነሳሽ ስደት
 ኧረ ለመሆኑ እንዴት አለቀልሽ ስትንከራተቺ በረሃን አቋርጠሽ ይገድሉታል ብለሽ ለልጅሽ አስበሽ
 በግብፅ በረሃ መከራሽን አየሽ * 2 መከራሽን አዛኝቷ ማርያም በጠራሁሽ ጊዜ
 እንድትደርሽልኝ በመከራ ጊዜ
 መከራን ያየ ሰው መቼም አይጨክንም
 አትጨክኝብኝ አደራሽን ማርያም * 2 አደራሽን አቤት የዚያን ጊዜ ያየሽው መከራ ያለቀስሽው ለቅሶ ጭራሽ አይወራ የአማኑኤል እናት አንቺ መከረኛ
 እድሜሽን ጨረስሽው ሆነሽ ሀዘንተኛ * 2 ሀዘንተኛ
 `},{ 'title' :`ኢትዮጵያ ሆይ`, 'lyrics':` ኢትዮጵያ ሆይ እግዚአብሔርን አመስግኚ * 2
 ከህዝብሽ ጋር እልል በይ * 3
 እጆችሽን በበረከት ስለሞላ * 2
 ስላዳነሽ በጭንቅ ቀን ከሞት ጥላ * 2
 እግዚአብሔር ብርሃንሽ ስለሆነ * 2
 ከአስፈሪው ቀን ልጆችሽን ስላዳነ * 2
 ኢትዮጵያ ሆይ እግዚአብሔርን አመስግኚ * 2
 በሽብሻቦ እልል በይ * 2 በሽብሻቦ ለአምላክሽ ዘምሪለት * 2 ስብራትሽን ይጠግናል በምህረት * 2
 ለህዝብሽም እግዚአብሔር ኃይላቸው ነው * 2
 በስቃይሽ የጎበኘሽ መመኪያቸው * 2 ሕዝብህን ባርክ ለዘለዓለም ጠብቃቸው * 2 በጽድቅህም ከፍ አድርጋቸው * 2
 
 
 
 
 
 የምስጋና ነጎድጓድ ከአፍሽ ይውጣ * 2
 ድሮም ቢሆን	እግዚአብሔር ነው ያንቺ ዕጣ * 2
 `},{ 'title' :`ቅዱስ ሚካኤል`, 'lyrics':` ፈጥነህ ተራዳኝ ዋስ ጠበቃዬ * 2	
 አንተ ስለሆንክ
 የአምላክ ባለሟል ሚካኤል
 
 ልመናህ ፈጥኖ
 ከአምላክ ያቀርባል 
 
 
 ቅዱስ ሚካኤል * 3 ነፍሴ ሲጨነቅ ሲዝል ስጋዬ
 
 
 
 
 የዋህ መላዕክ ነህ አዛኝ ለሰው ምልጃህ ፈጣን ነው ለምናምነው * 2
 ደዌ የጸናበት	ሚካኤል ባንተ ይድናል 
 በአደባባይህ	
 ምስክር ሆኗል	
 ከቤትህ መጥቶ የተማጸነ
 በቃል ኪዳንህ ሕይወቱ ዳነ * 2
 ከአምላክ ተሰጥቶህ ሚካኤል
 ክብርህ ያበራል
 ለጎስቋላው ስው መጠጊያ ሆኗል ትልቅ ትንሹ ድሃው	
 
 ሐብታሙ	
 
 
 ለምኖ አግኝቷል ከአምላክ በስሙ * 2
 በብሉይ ኪዳን	ሚካኤል ከአምላክ ተልከህ 
 ህዝበ እስራኤልን	
 ነፃ ያወጣህ	
 በአዲስ ኪዳንም ድንቅ ስራ አለህ
 በተዓምራትህ ትፈውሳለህ * 2
 ባለመድሃኒት ሚካኤል
 ያቃተውን 
 ፈዋሽ ጸበልህ
 ሆኖኛል ኃይል 
 
 እንደ መጻጉ ድህነት	አገኘሁ	
 ፈውሰኸኛል ባንተ ተመካሁ * 2
 
 
 
 
 
 `},{ 'title' :`እንበረታለን ገና`, 'lyrics':` እንበረታለን ገና በጸጋው ተደግፈን * 2
 ወልድ ዋህድ እያልን ዓለምን እንከድናለን * 2 ጴጥሮስ የመሰከረው ዓለት ነው መሠረቱ የአባቶቻችን አምላክ የዋጀን በስቅለቱ ሲጠብቀን ይኖራል ከወጣንበት ቦታ
 እናመልካለን እርሱን በፍቅር በደስታ * 2
 ሲገሉን ሲያሳድዱን በቁጥር እንበዛለን ሲንቁን ሲያዋርዱን በስሙ እንከብራለን የሲኦልም ደጆች አይችሉንም እኛን
 የተክለሃይማኖት አምላክ ይችላል ሊያድነን * 2 ልፋታችንን ያያል የሰማይ አምላካችን ብዙውን እየሰጠን ጥቂቱን እንወስዳለን ጽኑ ነው ማይተባችን ሳይበጠስ ይኖራል
 የምናመልከው አምላክ በልባችን ይሰራል * 2
 ተመስገን አምላካችን ዛሬ በዛን በፊትህ በአህዛብ ተራሮች ላይ ይመሰገናል ስምህ እያለፍን በጽድቅህ ዓለምን ልናቀና
 ጌታ ሆይ ቅደምልን ቃልኪዳን አለህና * 2
 `},{ 'title' :`በዕምነታቸው`, 'lyrics':` በዕምነታቸው ዳኑ ከዚያ ነበልባል * 2
 አናንያ አዛርያ ሚሳኤል * 2
 ናቡከደነጾር ጨካኙ ንጉስ በባቢሎን ሀገር ጣኦት የሚያነግስ ወጣቶች ተነሱ በቅናት መንፈስ
 አናንያ አዛርያ ሚሳኤል * 2 ላሰራኸው ጣኦት አንሰግድም እያሉ በመንፈስ ቅዱስ ሐይል ልባቸውን ሞሉ
 አናንያ አዛርያ ሚሳኤል * 2
 እንደ ሦስቱ ህፃናት በዕምነት ለሚቆመው መለዓኩን ይልካል እግዚአብሔር ሊረዳው ገብርኤል * 2 ከልኡል * 2
 
 
 
 
 
 
 `},{ 'title' :`እጠበኝ ቆሽሻለሁ`, 'lyrics':` እጠበኝ ቆሽሻለሁ አምላኬ በድያለሁ
 ያለ እናት ያሳደግከኝ ያለ አባት የጠበቅከኝ
 ያን ሁሉ ዛሬ ረሳሁ እጠበኝ ቆሻሻለሁ * 2 ከድንኳንህ ብታስገባኝ ሞገስ ሰጥተህ የአፍኒንን ምግባር ይዤ አስቀየምኩህ ቅባ ሜሮን ያተምክበት ልጅነቴ እንዳይጎድፍ ጠብቅልኝ ቸር አባቴ
 ኃይል አኑረህ እንደ ሶምሶን በፀጉሬ ጎልያድን አስጥለኸኝ በጠጠሬ አቅም ቢያንሰኝ በስጋ ጦር ተሸንፌ
 ደጅህ መጣሁ የእንባ መባ በዓይኔ አቅፌ እንዳትረሳኝ በመዳፍህ ቀርጸኸኛል እንዳትተወኝ ያለ መጠን ወድደኸኛል ባትሰነዝር ልትቀጣኝ የሞት በትር የትዕግስትህ ሰሌዳ ነው ለኔ ክብር
 ከከንፈሬ ጥበብ ጽፈህ ቅኔ ሲፈስ በመታበይ አሳዘንኩት ያንተን መንፈስ ፍቅር ግተህ በእቅፍህ ሥር ያሳደግከኝ እባክህን በበደሌ አትቅሰፈኝ
 `},{ 'title' :`ተመስገን እንበል`, 'lyrics':` ተመስገን እንበል ተመስገን * 2 በድል አሳልፈህ ያንን ዘመን አሳይተኸናል ይህን ተመስገን
 ጀርባችን ቢቆስልም በዱላቸው ተገልጦ ባያልቅም መዝገባቸው የጠራን በደጁ ተከለን
 ዓይናቸው እያየ ባረከን ተመስገን መቼ ነው እያልን ናፍቀን ነበር
 ንጋትና ጀንበር ስንቆጥር ይኸው ሞት በቃል ታረደና
 ልባችን ታመነ በአንተ ጸና ተመስገን ግብፅን ጥለን ወጣን ሲኦልን ባህሩን ተሻገርን	እሳቱን
 ኢያሪኮም ፈርሷል በዝማሬ
 ነገም ድሉ ያንተ ነው እንደ ዛሬ	ተመስገን
 
 
 
 
 
 
 ጨለማው አለፈ ፀሐይ ወጣ ጠላት ተሸነፈ ሃይሉን አጣ ጌትነት ውዳሴ ክብር ማዳን
 በዙፋኑ ላለው ለእርሱ ይሁን	ተመስገን
 `},{ 'title' :`ብርሃኔና መድሃኒቴ ነው`, 'lyrics':` ጌታ ብርሃኔና መድሃኒቴ ነው * 2
 የሚያስደነግጠኝ የሚያስፈራኝ ማነው * 2
 አያሳስበኝም የሳኦል ጥላቻ
 ልቤ አይደነግጥም በጎልያድ ዛቻ የምታመንበት ስሙ ጋሻዬ ነው ኃይልና ብርታቴ ጌታ ጉልበቴ ነው
 ሞገስ ይሆነኛል በነገስታቱ ፊት እመሰክራለሁ ስሙን ያለ ፍርሃት አያስጨንቀኝም ሞትና መከራ ሁሉን የሚችለው አለ ከእኔ ጋራ
 ጻድቃንን በገዳም የሚያበረታቸው ሰማዕታትን በደም እንዲህ ያጸናቸው አሁንም ይሰራል የብረሃን ጌታ ስሙን ተሸክሞ በዕምነት ለበረታ
 ከስም ሁሉ በላይ የሚበልጥ ስም ይዟል የማመልከው አምላክ ከሁሉም ይበልጣል ምንስ እሆናለሁ ስሙን ተደግፌ በኢየሲስ ክርስቶስ ጥላ ሥር አርፌ
 `},{ 'title' :`በጌቴሰማኔ`, 'lyrics':` በጌቴሰማኔ በአታክልቱ ቦታ * 2
 ለኛ ሲል ጌታችን በዓለም ተንገላታ * 2 አዳምና ሔዋን ባጠፉት ጥፋት * 2 እኛም ነበረብን የዘለዓለም ሞት * 2
 መስቀል ተሸክሞ ሲወጣ ተራራ * 2
 ይገርፉት ነበረ ሁሉም በየተራ * 2
 በአምላክነቱ ሳይፈርድባቸው * 2
 እንዲህ ሲል ጸለየ አባት ሆይ ማራቸው * 2
 
 
 
 
 በረቂቅ ስልጣኑ ሁሉን የፈጠረ * 2
 በሰው እጅ ተገርፎ ሞተ ተቀበረ * 2
 ድንግል አልቻለችም እንባዋን ልትገታ * 2
 እያየች በመስቀል ልጇ ሲንገላታ * 2
 ፍቅሩን የገለጸው ተወልዶ በስጋ * 2
 ኢየሱስ ክርስቶስ አልፋና ኦሜጋ * 2
 `},{ 'title' :`አልፋና ኦሜጋ`, 'lyrics':` አልፋና ኦሜጋ ፈጣሪ የሆንክ በከሐዲዎች እጅ ተይዘህ ቀረብክ
 ተገፋህ ተደፋህ በጥፊ ተመታህ እየደበደቡህ ክርስቶስ ሆይ አሉህ ጽድቅን ስለሰራህ በወንጀል ከሰሱህ ለአዳም ቤዛ ብለህ ብዙ ተንገላታህ
 ቅድሳት እጆችህ የፊጥኝ ታስረው እንደበግ ተጎተትህ ብትምራቸው የትም ቦታ ያለህ ሁሉን የምታውቅ ፊትህን ሸፈኑህ ለመመጻደቅ
 በአውደ ምኩራብ ከጲላጦስ ዘንድ አሳልፈው ሰጡህ አጋልጠው ለፍርድ ከሐና ቀያፋ ከመሳፍንቱ ደጅ ከነሔሮድስ ዘንድ አቀረቡህ በአዋጅ
 ግርፋት ሕማሙ አልበቃ ብሎህ በመስቀል ላይ ልትውል ተፈረደብህ ሳዶርና አላዶር ዳናትና አዴራ ተፈልገው መጡ ለችንካር በተራ
 አምስቱ ችንካሮች ቅንዋት መስቀል ወገኖችህ መጡ ሥጋህን ለማቁሰል የሰላም ባለቤት ደረትህ ተወጋ ሊያያዝ በችንካር እጅህ ተዘረጋ
 ምራቅ ተፋብህ ራስክን ሊጎዱ ግፈኞች አይሁዶች ባንተ ላይ ቀለዱ
 `},{ 'title' :`ጌታዬ ሆነህ`, 'lyrics':` ጌታዬ ሆነህ ደም ግባት አልባ ጀርባው በጅራፍ ስለኔ ደማ
 
 
 
 
 
 የኔን መገረፍ እርሱ ተገርፎ
 ክብር አለበሰኝ እርሱ ተገፎ * 2
 በሀሰት ሸንጎ ወጥመድ ተጠምዶ ጌታ ተያዘ ሕይወቴን ፈቅዶ ክፉዎች ቢያዩት እንደ ወንበዴ
 ለእኔ ግን ሆኗል መውጫ መንገዴ * 2
 ታስረሃን ስለኔ ኢየሱስ መድህኔ * 2
 ሲዘብቱበት ምራቅ ሲተፉ የማይደፈር ደፍረው ሲዘልፉ በከበቡት ፊት ቃል ከለከለ
 እኔ እንድናገር እርሱ ዝም አለ * 2
 ተወጋህ ስለኔ ኢየሱስ መድህኔ * 2
 ሕይወት መንጭቷል ተወግቶ ጎኑ ለከሳሾቹ ተርፏል ማዳኑ
 እጅ እግሩን ሚስማር ሲቸነክረው
 የሞትን እሾህ ከእኔ ነቀለው * 2
 ተወጋህ ስለኔ ኢየሱስ መድህኔ * 2
 እርቃኑን ሆኖ ፈተው ልብሱን በምህረቱ ጠል ነፍሴን አርክቶ አለመለመኝ እርሱ ተጠምቶ * 2
 ተጠማ ስለኔ ኢየሱስ መድህኔ * 2
 `},{ 'title' :`በእጸ መስቀል ላይ`, 'lyrics':` በእጸ መስቀል ላይ በዚያ አደባባይ * 2
 አምላክ ሆይ ጌታ ሆይ ተንገላታህ ወይ * 2 መስቀል አስይዘው	ኪራያላይሶ ወደ ጎልጎታ 
 ሲገርፉት ሲያዳፉት	
 ስትንገላታ	
 ያንን አቀበት	ኪራያላይሶን ያንን ዳገት 
 ጀርባህ ተገርፎ	
 ስትቃትት	
 አንተን እያዩ	ኪራያላይሶን ሴቶች ሲያለቅሱ 
 እናቶች ቀርበው ላብህን አበሱ	
 
 
 
 
 መስቀል አስይዘው	ኪራያላይሶን እንዲያ ሲያዳፉህ 
 የቀሬናው ሰው	
 ስምኦን አገዘህ	
 `},{ 'title' :`የህያዋን አምላክ`, 'lyrics':` የህያዋን አምላክ ሙታን ሊያስነሳ በእኩለ ሌሊት ክርስቶስ ተነሳ * 2
 ሙታን አይደለንም	ክርስቶስ ተነሳ ህያዋን ነን እኛ 
 በመስቀል ያዳነን	
 ከሃጢያት ቁራኛ	
 የተዋረድነውን	ክርስቶስ ተነሳ ሊያከብረን ዳግመኛ 
 ሞትን አሸንፎ	
 ተነሳልን ለእኛ	
 እናንተስ አትፍሩ	ክርስቶስ ተነሳ እመክራችኋለሁ 
 የተሰቀለውን	
 እንድትሹ አውቃለሁ ህያዋን ከሙታን	ክርስቶስ ተነሳ ለምን ፈለጋችሁ 
 እንደተናገረ	
 ተነስቷል ጌታችሁ	
 ክርስቶስ ሲነሳ	ክርስቶስ ተነሳ በእኩለ ሌሊት 
 አስቀድሞ ታየ	
 ለመቅደላዊት	
 `},{ 'title' :`የፍቅር እናት`, 'lyrics':` የፍቅር እናት የሰላም * 2
 ይናፍቀኛል ስምሽን ሳልጠራው ስቀር ማርያም በሕይወቴ ውስጥ በኑሮዬ
 ቅደሚ ከፊት ከኋላዬ ተደላደለ ልቤ
 አንቺ አለሽና ከአጠገቤ
 
 
 
 
 
 
 ምኞቴም ይስመር ድብቅ ህልሜ ልለፍ ወጀቡን ተቋቁሜ
 የጌታዬ እናት ነሽ
 ኃይልን ያደርጋል ጸሎትሽ
 እንዴት እቀራለሁ ከመንገድ አደራ እናቴ አስቢኝ ለሚያስጨንቀኝ ጠላት ለሚያሳድደኝ አትስጪኝ
 ትላንትም ዛሬም አመስጋኝ ነኝ የለም ለነገ የሚያስፈራኝ
 ሜዳ ይሆናል ተራራ ልጅሽ ስላለ ከኔ ጋራ
 እንዴት እቀራለሁ ከመንገድ አደራ እናቴ አስቢኝ ለሚያስጨንቀኝ ጠላት ለሚያሳድደኝ አትስጪኝ
 `},{ 'title' :`በማህፀን ቅኔ`, 'lyrics':` በማህፀን ቅኔ ለማርያም ተሰማ ከተራራማ ሀገር በኤፍሬም ከተማ ዮሐንስ ይናገር በረሃ ያደገው ድንግል ስትናገር ምን እንዳዘለለው
 የእናቱ ማህፀን የቅኔ ርስት ሆነች ድንግል የአምላክ እናት ፊቱ ስለቆመች በሐሴት ዘለለ ዘመረ በደስታ
 ከድንግል ሲወጣ ታላቁ ሰላምታ በድንግል ማህፀን ስላየ ጌታውን
 ከመወለድ ቀድሞ ሰማነው መዝሙሩን ትንቢቱ ሲፈጸም በሆድዋ ሲነግስ
 ሰገደ ለአምላኩ የስድስት ወር ፅንስ ጀመረ ስብከቱን ገና ሳይወለድ
 ተፈጥሮ መች ቻለች ነብዩን ለማገድ አፉ ተከፈተ በታላቅ ምስጋና
 ከእናቱ ማህፀን ድምፅን አሰማና የዮሐንስ እናት ኤልሣቤጥ ገረማት
 ልጇ በማህፀን ቅኔ ሲቀኝላት
 ድምጿን ከፍ አረገች ዓለም እንዲሰማ ሞላት መንፈስ ቅዱስ ለመዝሙር ለዜማ
 
 
 
 
 
 `},{ 'title' :`ልቤ በእግዚአብሔር ጸና`, 'lyrics':` ልቤ በእግዚአብሔር ጸና * 2
 አፌን አላቀኩኝ ለስሙ ምስጋና
 በጠላቶቼ ላይ አፌ ተከፈተ ማዳኑን አይቼ ልቤ ተደሰተ
 እንደ እግዚአብሔር ያለ ረዳት ማን አለ ደካማ ባሪያውን ስለተመለከተ
 ጠግበው የነበሩ እንጀራን ተራቡ ተርበው የነበር እንጀራን ጠገቡ
 መች ጎድሎብኝ ያውቃል አንተን ተደገፌ በእጆችህ በረከት ተሞልቷል መዳፌ
 እግዚአብሔር ይገድላል እንዲሁም ያድናል የኃይለኞችን ክንድ ሰብሮ ይታደጋል መካኒቱ ሐና ወለደች ሰባት
 ስራህ ይደንቀኛል በቀን በሌሊት ምስኪኑን ከጉድፍ ያነሳል ከምድር ይዘረጋለታል የክብሩን ወንበር
 ተመከረ ልቤ ሐናን ተመልክቶ እግዚአብሔር ለጋስ ነው ለጠበቀው ተግቶ
 `},{ 'title' :`ይበራል በክንፉ`, 'lyrics':` ይበራል በክንፉ ምልጃውም ፈጣን ነው የአምላክ ስም አለበት ስሙ ሚካኤል ነው ያሳደገኝ መልዓክ ዛሬም ከእኔ ጋር ነው * 2
 ከፊቴ ቀደመ ደመናን ዘርግቶ እንዳልደናቀፍ ጉድባዎቼን ሞልቶ ዛሬ ላለሁበት ብርቱ ጉልበት ሆነኝ
 ሰው ለመባል በቃሁ ሚካኤል ደገፈኝ በእናቴ እቅፍ ገብቼ መቅደሱ
 አለሁ እስከዛሬ አጥሮኝ በመንፈሱ የሕይወቴን ሰልፎች አለፍኩ ከእርሱ ጋራ ተጽፏል በልቤ የሚካኤል ስራ
 በዚሪያዬ ተክሎ የእሳት	ምሶሶውን ጽድቅ እየመገበ አሳደገኝ ልጁን የአምላኬን ምስጋና ዘውትር እያስጠናኝ እርሱ ነው ሚካኤል በመዝሙር የሞላኝ
 ፊት ለፊት ተተክሎ ከታናሿ መንደር ይሰማኝ ነበረ ቅኔው ሲደረደር
 
 
 
 
 የወስደኛል ደጁ እየቀሰቀሰ ታላቁን በረከት በውስጤ አፈሰሰ
 ሴኬምን እንዳላይ ክንፎቹን ጋረደ መራኝ ወደ ሕይወት መዳኔን ወደደ የሞአብን ቋንቋ ከአፌ ላይ አጥፍቶ በጸጋው ቃል ቃኘኝ በበረከት ሞልቶ
 `},{ 'title' :`ዘምር ዘምር አለኝ`, 'lyrics':` ዘምር ዘምር አለኝ ልቤ ተነሳሳ * 2 የአምላኬን ቸርነት እንዴት ብዬ ልርሳ ያደረገልኝን እንዴት ብዬ ልርሳ
 የሚቃጠለው ስብ በፊትህ ምንድን ነው ሰማይና ምድር ሁሉ ገንዘብህ ነው ያለኝን ሰብስቤ ባኖረው ከፊትህ
 ዋጋ አይሆንም ጌታ ስለ ቸርነትህ ይበዛል ይሰፋል የእግዚአብሔር ምስጋና አይቆምም በዘመን ማዕበል ነውና
 እንኳን ድንጋይ ቀርቶ ጋራው ቢናድብኝ የከንፈሬን ፍሬ ማንም አይወስድብኝ
 የጳውሎስ የሲላስ መከራ ቢጸና አልተውም ቅኑውን የአምላክን ምስጋና ሊያስጥለኝ አይችልም እስር ሰንሰለት አለብኝ ውለታ የሰማዩ አባት
 የተደረገለት ብዙ የተቀበለ ይኖራል በፍቅሩ እየተቃጠለ ክብሬን ሁሉ ትቼ ልዘምርልህ
 ይህ ነው ችሎታዬ ላንተ የምሰጥህ
 `},{ 'title' :`አንድ አድርገን`, 'lyrics':` አንድ አድርገን ጌታ ሆይ አንድ አድርገን ሰላምህን ፍቅርህንም ለግሰን
 ቤተ ክርስቲያን ሆይ ምነው ተረበሽ አንድነትሽ ጠፍቶ ሰላምን አጣሽ አንደኛው ሲጠቅምሽ ሌላኛው ሲጎዳሽ ብዙ ልጆች ወልደሽ የወላድ መካን ሆንሽ
 በዘርና ጎሳ ስንከፋፈል ቅጥራችን ፈረሰ በጠላታችን
 
 
 
 
 
 መሳለቂያ ሆነን በየአደባባዩ ልዩነትን አይተው ብዙዎች ተለዩ
 ላያችን የሚያምር ልስን መቃብሮች አስመስለን ያለን የሀሰት አማኞች በመካከላችን ፍቅርን አስወጥተን እንደ ርብቃ ልጆች እንገፋፋለን
 ለዕምነት ያልቆመው በውሸት ሲከሰን አንድነት ሳይኖረን ዘመንን አስቆጠርን ያ ጥቅም ፈላጊው ሰምን እያጠፋ ለስጋው የሚሆን ርስቱን አሰፋ
 `},{ 'title' :`በአምላካችን አንጻር`, 'lyrics':` በአምላካችን አንጻር እንዘምራለን በእግዚአብሔር ቅዱሳን በግርማ ተከበን * 2
 ሠማይ ተከፈተ	ደስ ይበለን ማሕሌት ተሰማ 
 ዛሬ ተከበናል	
 በመለኮት ግርማ በሰማይ ተሰማ የመላዕክት መዝሙር የሠላም የደስታ የእውነት የፍቅር * 2
 ደመና ከበበን ድንግል ተደሰተች
 የሕዝቡን መመለስ ትመለከታለች * 2
 ታላቅ ደስታ ነው በሰማይ ሠራዊት
 ሰይጣን ድል ተነስቶ እኛ ስንባረክ * 2
 ሰዎች እልል በሉ ውስጣችን ይታደስ
 አምላክ ከእኛ ጋር ነው በልባችን ሊነግስ * 2
 `},{ 'title' :`ፈተና ወጀብ ቢበዛ`, 'lyrics':` ፈተና ወጀብ ቢበዛ አይተናል ህዝቡን ሲያበዛ
 በሕይወት አንዴ ጠርቶናል እግዚአብሔር መች ይተወናል * 2
 ፍቅር ነው የናርዶስ ሽቶ ወደደን ተሰቅሎ ሞቶ ነጎድጓድ መብረቅ ቢሆንም
 በሕይወት አለን አሁንም * 2
 መኳንንት ደጁን ክፈቱ የጸጋው ፈልቷል ዘይቱ
 
 
 
 
 ተራግፏል ሸክማችን ምህረቱ ቢፈስልን * 2
 ተጽናንቷል አርፏል ልባችን በእሳት ታጥሯል ቅጥራችን ብንወድቅም አንሸነፍም
 ይዘናል የአምላካችን ስም * 2
 ሕይወት ነህ የጽድቅ ጥላ ያውቅሃል ቃል የተመላ
 ነህ አንተ ጣፋጭ ምግባችን
 እግዚአብሔር ቸሩ አምላካችን * 2
 `},{ 'title' :`ድንግል ትንሣኤሽን`, 'lyrics':` ድንግል ትንሣኤሽን እስከምናይ ድረስ ገብተናል ሱባኤ በአንድነት በመንፈስ ለእኛ እስከሚገለጥ ቶማስ ያየው እውነት
 አንወጣም ከደጅሽ ኪዳነ ምህረት * 2
 ሞትን የረገጠ ልጅሽ ካንቺ ጋር ነው ውጦ የሚያስቀርሽ የቱ መቃብር ነው የእርገትሽን ዜና ከቶማስ ሰምተናል ትንሣኤሽ እውነት ነው ሰበንሽን አይተናል
 ሞትማ በሞት ተሸንፏል በአንቺ ላይ እንዴት ኃይል ያገኛል * 2 ልናየው ወደድን የቶማስን ክብር
 ለምን ተሰወረን የትንሣኤሽ ምስጢር በራችንን ዘግተን በጸሎት ወድቀናል ተገልጠሽ አብሪልን ልጆችሽ ናፍቀናል
 ሞትማ በሞት ተሸንፏል በአንቺ ላይ እንዴት ኃይል ያገኛል * 2 መዝሙረኛ አባትሽ ዳዊት ጽፎልናል
 ሞትን የማያይ ሰው ማን አለ ብሎናል ይህ እውነት በዘመን አንቺ ላይ ቢደርስም በሞት ተሸንፈሽ መቃብር አትወርጂም
 ሞትማ በሞት ተሸንፏል በአንቺ ላይ እንዴት ኃይል ያገኛል * 2 ቶማስ ከደመናው ወርዶ ሲያናግረን
 ስለሆነው ነገር እጅጉን ተመስጥን እኛም ይህን ክብር ተመኘን ለማየት ድንግል አሳስቢልን ኪዳነ ምህረት
 ሞትማ በሞት ተሸንፏል በአንቺ ላይ እንዴት ኃይል ያገኛል * 2
 
 
 
 
 
 `},{ 'title' :`የአብ ቃል አክብሮሽ`, 'lyrics':` የአብ ቃል አክብሮሽ እናት ያደረገሽ እግዚአብሔር በቃሉ ፍጹም ያከበረሽ የምንመካብሽ መሰላል አንቺ ነሽ * 2
 ቅድስና ለአንቺ ጽድቅም ለአንቺ ሆኖ ዓለምን የፈጠረ በአንቺ ተወስኖ የገነት ፍሬ ነሽ ሕይወትን ያፈራሽ አንቺን ለመረጠ አንቺን ለአጸናሽ
 ምስጋና ይድረሰው ለቸሩ አምላክሽ * 2
 አዳም የኖረብሽ የኤዶም ገነት ነሽ የኤፌሶን ወርቅ የሚፈልቅብሽ
 የግዮን ማዕበል ኢትዮጵያን የከበብሽ ዮርዳኖስ ሆነሽ አህዛብን ፈወስሽ
 በልጁ ቃልነት አብም አከበረሽ * 2 መዓዛሽን ወዶ ወልድ ዋህድ ዋጀሽ አብም በሰማያት በህሊናው ጻፈሽ
 መንፈስ ቅዱስ መጥቶ አንቺን አከበረሽ
 እመካብሻለሁ እመቤቴ ስልሽ * 2
 ወልድ በመውደዱ ከአንቺ መወለዱን ንጹህ ሆኖ አግኝቶሽ ቅዱሱን ስጋሽን ለቃሉ ማደሪያው ጽላቱና ታቦት በብሩህ ደመና ተመስለሽለት
 ከስጋሽ ተከፍሎ ከደምሽ ደም ወሰዶ
 ከነፍስሽም ነፍስ ፍጹም ተዋህዶ * 4
 `},{ 'title' :`የእቲሳ አንበሳ`, 'lyrics':` የእቲሳ አንበሳ ተክልዬ ተነሳ ወገንህን ታደገው ከሃጢያት አበሳ
 ተኩላው ለምድ ለብሶ በእርግጥ መጥቷልና ጴጥሮስ ሆይ ዝም አትበል እንደ ጥንቱ ቅና ዮሐንስ ዝም አትበል እንደ ጥንቱ ቅና
 የዓለም ምናምንቴ የተባልከው ቅዱስ የዋሁ መነኩሴ አባ ሕርያቆስ
 ቅዳሴ ማርያምን ናና ዛሬ ቀድስ
 በዕጣኑ መዓዛ ድውያንን ፈውስ * 2
 
 
 
 
 
 
 የወንጌል አንበሳ ጎርጎርዮስ ፍጠን ምሶሶው ሳይወድቅ መንጋው ሳይበተን መብረቁ አትናቴዎስ ሞገዱን ገስጸው
 አፈ ጉባኤያችን በመስቀልህ ዳኘው * 2 መርከቧን የሚያውክ መብረቅ መጥቷልና አምላካችን ፈጥነህ አድነን ቶሎ ና
 ጴጥሮስ ሆይ ቀስቅሰው ልንጠፋ ነው ብለህ
 ሞገዱ እያየለ ዝም እንዳይል ጌታ * 2
 ከሳቴ ብርሃን ሰላማ ቶሎ ና ኖላዊ እረኛ ያስፈልጋልና ስጋውን የጎዳ ነፍሱን የጠቀመ
 ነቅ ጉድፍ የሌለው ግብሩ የታረመ * 2
 `},{ 'title' :`ገብርኤል ኃያል`, 'lyrics':` ገብርኤል ኃያል መላከ ሰላም መላከ ብስራት የምታወጣ የእግዚአብሔርን ሕዝብ ከሚነድ እሳት ፍቅርህ ተስሏል በልባችን
 ፊትህ ቆመናል ባርከን ብለን
 የጽናታቸው ዝናው ሲሰማ ከዚያች ባቢሎን ከሞት ከተማ ህፃናት ሳሉ በራ ዕምነታቸው ቆመህ ተገኘህ መካከላቸው
 ውሃው ሲዘልል ቢያስደነግጥም በጋኖቹም ውስጥ ቢለዋወጥም ጸንተው ዘመሩ ልጅና እናቱ አንተ ስትደርስ ከዚያ ከእሳቱ
 ቂርቆስም ጸና ሞትን ሳይፈራ አንተ ሳላለህ ከነርሱ ጋራ አትፍሪ አላት ስለምን ትፍራ አምነው ድል ነሱት ያንን መከራ
 እኔም አምናለሁ አድነኝ ብዬ ቆመህ አማልደኝ ከቸር ጌታዬ ክፉውን ዘመን የማልፍበት ጽናትን ስጠኝ ድል ልንሳበት እኔም አምናለሁ አድነኝ ብዬ * 2
 
 
 
 
 
 
 
 
 `},{ 'title' :`ጽላት ዘሙሴ`, 'lyrics':` ጽላት ዘሙሴ ዕፀጳጦስ ዘሲና * 2 ፀናጽል ፀናጽል * 5 ለአሮን ካህን ኧኸ ኧኸ ፀናጽል * 5 ለአሮን ካህን
 አልፌያለሁና እመቤቴ ያን ሁሉ መከራ
 ከኔ ጋር ስለሆንሽ እመቤቴ ስምሽን ስጠራ * 2 በዚያ በጭንቅ ቀን	ድንግል እጅግ በሚያስፈራው 
 ማን ያድነኝ ነበር	
 ስምሽን ባልጠራ	
 በሞትና ሕይወት	
 መካከል ቢሆንም	
 ታምርሽ አነሳኝ	
 ማርያም አልተውሽኝም ድንግል አልተውሽኝም እጅግ የከበደ ነበረ ያገኘኝ ፈተና
 ታሪክ ሆኖ ቀረ እመቤቴ ባንቺ ዳንኩኝና * 2 ዙሪያው የሚያስፈራ	ድንግል ጽኑ ነው ገደሉ 
 በዚያ የወደቁ	
 እንዴት ይተርፋሉ	
 ስምሽ ድጋፍ ሆኖ	
 ከሥር ተነጠፈ	
 በሚያስደንቅ ምስጢር	
 ሕይወቴ ተረፈ	
 `},{ 'title' :`ሰዎች ፈረዱብኝ`, 'lyrics':` ሰዎች ፈረዱብኝ አንተ ግን አዳንከኝ * 2 አምላኬ ሆይ ተመስገንልኝ * 2
 ሌላ ምን ቃል አለኝ
 ሊያልፉኝ አልወደዱም ነቄን ሊሰውሩ ሰዎች ፈጠኑብኝ በደሌን ሊያወሩ አንተ ግን ሰብስበህ በፍቅር ሸፈንከኝ በመተላለፌ አዝነህ ሳትለየኝ
 ይህ ፍቅርህ ሰበረኝ አጣበቀኝ ከአንተ ደጅህ ያወጣኛል ሁሌ እየጎተተ * 2
 መርከሴን አውጀው ሲያነሱብኝ ድንጋይ ሰወረኝ ታምርህ ልጅህ ሳልሰቃይ
 ወደህ ስለማርከኝ ክፉዎች ተከዙ
 ይህ አይደለም ብለው የኃጢአት ደሞዙ
 
 
 
 
 ከአንተ በላይ ጌታ ማን ሊያውቀኝ ይችላል * 2 የፍቅርህን ሚዛን ማንስ ያዛባዋል * 2
 ማዳንህ ይደንቃል ለወደኩት ልጅህ ምህረትህ ይደፋል ሁሌም በሚዛንህ እንደሰው አይታይ ፍርድህም ይለያል ለባርያህ አርነት በምህረት ፈርደሃል
 ፍቅር እየዘረዘርክ መንገዴን የጠረግህ * 2 ስለ ልጅህ ጽድቅን ለድህነት የፈረድክ * 2
 እኔ አልፈርድብህም በሰላም ሂድ አልከኝ ዳግም እንዳልበድል በፍቅር እያየኸኝ ወደ ጽድቅህ ህጎች ነፍሴን አፈሳለሁ እንዲህ ከወደድከኝ ወዴት እሄዳለሁ
 አልለይም ካንተ ከፍቅር መድረኬ * 2 አመልካለሁ አንተን ፊትህ ተንበርክኬ * 2
 `},{ 'title' :`ኪዳነ ምህረት እናቴ`, 'lyrics':` ኪዳነ ምህረት እናቴ አማልጅኝ እኔን ከልጅሽ የፍቅር እናት ነሽና አማልጅኝ እኔን ከልጅሽ የሰላም እናት ነሽና አማልጅኝ እኔን ከልጅሽ
 የተገለጠው ብርሃን ከምስራቅ የተወለደው በፍቅር ሰንሰለት አስሮ ዓለምን ሁሉ አዳነው * 2
 እንደው ዝም ብሎ ይገርመኛል የአምላክን ሥራ ሳስበው ምክንያት አንቺን አድርጎ ይህንን ዓለም አዳነው * 2
 በረሃውን ባሰብኩት ጊዜ የግብጽን አሸዋ ግለት
 አንቺ ትንሽ ብላቴና ኧረ እንዴት ቻልሽው በእውነት * 2
 `},{ 'title' :`እንዲህ እናምናለን`, 'lyrics':` እንዲህ እናምናለን እንታመናለን * 2
 አብ ወልድ መንፈስ ቅዱስ አንድ እግዚአብሔር ብለን * 2 የእግዚአብሔር አብ ፍቅሩ ይሰፋል ይረቃል ልጁን እስኪሰጠን እንዲሁ ወዶናል
 በደብረ ታቦር ላይ እርሱን ስሙት ላለው * 2 በመዝሙር ለቃኘን ምስጋና ይድረሰው * 2
 አብርሃም ይስሃቅን አባት እንደሆነው አይደለም ልደቱ በአማን ልዩ ነው የተወለደ ነው ከቶ አልተፈጠረም * 2 ከአባቱ ጋር ቅድመ ዓለም የኖረ * 2
 ሊያጽናናን የሚላክ ከአብ የሚወጣ በሃምሳኛው ዕለት ወደ እኛ የመጣ
 
 
 
 የራሱ የሆነ ፍጹም አካል ያለው * 2
 ጰራቅሊጦስ ጌታ እግዚአብሔር አምላክ /ቅዱስ/ ነው * 2 በዕደ ዮሐንስ ሲጠመቅ በማይ
 ወልድ አምላክ መሆኑን ስንሰማ ከላይ በአምሳለ እርግብ ወርዶ በርሱ የኖረው * 2 አካላዊው ቃል እስትንፋስ ሕይወት ነው * 2`},{ 'title' :`ኢትዮጵያዊው ጻድቅ`, 'lyrics':` ኢትዮጵያዊው ጻድቅ ማነው ብዬ ጠየኩ በረከት ፈልጌ ልሳለመው ናፈኩ
 ክብሩን ልመሰክር ተፈታ ምላሴ ከደጁ ደርሼ ፍቅሩን በመቅመሴ
 በእቲሳ ምድር ዘር ሆነህ በቅለህ ተለየህ ለአምላክ ዓለምን ጥለህ ደብረ ሊባኖስ ህያው ምስክር ስለ አንተ ዝና ስለ አንተ ክብር
 ተ/ሃይማኖት ወዳጄ ተባርኳል በአንተ ጓዳ ደጄ አክባሪው አምላክ ስላከበረህ
 ዛሬም ከእኛ ጋር በመንፈስ አለህ ደጅ እንጠናለን በትህትና የጻድቅ ጸሎት ሃይል አላትና
 ተ/ሃይማኖት ፀሐይ ጸጋህ ይምጣልኝ ከሰማይ ወደ ለምለም መስክ ሰብከህ መራኸን የቃሉን ወተት አጠጥተኸን ያቀጣጠልከው የወንጌል ችቦ የአምላክ አድርጓል ትውልዱን ስቦ
 ተ/ሃይማኖት ወዳጄ ተባርኳል በአንተ ቤቴ ደጄ ሰላሳ ስልሳ መቶ ያፈራሕ
 በደብረ አስቦ ቆመህ በአንድ እግርህ የመቶ ሎሚ መሻት ቀረና
 የጌታ መንገድ ጥርጊያውም ቀና
 ተ/ሃይማኖት ወዳጄ ተባርኳል በአንተ ጓዳ ደጄ`},{ 'title' :`ባርከን ባርከን`, 'lyrics':` ባርከን ባርከን ልጆችህን ባርከን * 2 ኧኸ ቅዱስ መንፈስህ አንድ ሃሳብ አድርገን * 2 ባርኪን ባርኪን ልጆችሽን ባርኪን
 ድንግል ሆይ በምልጃሽ አንድ ሃሳብ አድርጊን * 2 ድንግል ሆይ በምልጃሽ ከልጅሽ አስታርቂን * 2
 
 
 
 
 ጥሪህን ስንሰማ ወደ አንተ እንድንመጣ በሕግህ ልንኖር ከቤትህ ላንወጣ በሕይወት ስንደክም እንዳንጠፋ በዓለም እርዳን ፈጣሪያችን ቸሩ መድኃኒዓለም ባርከን ባርከን
 ተፈረደብን የባርነት ሕይወት መጣብን መርገም በመብል ምክንያት ሲኦል እስራት እኛ የዳንብሽ
 ድንግል ሆይ ምንጊዜም አይለየን ምልጃሽ ባርኪን ባርኪን
 አንድነት ስናጣ ፍቅር ስትመነምን በምግባር ስንደክም ሲጎል እምነታችን በስጋችን ፈቃድ ወደን እንዳንጠፋ በምህረትህ ጎብኘን አንተ ሁነን ተስፋ ባርከን ባርከን
 ንጽህተ ሕሊና ቅድስት እናታችን አሳስቢ ሁልጊዜ ስለ ሃጢአታችን ሊያድነን ነው እና ክርስቶስ በሞቱ አስምሪን እማምላክ ድንግል ወላዲቱ ባርኪን ባርኪን`},{ 'title' :`የአፎሚያ ረዳት`, 'lyrics':` የአፎሚያ እረዳት ነህ ሚካኤል * 2 ቅሩበ እግዚአብሔር የልዑል
 ፈጥነህ ድረስልን ስንጠራህ ሚካኤል ፊት ለፊታችን አምላክ ሰደደህ
 አቀናህልን መንገዱን ጠርገህ የቤሊሆርን ምክር እያፈረስክ ከልጆችህ ጋር ከነዓን ደረስክ
 ከእኛ ጋር ነበርክ አርባውን ዘመን እንጠራሃለን ሚካኤል ብለን
 በቃዴስ ክንፍህ ተዘርግቶልን ደመናው ባንተ ተጋረደልን አብረኸን ልትሆን ጌታ የላከህ አንተ ሚካኤል ታዳጊያችን ነህ
 ሙሴ ሲለየን ደጉ አባታችን ሚካኤል ነበርክ ከላይ መሪያችን የባርነቱ ጉዞ እስኪያበቃ
 እጅግ ረዳት የእኛ ጠበቃ
 ሳጥናኤል መክሮን የሐሰት ምክር ሊወስደን ሻተ ሙሴ መቃብር ስለማይጠቅመን አንተ ሰወርከው ምክሩን በታትነህ አስጎነበስከው
 `}]

 export default l